"ui"
function 测码() {
  auto.waitFor();
  console.show();


  //显示当前时分秒
  //function formatDate() {
  //var year = d.getFullYear();
  //var month = d.getMonth() + 1;
  //var date = d.getDate();
  //var hour = d.getHours();
  //var day = d.getDay()
  //var minute = d.getMinutes();
  //var second = d.getSeconds();
  //var millisecond = d.getMilliseconds();
  //var 时间 = （ year + "-" + month + "-" + date + " " + hour + ":" + minute + ":" + second + ":" + millisecond）;
  //}
  //console.log(时间)
  //

  //显示当前时间
  var d = new Date();
  console.log(d)
  //

  //获取实时时间戳
  function timestamp() {
    var d = new Date
    var hour = d.getHours();
    var minute = d.getMinutes();
    var second = d.getSeconds();
    var millisecond = d.getMilliseconds();
    var t = (hour + ":" + minute + ":" + second + ":" + millisecond);

    //return t
    console.log(t)
  }
  //

  // 获取时分秒用于记录日志
  function logWithTime(msg) {
    timestamp() + console.info(" " + msg);
  }
  //

  //向上滑动
  function upslide() {
    var c = device.width;
    var b = device.height;
    toast("正在滑动")
    swipe(c / 2, b / 10 * 9, c / 2, b / 10, 500);
  }
  //

  //解锁手机
  if (!device.isScreenOn()) {
    toast("正在唤醒");
    logWithTime("正在唤醒");
    device.wakeUp();
    sleep(500);

    sleep(500);

  } else {
    toast("未锁屏");
    logWithTime("未锁屏");
  }
  //

  //解锁应用锁
  function unlock() {
    if (packageName("com.miui.securitycenter").exists()) {
      logWithTime("检测到应用锁");
      if (id("lockPattern").exists()) {
        logWithTime("检测到密码验证");
        logWithTime("正在验证");
        //gesture(延迟(多手势) , 持续时间 , 点1 ，点2 ， ......)
      } else {
        logWithTime("非密码验证")
        logWithTime("正在寻找切换")
        //此处需要增加两个个浏览近期任务recents()动作
        sleep(500)
        recents()
        sleep(500)
        recents()
        id("finger_password_switch").findOne().click()
        logWithTime("正在切换密码验证");
        id("lockPattern").findOne();
        logWithTime("正在验证")
      }
      sleep(1000)
      gesture(1250, [335, 2360], [710, 1975], [1105, 1975], [1105, 2360], [1105, 2745], [710, 2745], [335, 2745], [710, 2360], [335, 1975])
      logWithTime("验证成功")
    } else {
      logWithTime("未发现应用锁")
    }
  }
  sleep(2000)
  //
  const tiku = [

    { "q": "我们加快推进科技自立自强,全社会研发经费支出从一万亿元增加到二万八千亿元,居世界第(    )位,研发人员总量居世界首位。", "a": "B", "F": "", "E": "", "D": "三", "C": "一", "B": "二", "A": "五" },
    { "q": "我们要拓展(     ),深刻洞察人类发展进步潮流,积极回应各国人民普遍关切,为解决人类面临的共同问题作出贡献,以海纳百川的宽阔胸襟借鉴吸收人类一切优秀文明成果,推动建设更加美好的世界。", "a": "B", "F": "", "E": "", "D": "底线思维", "C": "系统观念", "B": "世界眼光", "A": "创新思维" },
    { "q": "未来(    )是全面建设社会主义现代化国家开局起步的关键时期。", "a": "B", "F": "", "E": "", "D": "十年", "C": "四年", "B": "五年", "A": "三年" },
    { "q": "当前,我国处于近代以来最好的发展时期,世界处于百年未有之大变局,两者同步交织、相互激荡。\"两个大局\":一个是世界百年未有之大变局,一个是(    )。", "a": "B", "F": "", "E": "", "D": "\"四个全面\"战略布局", "C": "人类命运共同体之大局", "B": "中华民族伟大复兴的战略全局", "A": "社会主义现代化强国建设的全局" },
    { "q": "在(     )的指导下,中国共产党团结带领中国人民,自信自强、守正创新,统揽伟大斗争、伟大工程、伟大事业、伟大梦想,创造了新时代中国特色社会主义的伟大成就,为实现中华民族伟大复兴提供了更为完善的制度保证、更为坚实的物质基础、更为主动的精神力量。", "a": "A", "F": "", "E": "", "D": "\"三个代表\"重要思想", "C": "科学发展观", "B": "邓小平理论", "A": "主席新时代中国特色社会主义思想" },
    { "q": "实践告诉我们,中国共产党为什么能,中国特色社会主义为什么好,归根到底(     )。", "a": "A", "F": "", "E": "", "D": "是因为核心价值观行", "C": "是因为中国文化博大精深", "B": "是因为凯恩斯主义行", "A": "是马克思主义行,是中国化时代化的马克思主义行" },
    { "q": "中国特色社会主义制度的最大优势是(    )。", "a": "D", "F": "", "E": "", "D": "中国共产党领导", "C": "以人民为中心", "B": "人民利益为根本出发点", "A": "马克思主义思想指导" },
    { "q": "我们要增强(     ),聚焦实践遇到的新问题、改革发展稳定存在的深层次问题、人民群众急难愁盼问题、国际变局中的重大问题、党的建设面临的突出问题,不断提出真正解决问题的新理念新思路新办法。", "a": "B", "F": "", "E": "", "D": "政治意识", "C": "看齐意识", "B": "问题意识", "A": "核心意识" },
    { "q": "2022年10月16日,在中国共产党第二十次全国代表大会上,主席代表第十九届中央委员会向大会作了题为(    )的报告。", "a": "C", "F": "", "E": "", "D": "《坚定不移沿着中国特色社会主义道路前进 为全面建成小康社会而奋斗》", "C": "《高举中国特色社会主义伟大旗帜 为全面建设社会主义现代化国家而团结奋斗》", "B": "《决胜全面建成小康社会 夺取新时代中国特色社会主义伟大胜利》", "A": "《高举中国特色社会主义伟大旗帜 为夺取全面建设小康社会新胜利而奋斗》" },
    { "q": "不断谱写马克思主义中国化时代化新篇章,是当代中国共产党人的(    )。继续推进实践基础上的理论创新,首先要把握好新时代中国特色社会主义思想的世界观和方法论,坚持好、运用好贯穿其中的立场观点方法。", "a": "C", "F": "", "E": "", "D": "中心任务", "C": "庄严历史责任", "B": "初心使命", "A": "奋斗目标" },
    { "q": "党的二十大的主题是:高举中国特色社会主义伟大旗帜,全面贯彻新时代中国特色社会主义思想,弘扬(    ),自信自强、守正创新,踔厉奋发、勇毅前行,为全面建设社会主义现代化国家、全面推进中华民族伟大复兴而团结奋斗。", "a": "C", "F": "", "E": "", "D": "伟大奋斗精神", "C": "伟大建党精神", "B": "伟大创造精神", "A": "伟大团结精神" },
    { "q": "(     )吸收了\"协和万邦\"\"天下一家\"的和合智慧。", "a": "C", "F": "", "E": "", "D": "全面深化改革", "C": "推动构建人类命运共同体", "B": "坚持以人民为中心", "A": "人与自然和谐共生" },
    { "q": "党的百年奋斗成功道路是党领导人民独立自主探索开辟出来的,马克思主义的中国篇章是中国共产党人依靠自身力量实践出来的,贯穿其中的一个基本点就是中国的问题必须(     ),由中国人自己来解答。", "a": "D", "F": "", "E": "", "D": "从中国基本国情出发", "C": "推动高质量发展", "B": "实施科教兴国战略", "A": "坚持深化改革开放" },
    { "q": "十年来,我们经历了对党和人民事业具有重大现实意义和深远历史意义的三件大事:一是迎来中国共产党成立一百周年,二是中国特色社会主义进入(    ),三是完成脱贫攻坚、全面建成小康社会的历史任务,实现第一个百年奋斗目标。", "a": "B", "F": "", "E": "", "D": "新时期", "C": "新的发展阶段", "B": "新时代", "A": "新征程" },
    { "q": "中国共产党人深刻认识到,只有把马克思主义基本原理同中国具体实际相结合、同(    )相结合,坚持运用辩证唯物主义和历史唯物主义,才能正确回答时代和实践提出的重大问题,才能始终保持马克思主义的蓬勃生机和旺盛活力。", "a": "B", "F": "", "E": "", "D": "世界先进文明成果", "C": "伟大复兴中国梦", "B": "中华优秀传统文化", "A": "社会主义核心价值观" },
    { "q": "把握住了(    ),就掌握了主席新时代中国特色社会主义思想的核心要义和基本精神。", "a": "D", "F": "", "E": "", "D": "\"十个明确\"", "C": "\"十四个坚持\"", "B": "\"四个全面\"战略布局", "A": "\"五位一体\"总体布局" },
    { "q": "主席新时代中国特色社会主义思想提出人与自然是和谐共生的生命共同体,绿水青山就是金山银山,是对(     )的新发展。", "a": "D", "F": "", "E": "", "D": "马克思主义自然观", "C": "马克思主义认识论", "B": "唯物史观", "A": "马克思主义社会矛盾学说" },
    { "q": "党的(    )报告提出,我国社会主要矛盾已经转化为人民日益增长的美好生活需要和不平衡不充分的发展之间的矛盾。", "a": "A", "F": "", "E": "", "D": "十七大", "C": "十八大", "B": "十六大", "A": "十九大" },
    { "q": "十年来,我们创立了新时代中国特色社会主义思想,明确坚持和发展中国特色社会主义的基本方略,提出一系列治国理政新理念新思想新战略,实现了马克思主义(    )新的飞跃,坚持不懈用这一创新理论武装头脑、指导实践、推动工作,为新时代党和国家事业发展提供了根本遵循。", "a": "B", "F": "", "E": "", "D": "中国化现代化", "C": "中国化大众化", "B": "中国化时代化", "A": "时代化大众化" },
    { "q": "主席新时代中国特色社会主义思想提出把握新发展阶段,贯彻新发展理念,加快构建新发展格局,推动高质量发展,是对(     )的新发展。", "a": "A", "F": "", "E": "", "D": "马克思主义国家学说", "C": "马克思主义建党学说", "B": "马克思主义社会矛盾学说", "A": "马克思主义经济学说" },
    { "q": "十年来,我国改革开放和社会主义现代化建设深入推进,书写了经济快速发展和社会长期稳定两大奇迹新篇章,我国发展具备了更为坚实的物质基础、更为完善的制度保证,实现中华民族伟大复兴进入了(    )。", "a": "D", "F": "", "E": "", "D": "不可逆转的历史进程", "C": "无法阻挡的历史进程", "B": "指日可待的历史进程", "A": "唾手可得的历史进程" },
    { "q": "我们从事的是前无古人的伟大事业,(     )才能不迷失方向、不犯颠覆性错误,创新才能把握时代、引领时代。", "a": "B", "F": "", "E": "", "D": "奋斗", "C": "斗争", "B": "守正", "A": "劳动" },
    { "q": "中国共产党第(     )次全国代表大会,是在全党全国各族人民迈上全面建设社会主义现代化国家新征程、向第二个百年奋斗目标进军的关键时刻召开的一次十分重要的大会。", "a": "B", "F": "", "E": "", "D": "十七", "C": "十八", "B": "二十", "A": "十九" },
    { "q": "\"十个明确\"中明确(    )的战略方针,提出新时代党的建设总要求,全面推进党的政治建设、思想建设、组织建设、作风建设、纪律建设。", "a": "D", "F": "", "E": "", "D": "全面从严治党", "C": "全面依法治党", "B": "伟大自我革命", "A": "全面依法治国" },
    { "q": "(    )是改革开放以来我们党全部理论和实践的鲜明主题。", "a": "A", "F": "", "E": "", "D": "实现中华民族伟大复兴的中国梦", "C": "加强党的长期执政能力建设", "B": "建设社会主义现代化强国", "A": "坚持和发展中国特色社会主义" },
    { "q": "\"十个明确\"中明确坚持和发展中国特色社会主义,总任务是(    ),在全面建成小康社会的基础上,分两步走在本世纪中叶建成富强民主文明和谐美丽的社会主义现代化强国,以中国式现代化推进中华民族伟大复兴。", "a": "D", "F": "", "E": "", "D": "实现社会主义现代化和中华民族伟大复兴", "C": "全面实施乡村振兴战略", "B": "全面从严治党", "A": "全面建成小康社会" },
    { "q": "主席新时代中国特色社会主义思想是当代中国马克思主义、二十一世纪马克思主义,是中华文化和(    )的时代精华,实现了马克思主义中国化新的飞跃。", "a": "D", "F": "", "E": "", "D": "中国精神", "C": "中国能量", "B": "中国力量", "A": "中国智慧" },
    { "q": "(    )涵盖坚持党的领导和\"五位一体\"总体布局、\"四个全面\"战略布局,涵盖国防和军队建设、国家安全、\"一国两制\"和祖国统一、外交方略,是对党治国理政重大方针原则的概括。", "a": "B", "F": "", "E": "", "D": "\"五个必由之路\"", "C": "\"十个明确\"", "B": "\"十四个坚持\"", "A": "\"九个必须\"" },
    { "q": "主席新时代中国特色社会主义思想强调要提高科学思维能力,要坚持系统观念,要强化问题导向等,是对(     )的新发展。", "a": "A", "F": "", "E": "", "D": "马克思主义世界历史理论", "C": "马克思主义自然观", "B": "马克思主义社会矛盾学说", "A": "马克思主义认识论" },
    { "q": "中国共产党第(    )次全国代表大会,把主席新时代中国特色社会主义思想确立为党必须长期坚持的指导思想并庄严地写入党章,实现了党的指导思想的与时倶进。", "a": "C", "F": "", "E": "", "D": "十五", "C": "十九", "B": "十七", "A": "十六" },
    { "q": "我们不断厚植现代化的物质基础,不断夯实人民幸福生活的物质条件,同时大力发展社会主义先进文化,加强理想信念教育,(    ),促进物的全面丰富和人的全面发展。", "a": "A", "F": "", "E": "", "D": "吸纳外国文化", "C": "尊崇古代思想", "B": "融合世界理念", "A": "传承中华文明" },
    { "q": "中国梦归根到底是(    )的梦。", "a": "D", "F": "", "E": "", "D": "人民", "C": "国家", "B": "世界", "A": "民族" },
    { "q": "我们党要团结带领人民有效应对重大挑战、抵御重大风险、克服重大阻力、解决重大矛盾,必须(    )。", "a": "A", "F": "", "E": "", "D": "推进中国特色社会主义伟大事业", "C": "推进党的建设新的伟大工程", "B": "实现中华民族伟大复兴的梦想", "A": "进行具有许多新的历史特点的伟大斗争" },
    { "q": "以下不属于中国式现代化重要特征的是(    )。", "a": "D", "F": "", "E": "", "D": "走霸权主义发展道路", "C": "人口规模巨大", "B": "物质文明和精神文明相协调", "A": "全体人民共同富裕" },
    { "q": "新民主主义革命时期,党面临的主要任务是,反对帝国主义、封建主义、官僚资本主义,争取民族独立、人民解放,为实现中华民族伟大复兴创造(    )。", "a": "B", "F": "", "E": "", "D": "坚实制度基础", "C": "和平国际环境", "B": "根本社会条件", "A": "更好舆论氛围" },
    { "q": "党的十一届三中全会以后,以邓小平同志为主要代表的中国共产党人,深刻总结新中国成立以来正反两方面经验,围绕(    )这一根本问题,借鉴世界社会主义历史经验,创立了邓小平理论。", "a": "A", "F": "", "E": "", "D": "社会主义经济建设", "C": "社会主义发展", "B": "社会主义本质", "A": "什么是社会主义、怎样建设社会主义" },
    { "q": "无产阶级革命是无产阶级进行斗争的最高形式,以(    )为目的。", "a": "D", "F": "", "E": "", "D": "建立无产阶级专政的国家", "C": "实现共产主义", "B": "消灭私有制", "A": "推翻资本主义社会" },
    { "q": "我国发展必然是一个\"(    )\"的过程,工业化、信息化、城镇化、农业现代化是叠加发展的。", "a": "B", "F": "", "E": "", "D": "接续式", "C": "串联式", "B": "并联式", "A": "断点式" },
    { "q": "坚持发扬斗争精神。增强全党全国各族人民的志气、骨气、底气,统筹(    ),全力战胜前进道路上各种困难和挑战,依靠顽强斗争打开事业发展新天地。", "a": "D", "F": "", "E": "", "D": "发展和安全", "C": "政治和经济", "B": "历史和现实", "A": "国内和国际" },
    { "q": "党的二十大报告指出,未来五年是全面建设社会主义现代化国家开局起步的关键时期。前进道路上,必须牢牢把握五个重大原则。以下表述中不属于五个重大原则的是(    )。", "a": "A", "F": "", "E": "", "D": "坚持以人民为中心的发展思想", "C": "坚持发扬斗争精神", "B": "坚持深化改革开放", "A": "坚持全面依法治国" },
    { "q": "(    )同志首先用\"小康\"来诠释中国式现代化。", "a": "C", "F": "", "E": "", "D": "周恩来", "C": "邓小平", "B": "毛泽东", "A": "陈云" },
    { "q": "主席总书记在谈到中国梦时曾用三句诗形容中华民族的昨天、今天、明天。中华民族的昨天是\"雄关漫道真如铁\",今天是\"人间正道是沧桑\",明天是\"长风破浪会有时\"。中华民族伟大复兴的梦想终将在历经风浪之后得以实现。下列有关中国梦的说法错误的是(    )。", "a": "D", "F": "", "E": "", "D": "实现中国梦就是要在国家富强的基础上获取世界霸主地位", "C": "实现中国梦要在经济增长方面更多地依靠科技创新驱动", "B": "实现中国梦不仅造福中国人民而且造福世界人民", "A": "实现中国梦就是要使社会更加和谐、政治更加民主" },
    { "q": "中国共产党团结带领中国人民进行的一切奋斗、一切牺牲、一切创造,归结起来就是一个主题:(    )。", "a": "A", "F": "", "E": "", "D": "实现共同富裕", "C": "全面建成小康社会", "B": "争取民族独立解放", "A": "实现中华民族伟大复兴" },
    { "q": "中国梦的本质是(    )。", "a": "D", "F": "", "E": "", "D": "国家富强、民族振兴、人民幸福", "C": "政治昌明、经济发展、社会和谐", "B": "人民幸福、民族复兴、世界大同", "A": "民主健全、科教进步、生态良好?" },
    { "q": "改革开放后,面对唱衰中国的舆论在国际上不绝于耳,各式各样针对中国的\"崩溃论\"\"失败论\"从来没有中断过,中国非但没有崩溃,反而综合国力与日俱增,创造了世所罕见的两大奇迹:一是经济快速发展奇迹;二是(    )奇迹。", "a": "C", "F": "", "E": "", "D": "人民幸福指数", "C": "社会长期稳定", "B": "物质财富丰富", "A": "平均寿命提高" },
    { "q": "(    )是社会主义的本质要求,是中国式现代化的重要特征之一。", "a": "D", "F": "", "E": "", "D": "全体人民共同富裕", "C": "稳定与发展", "B": "以人为本", "A": "城乡一体化" },
    { "q": "关于全面建成小康社会的说法中不正确的是(    )。", "a": "A", "F": "", "E": "", "D": "全面小康,是惠及全体人民的小康", "C": "全面小康,是城乡区域共同发展的小康", "B": "全面小康,是\"五位一体\"全面进步的小康", "A": "全面小康,是全体人民收入均等的小康" },
    { "q": "实现中国梦必须走中国道路。中国道路是指(    )。", "a": "D", "F": "", "E": "", "D": "中国特色社会主义道路", "C": "同步富裕的道路", "B": "改革开放道路", "A": "独立自主、自力更生的道路" },
    { "q": "以下不属于\"五个必由之路\"的是(    )。", "a": "B", "F": "", "E": "", "D": "坚持党的全面领导是坚持和发展中国特色社会主义的必由之路", "C": "中国特色社会主义是实现中华民族伟大复兴的必由之路", "B": "贯彻科学发展观是新时代我国发展壮大的必由之路", "A": "团结奋斗是中国人民创造历史伟业的必由之路" },
    { "q": "实现中国梦必须凝聚中国力量,这就是(    )的力量。", "a": "A", "F": "", "E": "", "D": "党政军民学", "C": "世界人民大团结", "B": "社会各阶层大团结", "A": "中国各族人民大团结" },
    { "q": "以下说法不正确的是(    )。", "a": "B", "F": "", "E": "", "D": "在新中国成立特别是改革开放以来长期探索和实践基础上,经过党的十八大以来在理论和实践上的创新突破,我们党成功推进和拓展了中国式现代化", "C": "在基本实现现代化的基础上,我们要继续奋斗,到本世纪中叶,把我国建设成为综合国力和国际影响力领先的社会主义现代化强国", "B": "我国发展已经进入风险挑战大于战略机遇、不确定难预料因素增多的时期", "A": "全面建设社会主义现代化国家,是一项伟大而艰巨的事业,前途光明,任重道远" },
    { "q": "中国特色社会主义,既坚持了(    )基本原则,又根据时代条件赋予其鲜明的中国特色。", "a": "B", "F": "", "E": "", "D": "唯物辩证主义", "C": "辩证唯物主义", "B": "科学社会主义", "A": "历史唯物主义" },
    { "q": "我国提前10年实现《联合国2030年可持续发展议程》减贫目标,对全球减贫贡献率超过(    )。", "a": "D", "F": "", "E": "", "D": "70%", "C": "50%", "B": "60%", "A": "40%" },
    { "q": "实现中国梦,必须弘扬中国精神,包括(  )。①以爱国主义为核心的民族精神②以改革创新为核心的时代精神③以集体主义为核心的民族精神④以团结统一为核心的时代精神", "a": "A", "F": "", "E": "", "D": "①④", "C": "③④", "B": "②③", "A": "①②" },
    { "q": "我们坚持把(    )作为现代化建设的出发点和落脚点,着力维护和促进社会公平正义,着力促进全体人民共同富裕,坚决防止两极分化。", "a": "A", "F": "", "E": "", "D": "提升人民生活水平", "C": "建设人类精神家园", "B": "社会稳定安宁", "A": "实现人民对美好生活的向往" },
    { "q": "以下不属于中国式现代化本质要求的是(    )。", "a": "B", "F": "", "E": "", "D": "坚持中国共产党领导", "C": "实现高质量发展", "B": "全面建成小康社会", "A": "促进人与自然和谐共生" },
    { "q": "中国特色社会主义,既坚持了科学社会主义基本原则,又根据(    )赋予其鲜明的中国特色。", "a": "D", "F": "", "E": "", "D": "时代条件", "C": "社会现实", "B": "发展阶段", "A": "经济社会发展水平" },
    { "q": "(    )是关系党的事业兴衰成败第一位的问题。", "a": "C", "F": "", "E": "", "D": "外交问题", "C": "道路问题", "B": "军事问题", "A": "宗旨问题" },
    { "q": "(    )是关系党的事业兴衰成败第一位的问题。", "a": "D", "F": "", "E": "", "D": "外交问题", "C": "道路问题", "B": "军事问题", "A": "宗旨问题" },
    { "q": "改革开放和社会主义现代化建设新时期,党面临的主要任务是,继续探索中国建设社会主义的正确道路,解放和发展社会生产力,使人民摆脱贫困、尽快富裕起来,为实现中华民族伟大复兴提供充满新的活力的体制保证和(    )。", "a": "C", "F": "", "E": "", "D": "根本制度基础", "C": "快速发展的物质条件", "B": "根本政治前提", "A": "和平国际环境" },
    { "q": "\"广大青年用行动证明,新时代的中国青年是好样的,是堪当大任的!\"这句话来源于(    )。", "a": "D", "F": "", "E": "", "D": "主席给北京大学援鄂医疗队全体\"90后\"党员的回信", "C": "主席给中国戏曲学院师生的回信", "B": "主席给在首钢医院实习的西藏大学医学院学生的回信", "A": "主席给中国石油大学(北京)克拉玛依校区毕业生的回信" },
    { "q": "青少年时期的周恩来,面对国家危难和人民困苦,决心\"为了中华之崛起\"而读书,誓言\"险夷不变应尝胆,道义争担敢息肩\",立下(    )的远大志向。", "a": "D", "F": "", "E": "", "D": "\"面壁十年图破壁\"", "C": "\"直挂云帆济沧海\"", "B": "\"千生气志是良图\"", "A": "\"吹尽黄沙始到金\"" },
    { "q": "在(    ),中国青年积极参加党领导的革命武装,在打倒军阀、抗日救亡、推翻国民党反动统治的伟大斗争中冲锋陷阵,不怕牺牲、浴血斗争,为争取民族独立、人民解放抛洒热血,经受住了生与死的考验。", "a": "C", "F": "", "E": "", "D": "改革开放和社会主义现代化建设新时期", "C": "新民主主义革命时期", "B": "中国特色社会主义新时代", "A": "社会主义革命和建设时期" },
    { "q": "党的二十大报告强调,要用党的科学理论武装青年,用党的(    )感召青年。", "a": "B", "F": "", "E": "", "D": "不懈奋斗", "C": "坚守理想", "B": "初心使命", "A": "精神力量" },
    { "q": "无论过去、现在还是未来,中国青年始终是实现中华民族伟大复兴的(    )力量!", "a": "C", "F": "", "E": "", "D": "基础", "C": "先锋", "B": "后备", "A": "中坚" },
    { "q": "2017年,出台新中国历史上(    )青年发展规划。", "a": "A", "F": "", "E": "", "D": "第四个", "C": "第二个", "B": "第三个", "A": "第一个" },
    { "q": "在庆祝中国共产党成立100周年大会上,共青团员、少先队员代表响亮喊出(    )的青春誓言。这是新时代中国青少年应该有的样子。", "a": "A", "F": "", "E": "", "D": "\"党有号召、团有行动\"", "C": "\"为中华民族伟大复兴而奋斗\"", "B": "\"团结起来、振兴中华\"", "A": "\"请党放心、强国有我\"" },
    { "q": "《新时代的中国青年》白皮书指出,(    )年,青年常住人口城镇化率达71.1%,比十年前增加15.3%。", "a": "A", "F": "", "E": "", "D": "2019", "C": "2021", "B": "2018", "A": "2020" },
    { "q": "在(    ),中国青年积极参与中华民族有史以来最为广泛而深刻的社会变革,组建青年突击队、青年垦荒队、青年扫盲队,开展学雷锋活动,向科学进军,向困难进军,向荒原进军,勇于拼搏、甘于奉献,在新中国的广阔天地忘我劳动、发愤图强。", "a": "B", "F": "", "E": "", "D": "改革开放和社会主义现代化建设新时期", "C": "中国特色社会主义新时代", "B": "社会主义革命和建设时期", "A": "新民主主义革命时期" },
    { "q": "时代新人之\"新\",特别体现在求进取。求进取,就是始终保持昂扬向上的状态姿态,富有(   )的朝气锐气,勤于学习、勇于开拓,以新的实践创造成就民族复兴的伟大梦想。", "a": "B", "F": "", "E": "", "D": "守正创新", "C": "勇于奉献", "B": "求新求变", "A": "爱国爱党" },
    { "q": "(    )是深刻理解和全面把握主席新时代中国特色社会主义思想的金钥匙。", "a": "ABCD", "F": "", "E": "", "D": "为中华民族谋复兴", "C": "为人类谋进步", "B": "为世界谋大同", "A": "为中国人民谋幸福" },
    { "q": "中国特色社会主义进入新时代,意味着(    )。", "a": "ABD", "F": "", "E": "", "D": "中华民族迎来了从站起来、富起来到强起来的伟大飞跃", "C": "全面建成小康社会已成为现实", "B": "科学社会主义在二十一世纪的中国焕发出强大生机活力", "A": "拓展了发展中国家走向现代化的途径,为解决人类问题贡献了中国智慧和中国方案" },
    { "q": "关于如何学好用好主席新时代中国特色社会主义思想,以下说法正确的是(    )。", "a": "ABCD", "F": "", "E": "", "D": "用党的创新理论认识世界、改造世界", "C": "把握贯穿其中的立场观点方法", "B": "坚持读原著学原文悟原理", "A": "带着问题学、联系实际学" },
    { "q": "从主席总书记引用的(    )典故中,可以感悟\"以百姓之心为心\"的宗旨意识、\"执古之道以御今之有\"的政治智慧、\"天下大事必作于细\"的务实精神。", "a": "ABCD", "F": "", "E": "", "D": "\"慎易以避难,敬细以远大\"", "C": "\"安而不忘危,存而不忘亡,治而不忘乱\"", "B": "\"为官避事平生耻\"", "A": "\"但愿苍生俱保暖,不辞辛苦出山林\"" },
    { "q": "主席新时代中国特色社会主义思想汲取中华优秀传统文化所蕴含的丰富(    ),有效激活了中华优秀传统文化的生命力,成为中华优秀传统文化创造性转化、创新性发展的生动典范。", "a": "ABCD", "F": "", "E": "", "D": "政治智慧", "C": "哲学思想", "B": "道德理念", "A": "人文精神" },
    { "q": "主席新时代中国特色社会主义思想展现了当代中国共产党人的(    )。", "a": "ACD", "F": "", "E": "", "D": "政治品格", "C": "价值追求", "B": "理想信念", "A": "精神风范" },
    { "q": "不断谱写马克思主义中国化时代化新篇章,是当代中国共产党人的庄严历史责任。继续推进实践基础上的理论创新,首先要把握好新时代中国特色社会主义思想的世界观和方法论,坚持好、运用好贯穿其中的立场观点方法。以下说法正确的是(     )。", "a": "ACD", "F": "", "E": "", "D": "必须坚持人民至上,必须坚持自信自立", "C": "必须坚持系统观念,必须坚持胸怀天下", "B": "必须坚持吸收外来,必须坚持勇于创新", "A": "必须坚持守正创新,必须坚持问题导向" },
    { "q": "我们党勇于进行理论探索和创新,以全新的视野深化对(     )的认识,取得重大理论创新成果,集中体现为新时代中国特色社会主义思想。", "a": "BCD", "F": "", "E": "", "D": "人类社会发展规律", "C": "社会主义建设规律", "B": "共产党执政规律", "A": "自然规律" },
    { "q": "主席新时代中国特色社会主义思想充盈着浓郁的中国味、深厚的中华情、浩然的民族魂,具有强大的(    )。", "a": "ABC", "F": "", "E": "", "D": "活动影响力", "C": "文化感染力", "B": "精神感召力", "A": "历史穿透力" },
    { "q": "关于新时代坚持和发展中国特色社会主义,以下说法正确的是(    )。", "a": "ABCD", "F": "", "E": "", "D": "在新的历史条件下坚持和发展中国特色社会主义,必须坚持走自己的路,必须顺应世界大势", "C": "中国特色社会主义是全面发展的社会主义,我们要在经济不断发展的基础上,协调推进政治建设、文化建设、社会建设、生态文明建设以及其他各方面建设", "B": "中国特色社会主义是社会主义而不是其他什么主义,科学社会主义基本原则不能丢,丢了就不是社会主义", "A": "在新的历史条件下坚持和发展中国特色社会主义,必须代表最广大人民根本利益,必须加强党的自身建设,必须坚定中国特色社会主义自信" },
    { "q": "中华优秀传统文化源远流长、博大精深,是中华文明的智慧结晶,其中蕴含的(     )、讲信修睦、亲仁善邻等,是中国人民在长期生产生活中积累的宇宙观、天下观、社会观、道德观的重要体现,同科学社会主义价值观主张具有高度契合性。", "a": "ABCD", "F": "", "E": "", "D": "自强不息、厚德载物", "C": "为政以德、革故鼎新", "B": "天下为公、民为邦本", "A": "任人唯贤、天人合一" },
    { "q": "新时代十年的伟大变革,在(     )、中华民族发展史上具有里程碑意义。", "a": "ABCD", "F": "", "E": "", "D": "改革开放史", "C": "新中国史", "B": "党史", "A": "社会主义发展史" },
    { "q": "党的十九大以来的五年,是极不寻常、极不平凡的五年。以下说法正确的是(     )。", "a": "ABCD", "F": "", "E": "", "D": "五年来,我们坚决维护国家安全,防范化解重大风险,保持社会大局稳定", "C": "五年来,我们扎实推进全过程人民民主", "B": "五年来,我们着力推动高质量发展,主动构建新发展格局", "A": "五年来,我们突出保障和改善民生,集中力量实施脱贫攻坚战" },
    { "q": "主席新时代中国特色社会主义思想大力弘扬以爱国主义为核心的民族精神和以改革创新为核心的时代精神,深刻阐发了以伟大建党精神为源头的中国共产党人的精神谱系,以及中国人民的(     ),铸就了脱贫攻坚精神、伟大抗疫精神、新时代北斗精神、北京冬奥精神等,丰富了当代中国人的精神世界,为实现中华民族伟大复兴提供了精神力量。", "a": "ABCD", "F": "", "E": "", "D": "伟大奋斗精神", "C": "伟大团结精神", "B": "伟大创造精神", "A": "伟大梦想精神" },
    { "q": "推进马克思主义中国化时代化是一个(     )的过程。", "a": "BCD", "F": "", "E": "", "D": "笃行真理", "C": "揭示真理", "B": "追求真理", "A": "牢记真理" },
    { "q": "以主席同志为核心的党中央高举中国特色社会主义伟大旗帜,坚持以主席新时代中国特色社会主义思想为指导,坚定中国特色社会主义(    ),坚定不移推进中华民族伟大复兴历史进程。", "a": "ABCD", "F": "", "E": "", "D": "文化自信", "C": "道路自信", "B": "制度自信", "A": "理论自信" },
    { "q": "我们要(     ),形成为人民所喜爱、所认同、所拥有的理论,使之成为指导人民认识世界和改造世界的强大思想武器。", "a": "ABCD", "F": "", "E": "", "D": "尊重人民创造", "C": "站稳人民立场", "B": "把握人民愿望", "A": "集中人民智慧" },
    { "q": "关于\"两个确立\",以下说法正确的是(    )。", "a": "BCD", "F": "", "E": "", "D": "对新时代党和国家事业发展、对推进中华民族伟大复兴历史进程具有决定性意义", "C": "反映了全党全军全国各族人民共同心愿", "B": "党确立主席同志党中央的核心、全党的核心地位,确立主席新时代中国特色社会主义思想的指导地位", "A": "是在党的十九届四中全会上提出的" },
    { "q": "主席新时代中国特色社会主义思想坚持以社会主义现代化建设进程中的实际问题、以我们正在做的事情为中心,着眼统揽(   ),大智慧谋划大格局,大手笔续写大文章,是实践探索、经验总结、理论升华凝结而成的思想结晶。", "a": "ABCD", "F": "", "E": "", "D": "伟大工程", "C": "伟大梦想", "B": "伟大斗争", "A": "伟大事业" },
    { "q": "中国特色大国外交要(    ),推动建设新型国际关系,推动构建人类命运共同体。", "a": "CD", "F": "", "E": "", "D": "服务民族复兴", "C": "促进人类进步", "B": "服务改革开放", "A": "促进世界大同" },
    { "q": "坚持和发展马克思主义,必须同中国具体实际相结合。我们必须坚持(     ),一切从实际出发,着眼解决新时代改革开放和社会主义现代化建设的实际问题,不断回答中国之问、世界之问、人民之问、时代之问,作出符合中国实际和时代要求的正确回答,得出符合客观规律的科学认识,形成与时俱进的理论成果,更好指导中国实践。", "a": "ABCD", "F": "", "E": "", "D": "实事求是", "C": "求真务实", "B": "解放思想", "A": "与时俱进" },
    { "q": "我们必须(     ),把马克思主义思想精髓同中华优秀传统文化精华贯通起来、同人民群众日用而不觉的共同价值观念融通起来,不断赋予科学理论鲜明的中国特色,不断夯实马克思主义中国化时代化的历史基础和群众基础,让马克思主义在中国牢牢扎根。", "a": "AB", "F": "", "E": "", "D": "坚定制度自信、道路自信", "C": "坚持借鉴经验、勇于创新", "B": "坚定历史自信、文化自信", "A": "坚持古为今用、推陈出新" },
    { "q": "当今世界正经历百年未有之大变局。(    )前所未有,必须坚持统筹发展和安全,推动实现更高质量、更有效率、更加公平、更可持续、更为安全的发展。", "a": "ABCD", "F": "", "E": "", "D": "改革发展稳定任务之重", "C": "矛盾风险挑战之多", "B": "对党治国理政考验之大", "A": "形势环境变化之快" },
    { "q": "社会主义革命和建设时期,党面临的主要任务是,(    ),为实现中华民族伟大复兴奠定根本政治前提和制度基础。", "a": "ABC", "F": "", "E": "", "D": "推倒\"三座大山\"", "C": "推进社会主义建设", "B": "实现从新民主主义到社会主义的转变", "A": "进行社会主义革命" },
    { "q": "社会主义并没有定于一尊、一成不变的套路,只有把科学社会主义基本原则同(    )紧密结合起来,在实践中不断探索总结,才能把蓝图变为美好现实。", "a": "BCD", "F": "", "E": "", "D": "本国具体实际", "C": "历史文化传统", "B": "时代要求", "A": "外国成功经验" },
    { "q": "以下关于中国式现代化的特征表述正确的是(    )。", "a": "AC", "F": "", "E": "", "D": "精神文明发展超越物质文明", "C": "人口模规模巨大", "B": "全体人民同步富裕", "A": "走和平发展道路" },
    { "q": "关于到二〇三五年我国发展的总体目标表述正确的是(    )。", "a": "ABCD", "F": "", "E": "", "D": "经济实力、科技实力、综合国力大幅跃升,人均国内生产总值迈上新的大台阶,达到中等发达国家水平", "C": "国家安全体系和能力全面加强,基本实现国防和军队现代化", "B": "实现高水平科技自立自强,进入创新型国家前列", "A": "建成教育强国、科技强国、人才强国、文化强国、体育强国、健康中国,国家文化软实力显著增强" },
    { "q": "按照\"十四五\"规划,到2035年我国基本实现国家治理体系和治理能力现代化,人民平等参与、平等发展权利得到充分保障,基本建成(    )。", "a": "BCD", "F": "", "E": "", "D": "法治国家", "C": "法治政府", "B": "法治社会", "A": "法制国家" },
    { "q": "坚定中国特色社会主义\"四个自信\",来源于(    )。", "a": "ABD", "F": "", "E": "", "D": "实践", "C": "哲学", "B": "真理", "A": "人民" },
    { "q": "通过无产阶级专政和社会主义高度发展最终实现向(    )的共产主义社会的过渡。", "a": "ACD", "F": "", "E": "", "D": "实现人的全面而自由发展", "C": "消灭剥削", "B": "消灭资本", "A": "消灭阶级" },
    { "q": "当代中国的伟大社会变革,不是(    )。", "a": "ABCD", "F": "", "E": "", "D": "简单延续我国历史文化的母版", "C": "其他国家社会主义实践的再版", "B": "简单套用马克思主义经典作家设想的模板", "A": "国外现代化发展的翻版" },
    { "q": "中国共产党一经诞生,就把(    )确立为自己的初心使命。", "a": "AB", "F": "", "E": "", "D": "为世界人民谋和平", "C": "为党政干部谋发展", "B": "为中华民族谋复兴", "A": "为中国人民谋幸福" },
    { "q": "中国特色社会主义道路(    ),不仅走得对、走得通,而且也一定能够走得稳、走得好。", "a": "ACD", "F": "", "E": "", "D": "符合中国实际", "C": "适应时代发展要求", "B": "满足世界各国期盼", "A": "反映中国人民意愿" },
    { "q": "党的二十大报告指出,未来五年是全面建设社会主义现代化国家开局起步的关键时期,以下对主要目标任务表述正确的是(    )。", "a": "ABCD", "F": "", "E": "", "D": "改革开放迈出新步伐,国家治理体系和治理能力现代化深入推进,社会主义市场经济体制更加完善,更高水平开放型经济新体制基本形成", "C": "国家安全更为巩固,建军一百年奋斗目标如期实现,平安中国建设扎实推进", "B": "人民精神文化生活更加丰富,中华民族凝聚力和中华文化影响力不断增强", "A": "经济高质量发展取得新突破,科技自立自强能力显著提升,构建新发展格局和建设现代化经济体系取得重大进展" },
    { "q": "中国式现代化是人与自然和谐共生的现代化。我们坚持可持续发展,坚持(    )为主的方针。", "a": "ACD", "F": "", "E": "", "D": "自然恢复", "C": "保护优先", "B": "人工干预", "A": "节约优先" },
    { "q": "2022年3月6日,主席总书记在参加全国政协十三届五次会议农业界、社会福利和社会保障界委员联组会时,将我国发展具有诸多过去难以想象的战略性有利条件作以概括。以下选项正确的是(    )。", "a": "ABCD", "F": "", "E": "", "D": "有中国特色社会主义制度的显著优势", "C": "有自信自强的精神力量", "B": "有长期稳定的社会环境", "A": "有中国共产党的坚强领导" },
    { "q": "中华民族伟大复兴不是轻轻松松、敲锣打鼓就能实现的,必须充分认识实现中华民族伟大复兴的(    )。", "a": "ACD", "F": "", "E": "", "D": "艰巨性", "C": "复杂性", "B": "连续性", "A": "长期性" },
    { "q": "在革命斗争中,以毛泽东同志为主要代表的中国共产党人,把马克思列宁主义基本原理同中国具体实际相结合,对经过艰苦探索、付出巨大牺牲积累的一系列独创性经验作了理论概括。以下说法正确的是(    )。", "a": "ABCD", "F": "", "E": "", "D": "建立了人民当家作主的新中国", "C": "经过社会主义改造开启了社会主义革命的新篇章", "B": "确立了社会主义基本制度", "A": "开辟了农村包围城市、武装夺取政权的正确革命道路" },
    { "q": "按照\"十四五\"规划,到2035年我国将基本实现(    ),建成现代化经济体系。", "a": "ABCD", "F": "", "E": "", "D": "城镇化", "C": "信息化", "B": "农业现代化", "A": "新型工业化" },
    { "q": "党的十八大以来,以主席同志为核心的党中央顺应我国经济社会新发展和广大人民群众新期盼,提出了全面建成小康社会新的目标要求,赋予了\"小康\"更高的标准、更丰富的内涵。具体包括(    )。", "a": "ABCD", "F": "", "E": "", "D": "经济高质量发展", "C": "生态环境质量总体改善", "B": "各方面制度更加成熟更加定型", "A": "国民素质和社会文明程度显著提高" },
    { "q": "(  )我们坚持以马克思主义为指导,是要运用其科学的世界观和方法论解决中国的问题,而不是要背诵和重复其具体结论和词句,更不能把马克思主义当成一成不变的教条。(    )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )坚持党的全面领导是坚持和发展中国特色社会主义的必由之路。(    )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )世界面临百年未有之大变局给中华民族伟大复兴带来重大机遇。(    )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )马克思列宁主义是我们立党立国、兴党兴国的根本指导思想。(    )", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )主席新时代中国特色社会主义思想系统全面、逻辑严密、博大精深。(    )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )主席新时代中国特色社会主义思想既讲是什么、为什么,又讲怎么看、怎么办,既部署\"过河\"的任务,又指导解决\"桥或船\"的问题,生动体现了马克思主义世界观和方法论的统一。(    )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )新时代是全国各族人民团结奋斗、不断创造美好生活、迅速实现全体人民共同富裕的时代。(    )", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )我们党的历史,就是一部不断推进马克思主义中国化的历史,就是一部不断推进理论创新、进行理论创造的历史。(    )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )三个重大时代课题,是站在新时代历史节点上向中国共产党人提出的\"时代三问\",是理解主席新时代中国特色社会主义思想的\"理论之眼\"。(    )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )中国发展理念、发展道路、发展模式的影响力、吸引力显著增强,中国日益发挥着世界和平建设者、全球发展贡献者、国际秩序维护者的重要作用。(    )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )如果把主席新时代中国特色社会主义思想比作一座理论大厦,\"十四个坚持\"就是支撑整座大厦的主体部分。(     )", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )在中国特色社会主义理论的指导下,中国共产党团结带领中国人民,创造了新时代中国特色社会主义的伟大成就,为实现中华民族伟大复兴提供了更为完善的制度保证、更为坚实的物质基础、更为主动的精神力量。(    )", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )我们党作为百年大党,如何永葆先进性和纯洁性、永葆青春活力,如何永远得到人民拥护和支持,如何实现长期执政,是我们必须回答好、解决好的一个根本性问题。(    )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )学好主席新时代中国特色社会主义思想,要把理论和实践有机结合起来,发扬理论联系实际的马克思主义学风,既向书本学,又向实践学。(    )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )中国人民是伟大的人民,具有伟大的梦想精神,人民是中国梦的主体,是中国梦的创造者和享有者。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )在人类文明发展史上,除了中国特色社会主义制度和国家治理体系外,没有任何一种国家制度和国家治理体系能够在这样短的历史时期内创造出我国取得的经济快速发展、社会长期稳定这样的奇迹。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )欧美国家率先走向现代化,其他国家只能在后面模仿跟随。", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )从本质特征看,中国式现代化是中国共产党领导的社会主义现代化。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )从国际影响看,以霸权统治与和平方式二者并举实现国家发展和民族复兴,是中国式现代化的显著特征。", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )中国特色社会主义是社会主义,不是别的什么主义。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )走自己的路,是党的全部理论和实践的立足点,更是党百年奋斗得出的历史结论。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )经过实践,我们党很快就觉察到苏联经验的局限,提出要\"以苏为鉴\",充分借鉴资本主义国家经验模式探索适合中国国情的社会主义建设道路。", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )全面建成小康社会、实现第一个百年奋斗目标之后,我们要乘势而上开启全面建设社会主义现代化国家新征程、向第二个百年奋斗目标进军,这标志着我国进入了一个新发展阶段。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )党的二十大报告指出,中国式现代化,是中国共产党领导的社会主义现代化,既有各国现代化的共同特征,更有基于自己国情的中国特色。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )社会主义社会和资本主义社会本质上没有决定意义的差别。", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )党的第一个百年奋斗目标是到2020年实现国内生产总值和城乡居民人均收入比2010年翻两番,全面建成小康社会。", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )中国特色社会主义是实现中华民族伟大复兴的必由之路。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )全面建成小康社会的\"小康\",主要指经济层面。", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )我们党要团结带领人民有效应对重大挑战、抵御重大风险、克服重大阻力、解决重大矛盾,必须进行具有许多新的历史特点的伟大事业。", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )中国特色社会主义新时代,党面临的主要任务是,实现第一个百年奋斗目标,开启实现第二个百年奋斗目标新征程,朝着实现中华民族伟大复兴的宏伟目标继续前进。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "2019年10月31日,党的十九届四中全会审议通过的《中共中央关于坚持和完善中国特色社会主义制度、推进国家治理体系和治理能力现代化若干重大问题的决定》中强调,(    )制度体系,提高党科学执政、民主执政、依法执政水平。", "a": "C", "F": "", "E": "", "D": "坚持和完善人民民主", "C": "坚持和完善党的领导", "B": "坚持和完善社会主义", "A": "坚持和完善政治体制" },
    { "q": "坚持党的领导是(    )问题,必须旗帜鲜明、立场坚定,决不能羞羞答答、语焉不详,决不能遮遮掩掩、搞自我麻痹。", "a": "B", "F": "", "E": "", "D": "基本", "C": "核心", "B": "方向性", "A": "底线" },
    { "q": "坚持(    )是无产阶级革命和社会主义建设取得胜利的根本保证。", "a": "C", "F": "", "E": "", "D": "马克思主义", "C": "无产阶级政党的领导", "B": "走社会主义道路", "A": "中国特色社会主义" },
    { "q": "(    )审议通过《关于新形势下党内政治生活的若干准则》和《中国共产党党内监督条例》。", "a": "A", "F": "", "E": "", "D": "党的十八大", "C": "党的十八届四中全会", "B": "党的十八届一中全会", "A": "党的十八届六中全会" },
    { "q": "马克思曾指出:\"一个单独的提琴手是自己指挥自己,一个乐队就需要一个乐队指挥。\"毛泽东同志指出:\"要建立领导核心,反对'一国三公'。\"邓小平同志强调:\"任何一个领导集体都要有一个核心,没有核心的领导是靠不住的。\"这指出了马克思主义建党学说的一个基本观点,即(    )。", "a": "C", "F": "", "E": "", "D": "确立和维护人民民主专政", "C": "确立和维护无产阶级政党的领导核心", "B": "确立和维护一党专政", "A": "确立和维护中国共产党的领导" },
    { "q": "中国共产党的(    )是中国特色社会主义制度优势的主要来源。", "a": "C", "F": "", "E": "", "D": "领导优势", "C": "自身优势", "B": "组织优势", "A": "初心使命" },
    { "q": "推动全党深入学习贯彻习近平新时代中国特色社会主义思想,增强\"四个意识\"、坚定\"四个自信\"、做到\"两个维护\",完善(    )的组织体系,确保党中央决策部署有效落实。", "a": "A", "F": "", "E": "", "D": "民主协商、执行有力", "C": "结构严密、执行有力", "B": "上下贯通、民主协商", "A": "上下贯通、执行有力" },
    { "q": "短绳不能汲深井,浅水难以负大舟。党和国家事业越发展,对领导干部的能力要求就越高。党的十九大提出了全面增强(    )的明确要求。", "a": "A", "F": "", "E": "", "D": "执政素质", "C": "领导能力", "B": "领导水平", "A": "执政本领" },
    { "q": "全党必须自觉在思想上政治上行动上同党中央保持高度一致,提高科学执政、民主执政、依法执政水平,提高把方向、谋大局、定政策、促改革的能力,确保充分发挥党(    )的领导核心作用。", "a": "C", "F": "", "E": "", "D": "兼顾全局、指挥各方", "C": "总揽全局、协调各方", "B": "总揽全局、指挥各方", "A": "兼顾全局、协调各方" },
    { "q": "党的领导作为一项制度安排是中国特色社会主义制度的重要组成部分。作为党的根本组织制度和领导制度的(    ),最能体现中国特色社会主义制度的优越性。", "a": "D", "F": "", "E": "", "D": "民主集中制", "C": "选举制度", "B": "人民代表大会制度", "A": "政治协商制度" },
    { "q": "(    )表现为坚定政治信仰,坚持正确的政治方向,坚持政治原则,站稳政治立场,保持政治清醒和政治定力,不断提高政治判断力、政治领悟力、政治执行力。", "a": "A", "F": "", "E": "", "D": "大局意识", "C": "核心意识", "B": "看齐意识", "A": "政治意识" },
    { "q": "只有坚持中国共产党的领导,才能保证中国特色社会主义的(    )。", "a": "D", "F": "", "E": "", "D": "性质和正确方向", "C": "性质和基本原则", "B": "原则和正确方向", "A": "方向和正确道路" },
    { "q": "服从核心、维护核心就是服从大局、维护大局,就是(    )。", "a": "D", "F": "", "E": "", "D": "最大的政治", "C": "最高的要求", "B": "最严的纪律", "A": "最高的宗旨" },
    { "q": "我们要带头维护中央权威,在思想上政治上行动上同党中央保持高度一致,不折不扣贯彻执行中央的路线方针政策和重大工作部署,心往一处想、劲往一处使,确保中央(    )。", "a": "B", "F": "", "E": "", "D": "法制统一", "C": "统一领导", "B": "政令畅通", "A": "政令统一" },
    { "q": "党的领导是全面的,(   )要全面,既制定路线方针政策,又协调各方、督促落实,贯穿于治国理政的立法、决策、执行、管理、监督等各项工作之中。", "a": "A", "F": "", "E": "", "D": "领导对象", "C": "领导内容", "B": "领导方法", "A": "领导过程" },
    { "q": "党是最高政治领导力量,这是由我国国家性质和(    )所决定的。", "a": "B", "F": "", "E": "", "D": "基本国情", "C": "国家制度", "B": "国体政体", "A": "奋斗目标" },
    { "q": "《中共中央关于党的百年奋斗重大成就和历史经验的决议》指出,治理好我们这个世界上最大的政党和人口最多的国家,必须坚持党的全面领导特别是(   ),坚持民主集中制,确保党始终总揽全局、协调各方。", "a": "D", "F": "", "E": "", "D": "党中央集中统一领导", "C": "党中央系统领导", "B": "党中央统筹领导", "A": "党中央整体领导" },
    { "q": "国家政治体系是一个大系统,其构成包括根本政治制度、基本政治制度和国家治理各方面具体的体制机制,涵盖国家机关、政党组织和各种政治主体。在这个大系统中,中国共产党处于(    )。", "a": "B", "F": "", "E": "", "D": "中心地位", "C": "核心地位", "B": "统领地位", "A": "主导地位" },
    { "q": "民主集中制是我们党的根本(    )。坚持民主集中制,是马克思主义政党区别于其他政党的重要标志。", "a": "A", "F": "", "E": "", "D": "组织原则和政策纲领", "C": "政策纲领和领导制度", "B": "决策依据和政策纲领", "A": "组织原则和领导制度" },
    { "q": "党的领导是党和国家事业不断发展的\"定海神针\"。我国之所以能保持长期稳定,根本的一条就是我们始终坚持(    )。", "a": "B", "F": "", "E": "", "D": "民主集中制", "C": "四个自信", "B": "共产党领导", "A": "社会主义道路" },
    { "q": "制定和实施国民经济和社会发展五年规划,引领经济社会发展,是我们党治国理政的一种重要方式,是中国特色社会主义发展模式的重要体现,是中国共产党(    )的重要表现。", "a": "D", "F": "", "E": "", "D": "谋大局", "C": "定政策", "B": "促改革", "A": "把方向" },
    { "q": "要构建(    )的党和国家机构职能体系,形成总揽全局、协调各方的党的领导体系,职责明确、依法行政的政府治理体系,中国特色、世界一流的武装力量体系,联系广泛、服务群众的群团工作体系等。", "a": "A", "F": "", "E": "", "D": "系统完善、科学规范、运行合理", "C": "系统完善、科学有效、运行合理", "B": "系统完备、科学有效、运行规范", "A": "系统完备、科学规范、运行高效" },
    { "q": "维护党中央权威和集中统一领导,同坚持(    )是完全一致的。", "a": "C", "F": "", "E": "", "D": "人民民主专政", "C": "民主集中制", "B": "社会主义道路", "A": "无产阶级专政" },
    { "q": "习近平总书记强调,坚决维护党中央权威和集中统一领导,是党的领导的(    ),任何时候任何情况下都不能含糊、不能动摇。", "a": "C", "F": "", "E": "", "D": "最高要求", "C": "最高原则", "B": "最高宗旨", "A": "最高指示" },
    { "q": "(    )是我们党的一项重要政治纪律、组织纪律、工作纪律,是执行民主集中制的有效工作机制,是推进党的政治建设的一项重要制度,它充分体现了党是政治体系的统领者。", "a": "D", "F": "", "E": "", "D": "请示报告制度", "C": "全面从严治党制度", "B": "不忘初心、牢记使命的制度", "A": "党支部联系群众制度" },
    { "q": "党的二十大报告指出,中国共产党是最高(    ),坚持党中央集中统一领导是最高政治原则。", "a": "D", "F": "", "E": "", "D": "政治领导力量", "C": "军队领导力量", "B": "组织领导力量", "A": "经济领导力量" },
    { "q": "以习近平同志为核心的党中央旗帜鲜明提出,(    )是党和国家的根本所在、命脉所在,是全国各族人民的利益所系、命运所系。", "a": "A", "F": "", "E": "", "D": "中国共产党执政", "C": "全面从严治党", "B": "人民民主专政", "A": "坚持和完善党的领导" },
    { "q": "坚定走中国道路,把14亿多人民凝聚成中国力量,焕发出中国精神,把新时代中国特色社会主义这篇大文章继续写好、写精彩,从根本上要靠(    ),靠党把好方向盘。", "a": "D", "F": "", "E": "", "D": "党的全面领导", "C": "走中国特色社会主义政治发展道路", "B": "中国式现代化", "A": "经济高质量发展" },
    { "q": "(    ),是全党全国各族人民的共同愿望,是推进全面从严治党、提高党的创造力凝聚力战斗力的迫切要求,是保持党和国家事业发展正确方向的根本保证。", "a": "D", "F": "", "E": "", "D": "确立和维护习近平总书记党中央的核心、全党的核心地位", "C": "实现中华民族伟大复兴的中国梦", "B": "实现国家治理体系和治理能力现代化", "A": "实现全面建设小康社会" },
    { "q": "十年来,我们全面加强党的领导,明确中国特色社会主义最本质的特征是(    )。", "a": "C", "F": "", "E": "", "D": "集中力量办大事", "C": "中国共产党领导", "B": "人民当家作主", "A": "全面依法治国" },
    { "q": "方向决定道路,道路决定命运。党的十八大以来,以习近平同志为核心的党中央高举中国特色社会主义伟大旗帜,把准把好新时代改革开放的方向盘。这个方向就是(    )道路,而不是其他什么道路。", "a": "C", "F": "", "E": "", "D": "人类文明新形态", "C": "中国特色社会主义", "B": "新时代强国", "A": "中国式现代化" },
    { "q": "不谋全局者不足谋一域。要牢固树立(    ),自觉把工作放到大局中去思考、定位、摆布,做到正确认识大局、自觉服从大局、坚决维护大局。", "a": "D", "F": "", "E": "", "D": "大局意识", "C": "核心意识", "B": "看齐意识", "A": "政治意识" },
    { "q": "《新时代的中国青年》白皮书指出,超过(    )贫困青年彻底摆脱贫困,中国青年共同迈向更高水平的小康生活。中国青年的生活水平实现了质的跃升,高质量发展有了更加丰盈、更为坚实的物质基础。", "a": "A", "F": "", "E": "", "D": "2000万", "C": "2300万", "B": "2600万", "A": "2500万" },
    { "q": "\"奋斗的道路不会一帆风顺,要始终发扬大无畏精神和无私奉献精神。\"说明(    )。", "a": "B", "F": "", "E": "", "D": "奋斗是幸福的", "C": "奋斗是美好的", "B": "奋斗是曲折的", "A": "奋斗是精彩的" },
    { "q": "以习近平同志为核心的党中央高度重视青年、热情关怀青年、充分信任青年,鲜明提出(    )原则,大力倡导青年优先发展理念,推动青年工作取得历史性成就,新时代青年发展迎来重大机遇。", "a": "D", "F": "", "E": "", "D": "党管青年", "C": "青年参与社会实践", "B": "青年高质量发展", "A": "新时代青年发展" },
    { "q": "时代新人之\"新\",特别体现在重实干。重实干,就是坚持(    )第一、知行合一,求实务实、有为善为,脚踏实地干事创业,用勤劳的双手创造美好生活。", "a": "B", "F": "", "E": "", "D": "道德", "C": "创新", "B": "实践", "A": "学习" },
    { "q": "新时代青年展现出自信自强、刚健有为的精神风貌。(    ),成为当代中国青年发自内心的最强音。广大青年为党和国家事业取得历史性成就、发生历史性变革贡献了青春、建立了重要功勋!", "a": "B", "F": "", "E": "", "D": "\"把青春献给祖国\"", "C": "\"到祖国需要的地方去\"", "B": "\"清澈的爱,只为中国\"", "A": "\"在美丽的校园里不懈奋斗\"" },
    { "q": "新时代呼唤新担当,(    )是新时代青年的责任。要胸怀\"国之大者\",担当使命任务。", "a": "C", "F": "", "E": "", "D": "共同富裕", "C": "民族复兴", "B": "为人民服务", "A": "建设社会主义现代化国家" },
    { "q": "党的十八大以来,党中央从()破题,坚持从中央政治局做起、从领导干部抓起,以上率下改进工作作风,刹住了一些过去被认为不可能刹住的歪风,纠治了一些多年未除的顽瘴痼疾,党风政风为之一新,社风民风向上向善。", "a": "B", "F": "", "E": "", "D": "开展\"不忘初心,牢记使命\"主题教育", "C": "\"两学一做\"学习教育", "B": "制定和落实中央八项规定", "A": "开展\"四风\"突出问题专项整治" },
    { "q": "()是我们党最鲜明的品格,也是我们党最大的优势。", "a": "D", "F": "", "E": "", "D": "勇于自我革命", "C": "艰苦奋斗", "B": "批评与自我批评", "A": "理论联系实际" },
    { "q": "()是马克思主义政党建设的一贯要求,也是中国共产党建设的优良传统。", "a": "D", "F": "", "E": "", "D": "从严治党", "C": "理论创新", "B": "道路自信", "A": "自我革命" },
    { "q": "从一大党纲强调党内监督、党的五大成立中央监察委员会,到延安整风运动加强党的作风建设,从社会主义革命和建设时期严厉惩处以刘青山、张子善为典型的一系列腐败案件,到改革开放和社会主义现代化建设新时期健全职务犯罪法律规定,无不体现着()。", "a": "B", "F": "", "E": "", "D": "党和国家各项事业沿着正确政治方向不断发展", "C": "维护党中央权威至关重要", "B": "中国共产党始终把从严治党视为重中之重", "A": "中国共产党已经跳出了历史周期律" },
    { "q": "党的十八大以来,全面从严治党的成功经验是突出抓党的()。", "a": "A", "F": "", "E": "", "D": "作风建设", "C": "经济建设", "B": "思想建设", "A": "政治建设" },
    { "q": "坚定不移全面从严治党,必须坚持不懈用()凝心铸魂。", "a": "C", "F": "", "E": "", "D": "马克思主义", "C": "习近平新时代中国特色社会主义思想", "B": "社会主义核心价值观", "A": "中华优秀传统文化" },
    { "q": "()决定党的建设方向和效果。", "a": "B", "F": "", "E": "", "D": "党的制度建设", "C": "党的思想建设", "B": "党的政治建设", "A": "党的道路建设" },
    { "q": "全面贯彻新时代中国特色社会主义思想,以()建设为重点,着力培养忠诚干净担当的高素质干部,着力集聚爱国奉献的各方面优秀人才,坚持德才兼备、以德为先、任人唯贤,为坚持和加强党的全面领导、坚持和发展中国特色社会主义提供坚强组织保证。", "a": "D", "F": "", "E": "", "D": "组织体系", "C": "作风体系", "B": "思想体系", "A": "文化体系" },
    { "q": "党的十九大明确提出党的政治建设这个重大命题,强调党的政治建设是党的()建设。", "a": "B", "F": "", "E": "", "D": "必要性", "C": "基础性", "B": "根本性", "A": "一般性" },
    { "q": "把党的()纳入党的建设总体布局并摆在首位,这是马克思主义党建理论的重大创新。", "a": "D", "F": "", "E": "", "D": "政治建设", "C": "理论建设", "B": "文化建设", "A": "组织建设" },
    { "q": "从严治党是马克思主义政党的()优势。", "a": "D", "F": "", "E": "", "D": "政治", "C": "制度", "B": "道路", "A": "理论" },
    { "q": "()是党和国家的根本所在、命脉所在,是全国各族人民的利益所在、幸福所在。", "a": "C", "F": "", "E": "", "D": "坚持人民民主专政", "C": "坚持和完善党的领导", "B": "坚持思想建设", "A": "坚持改革开放" },
    { "q": "《中共中央关于整党的决定》是在()通过的。", "a": "C", "F": "", "E": "", "D": "1981年", "C": "1983年", "B": "1984年", "A": "1982年" },
    { "q": "只有党的()抓好了,党的政治方向、政治立场、政治大局把握住了,党的政治能力提高了,党的建设才能铸魂扎根。", "a": "B", "F": "", "E": "", "D": "作风建设", "C": "组织建设", "B": "政治建设", "A": "文化建设" },
    { "q": "()是新时代党的自我革命的伟大实践,开辟了百年大党自我革命的新境界。", "a": "A", "F": "", "E": "", "D": "全面建成小康社会", "C": "全面深化改革", "B": "全面依法治国", "A": "全面从严治党" },
    { "q": "()是党的政治建设的首要任务。", "a": "B", "F": "", "E": "", "D": "保证全党服从中央,坚持民主集中制", "C": "保证全党廉洁性,坚持党中央权威和集中统一领导", "B": "保证全党服从中央,坚持党中央权威和集中统一领导", "A": "保证全党治理能力,坚持党中央权威和集中统一领导" },
    { "q": "党的力量来自()。党的全面领导、党的全部工作要靠党的坚强组织体系去实现。", "a": "B", "F": "", "E": "", "D": "领袖", "C": "基层", "B": "组织", "A": "实践" },
    { "q": "新形势下,我们党的自身建设面临一系列新情况新问题新挑战,落实()的任务比以往任何时候都更为繁重、更为紧迫。", "a": "A", "F": "", "E": "", "D": "依法治国、从严治党", "C": "自我革命、从严治党", "B": "党要管党、自我革命", "A": "党要管党、从严治党" },
    { "q": "习近平总书记在党的二十大报告中指出,经过不懈努力,党找到了()这一跳出治乱兴衰历史周期率的第二个答案。", "a": "C", "F": "", "E": "", "D": "立党为公、执政为民", "C": "自我革命", "B": "全心全意为人民服务", "A": "批评与自我批评" },
    { "q": "习近平总书记在中国共产党第十九次全国代表大会上的报告中强调,坚持和加强党的全面领导,坚持党要管党、全面从严治党,以( )为主线。", "a": "B", "F": "", "E": "", "D": "坚定理想信念宗旨", "C": "加强党的政治建设", "B": "加强党的长期执政能力建设、先进性和纯洁性建设", "A": "调动全党积极性、主动性、创造性" },
    { "q": "党的十八大以来,我们党坚持()同向发力,用党的创新理论武装全党,推进学习型政党建设。", "a": "D", "F": "", "E": "", "D": "思想建党和制度治党", "C": "学习建党和法律治党", "B": "学习建党和制度治党", "A": "思想建党和法律治党" },
    { "q": "把()摆在首位,抓住了全面从严治党的根本性问题。", "a": "C", "F": "", "E": "", "D": "思想建设", "C": "政治建设", "B": "经济建设", "A": "文化建设" },
    { "q": "()是党的思想建设的根本任务。", "a": "C", "F": "", "E": "", "D": "学习马克思主义理论经典著作", "C": "用党的创新理论武装全党", "B": "学习优秀党员干部事迹", "A": "将马克思主义与中华优秀传统文化相贯通" },
    { "q": "()问题关系执政党的生死存亡。", "a": "A", "F": "", "E": "", "D": "党务", "C": "党建", "B": "党纪", "A": "党风" },
    { "q": "()通过了关于《中国共产党章程(修正案)》的决议,在总纲部分党的建设总体要求中将\"全面从严治党\"首次写入党章。", "a": "B", "F": "", "E": "", "D": "党的十六大", "C": "党的十八大", "B": "党的十九大", "A": "党的十七大" },
    { "q": "全面从严治党不仅是党长期执政的根本要求,也是实现中华民族伟大复兴的()。", "a": "D", "F": "", "E": "", "D": "根本保证", "C": "必由之路", "B": "有力支撑", "A": "必要条件" },
    { "q": "各级党组织要敢抓敢管,使()真正成为带电的高压线。", "a": "D", "F": "", "E": "", "D": "纪律", "C": "制度", "B": "思想", "A": "规定" },
    { "q": "全面从严治党,核心是(),基础在全面,关键在严,要害在治。", "a": "A", "F": "", "E": "", "D": "坚定理想信念", "C": "以人民为中心", "B": "勇于自我革命", "A": "加强党的领导" },
    { "q": "我们要落实新时代党的建设总要求,健全(),全面推进党的自我净化、自我完善、自我革新、自我提高,使我们党坚守初心使命,始终成为中国特色社会主义事业的坚强领导核心。", "a": "A", "F": "", "E": "", "D": "党的作风建设实践活动机制", "C": "党的组织制度建设", "B": "对无产阶级执政党的监督制度", "A": "全面从严治党体系" },
    { "q": "当今世界,国家间相互开放的程度不断加深,正经历着新一轮大发展大变革大调整,但()是大潮流。", "a": "A", "F": "", "E": "", "D": "相互尊重、相互联系", "C": "相互联系、相互制衡", "B": "相互依存、相互尊重", "A": "相互联系、相互依存" },
    { "q": "()不应该成为世界冲突的根源,而应该成为人类文明进步的动力。", "a": "A", "F": "", "E": "", "D": "治国理念", "C": "民族差异", "B": "经济竞争", "A": "文明差异" },
    { "q": "()变革正处在历史转折点上,国际力量对比发生深刻变化。", "a": "D", "F": "", "E": "", "D": "全球治理体制", "C": "经济发展方式", "B": "科技发展方式", "A": "政治治理模式" },
    { "q": "中国始终坚持()的外交政策宗旨,致力于推动构建人类命运共同体。", "a": "D", "F": "", "E": "", "D": "维护世界和平、促进共同发展", "C": "和平发展、合作共赢", "B": "相互尊重、合作发展", "A": "和合共生、稳定发展" },
    { "q": "经过持续努力,中国特色大国外交全面推进,()成为引领时代潮流和人类前进方向的鲜明旗帜。", "a": "D", "F": "", "E": "", "D": "构建人类命运共同体", "C": "推动世界发展进步", "B": "促进各国广泛交流合作", "A": "建设新型国际关系" },
    { "q": "()是第一要务,适用于各国。", "a": "D", "F": "", "E": "", "D": "发展", "C": "改革", "B": "创新", "A": "合作" },
    { "q": "面对全球性挑战,解决全球性问题和挑战需要世界各国(),共同维护和促进世界和平与发展。", "a": "B", "F": "", "E": "", "D": "同舟共济、合作共赢", "C": "和衷共济、协调行动", "B": "同舟共济、协调行动", "A": "和平发展、合作共赢" },
    { "q": "当前,国际局势动荡加剧,世界正经历百年未有之大变局。在这样的历史背景下,正确大局观是()。", "a": "C", "F": "", "E": "", "D": "在我国同世界的关系中看问题,科学制定我国对外方针政策", "C": "把握本质和全局,避免在国际乱象中迷失方向、舍本逐末", "B": "回顾过去、总结历史规律,展望未来、把握历史前进大势", "A": "抓住机遇,迎接挑战" },
    { "q": "构建人类命运共同体是目标和方向,()是前提和路径,实质是要走出一条国与国交往的新路,并为构建人类命运共同体开辟道路、创造条件。", "a": "B", "F": "", "E": "", "D": "建设新型战略关系", "C": "各国广泛交流合作", "B": "建设新型国际关系", "A": "推动世界发展进步" },
    { "q": "推动建立人类命运共同体,要坚持(),建设一个持久和平的世界。", "a": "A", "F": "", "E": "", "D": "绿色低碳", "C": "合作共赢", "B": "共建共享", "A": "对话协商" },
    { "q": "()理念是回答和解决当今世界面临的\"时代之问\"的中国方案,也是给世界人民带来福祉的人间正道。", "a": "A", "F": "", "E": "", "D": "\"一带一路\"倡议", "C": "合作共赢", "B": "结伴而不结盟", "A": "人类命运共同体" },
    { "q": "()应该成为各国处理国际事务的基本政策取向。", "a": "B", "F": "", "E": "", "D": "与周边国家结盟合作", "C": "创新发展", "B": "合作共赢", "A": "积极践行联合国宪章宗旨和原则" },
    { "q": "中国坚持对外开放的基本国策,坚定奉行()的开放战略,不断以中国新发展为世界提供新机遇,推动建设开放型世界经济,更好惠及各国人民。", "a": "D", "F": "", "E": "", "D": "互利共赢", "C": "平等协商", "B": "合作共赢", "A": "结伴而不结盟" },
    { "q": "党员干部要不断增强拥护核心、跟随核心、捍卫核心的(    ),始终同以习近平同志为核心的党中央保持高度一致。", "a": "BCD", "F": "", "E": "", "D": "思想自觉", "C": "政治自觉", "B": "行动自觉", "A": "立场自觉" },
    { "q": "强化党的组织在同级组织中的领导地位,理顺党的组织同其他组织的关系,不断增强党的(    )。", "a": "ABCD", "F": "", "E": "", "D": "社会号召力", "C": "群众组织力", "B": "政治领导力", "A": "思想引领力" },
    { "q": "坚持党的领导,是通过党的制度来保证实施的。制度带有(    ),健全的领导制度体系对于保证党的领导活动的正常进行,保证党和国家事业的健康发展,具有十分重要的作用。", "a": "ABCD", "F": "", "E": "", "D": "全局性", "C": "稳定性", "B": "根本性", "A": "长期性" },
    { "q": "中央书记处和中央纪律检查委员会、全国人大常委会党组、(    )每年向中央政治局常委会、中央政治局报告工作。", "a": "ABCD", "F": "", "E": "", "D": "全国政协党组", "C": "国务院党组", "B": "最高人民检察院党组", "A": "最高人民法院党组" },
    { "q": "我们党实行的民主集中制,是(    )的制度,是民主和集中紧密结合的制度。", "a": "ABD", "F": "", "E": "", "D": "又有纪律又有自由", "C": "又有个性又有共性", "B": "又有统一意志又有个人心情舒畅生动活泼", "A": "又有集中又有民主" },
    { "q": "以习近平同志为核心的党中央旗帜鲜明提出,党的领导必须是全面的,是指党的(    )。", "a": "ABCD", "F": "", "E": "", "D": "领导方法要全面", "C": "领导对象要全面覆盖", "B": "领导内容要全面", "A": "领导过程要全面" },
    { "q": "为了实现中华民族伟大复兴,中国共产党团结带领中国人民创造了(    )的伟大成就。", "a": "ABCD", "F": "", "E": "", "D": "社会主义革命和建设", "C": "新民主主义革命", "B": "新时代中国特色社会主义", "A": "改革开放和社会主义现代化建设" },
    { "q": "中国共产党一路走来,不断从胜利走向胜利,每一步都离不开科学有效的决策及周密部署和有效实施。善于(    ),是党的领导水平和执政本领的集中体现。", "a": "ABC", "F": "", "E": "", "D": "办事情", "C": "想办法", "B": "作决策", "A": "抓问题" },
    { "q": "在长期奋斗中,党形成了自身的(    )和密切联系群众的优势。正是这些优势引领和锻造了中国特色社会主义的制度优势,从根本上保证中国特色社会主义不变色、不变质。", "a": "ABCD", "F": "", "E": "", "D": "制度优势", "C": "政治优势", "B": "组织优势", "A": "理论优势" },
    { "q": "党的十九届四中全会审议通过的《中共中央关于坚持和完善中国特色社会主义制度、推进国家治理体系和治理能力现代化若干重大问题的决定》中强调,坚持和完善党的领导制度体系,提高党(    )水平。", "a": "BCD", "F": "", "E": "", "D": "依法执政", "C": "科学执政", "B": "民主执政", "A": "全面执政" },
    { "q": "党是最高政治领导力量,这是由国家宪法所确立的,是经过中国革命、建设、改革伟大实践所检验的,具有无可置疑的(    )。", "a": "ACD", "F": "", "E": "", "D": "历史合理性", "C": "实践合理性", "B": "理论合理性", "A": "价值合理性" },
    { "q": "2016年10月,党的十八届六中全会正式确立习近平总书记党中央的核心、全党的核心地位,要求全党必须牢固树立(    )。", "a": "ABCD", "F": "", "E": "", "D": "大局意识", "C": "政治意识", "B": "看齐意识", "A": "核心意识" },
    { "q": "中央政治局全体同志每年向(    )书面述职。", "a": "BD", "F": "", "E": "", "D": "总书记", "C": "全国人大常委会党组", "B": "党中央", "A": "国务院党组" },
    { "q": "维护党中央权威和集中统一领导,必须对党忠诚。切实做到(    )。", "a": "ABCD", "F": "", "E": "", "D": "思想上高度认同", "C": "行动上紧紧跟随", "B": "政治上坚决维护", "A": "组织上自觉服从" },
    { "q": "只要我们坚持党的全面领导不动摇,坚决维护(    ),充分发挥党的领导政治优势,把党的领导落实到党和国家事业各领域各方面各环节,就一定能够确保全党全军全国各族人民团结一致向前进。", "a": "BD", "F": "", "E": "", "D": "党的核心", "C": "党中央纪律", "B": "党中央权威", "A": "党的意志" },
    { "q": "国家治理体系是由众多子系统构成的复杂系统,这个系统的核心是中国共产党,人大、政府、政协、(    ),各民主党派和无党派人士,各企事业单位,工会、共青团、妇联等群团组织,都要坚持中国共产党领导。", "a": "ABCD", "F": "", "E": "", "D": "军队", "C": "法院", "B": "检察院", "A": "监委" },
    { "q": "社会治理离不开一定的组织形态。中国共产党的组织形态既推进了社会的有序治理,又保证了社会充满活力。关于党领导社会治理,以下说法正确的是(    )。", "a": "BCD", "F": "", "E": "", "D": "中国共产党以党的服务功能推进社会有效运转", "C": "中国共产党的政治功能为社会治理提供方向", "B": "中国共产党以强大的组织体系确保社会治理和谐有序", "A": "中国共产党带领中国人民实现了第一个百年奋斗目标" },
    { "q": "党的领导地位不是自封的,是(    )。", "a": "ACD", "F": "", "E": "", "D": "由党的性质决定的", "C": "由宪法明文规定的", "B": "由统治阶级决定的", "A": "历史和人民的选择" },
    { "q": "为了实现中华民族伟大复兴,中国共产党团结带领中国人民,自信自强、守正创新,统揽(    ),创造了新时代中国特色社会主义的伟大成就。", "a": "ABCD", "F": "", "E": "", "D": "伟大工程", "C": "伟大事业", "B": "伟大梦想", "A": "伟大斗争" },
    { "q": "要教育引导党员干部从历史和现实、理论和实践、国内和国际的结合上深刻认识、强化认同,不断增强(    )的思想自觉、政治自觉、行动自觉,始终同以习近平同志为核心的党中央保持高度一致。", "a": "BCD", "F": "", "E": "", "D": "拥护核心", "C": "捍卫核心", "B": "跟随核心", "A": "维护核心" },
    { "q": "党的二十大报告提出,坚持和加强党中央集中统一领导。健全总揽全局、协调各方的党的领导制度体系,完善党中央重大决策部署落实机制,确保全党在(    )上同党中央保持高度一致,确保党的团结统一。", "a": "ABCD", "F": "", "E": "", "D": "政治立场", "C": "政治方向", "B": "政治原则", "A": "政治道路" },
    { "q": "要优化党中央决策议事协调机构,负责重大工作的(    )。", "a": "ABCD", "F": "", "E": "", "D": "总体布局", "C": "顶层设计", "B": "整体推进", "A": "统筹协调" },
    { "q": "党是最高政治领导力量,主要体现在(    )等方面。", "a": "ABCD", "F": "", "E": "", "D": "引领政治方向", "C": "领导社会治理", "B": "决断重大事项", "A": "统领政治体系" },
    { "q": "党的领导必须是(    )。习近平总书记对党的领导核心作用作了鲜明生动的阐述,他强调:\"形象地说是'众星捧月,这个'月'就是中国共产党。\"", "a": "BCD", "F": "", "E": "", "D": "系统的", "C": "全面的", "B": "整体的", "A": "全局的" },
    { "q": "坚持党的全面领导,既要政治过硬,也要本领高强。要着力提高党(    )的能力和定力,牢牢把握工作主动权,把党总揽全局、协调各方落到实处。", "a": "ABCD", "F": "", "E": "", "D": "谋大局", "C": "促改革", "B": "定政策", "A": "把方向" },
    { "q": "坚决维护党的核心和党中央权威,是(    )。", "a": "ABCD", "F": "", "E": "", "D": "新时代坚持和发展中国特色社会主义、实现中华民族伟大复兴的根本政治保证", "C": "坚持党的全面领导的核心要义", "B": "中国共产党能够成功和继续成功的根本政治优势", "A": "党的百年奋斗的重要历史经验" },
    { "q": "中国共产党是中国特色社会主义事业的开创者、推动者、引领者,团结带领人民(    )。", "a": "ABCD", "F": "", "E": "", "D": "创建了中国特色社会主义制度", "C": "发展了中国特色社会主义文化", "B": "开辟了中国特色社会主义道路", "A": "创立了中国特色社会主义理论" },
    { "q": "系统完善党的领导制度体系,全党增强\"四个意识\",自觉在思想上政治上行动上同党中央保持高度一致,不断提高(    ),确保党中央权威和集中统一领导。", "a": "BCD", "F": "", "E": "", "D": "政治执行力", "C": "政治判断力", "B": "政治领悟力", "A": "政治领导力" },
    { "q": "2021年4月19日,习近平总书记来到清华大学考察。 对于青年,习近平总书记语重心长,当代中国青年是与新时代同向同行、共同前进的一代,生逢盛世,肩负重任。他寄语青年(    )。", "a": "ABCD", "F": "", "E": "", "D": "爱国爱民", "C": "实学实干", "B": "锤炼品德", "A": "勇于创新" },
    { "q": "习近平总书记在党的二十大报告中强调,要做(    )。", "a": "ABC", "F": "", "E": "", "D": "青年学生的摆渡人", "C": "青年朋友的知心人", "B": "青年工作的热心人", "A": "青年群众的引路人" },
    { "q": "时代新人之\"新\",特别体现在讲奉献。讲奉献,就是具有自觉的(    ),主动担当民族复兴的历史责任,在尽责集体、服务社会、贡献国家中体现自身价值。", "a": "ABC", "F": "", "E": "", "D": "思想意识", "C": "责任意识", "B": "国家意识", "A": "民族意识" },
    { "q": "要把爱国作为最大的德,胸怀(    ),不断奉献祖国、奉献人民,以一生的真情投入、一辈子的顽强奋斗来体现爱国主义情怀,让爱国主义的伟大旗帜始终在心中高高飘扬!", "a": "BC", "F": "", "E": "", "D": "爱国爱党之情", "C": "忧国忧民之心", "B": "爱国爱民之情", "A": "忧国忧家之心" },
    { "q": "新时代好青年要正确处理好(    )、民族和世界等方面的困惑。", "a": "ABCD", "F": "", "E": "", "D": "主义和问题", "C": "小我和大我", "B": "理想和现实", "A": "利己和利他" },
    { "q": "广大青年要坚定不移(    ),让青春在全面建设社会主义现代化国家的火热实践中绽放绚丽之花。", "a": "ABCD", "F": "", "E": "", "D": "听党话", "C": "怀抱梦想又脚踏实地", "B": "跟党走", "A": "敢想敢为又善作善成" },
    { "q": "要牢固树立为共产主义奋斗终身的\"大志向\",(    )。", "a": "ABCD", "F": "", "E": "", "D": "坚定对中华民族伟大复兴中国梦的信心", "C": "坚定对中国特色社会主义的信念", "B": "用习近平新时代中国特色社会主义思想武装头脑,从内心深处厚植对党的信赖", "A": "坚定对马克思主义的信仰" },
    { "q": "善思,是要把(    )紧密结合起来,求真理、悟道理、明事理。", "a": "ABD", "F": "", "E": "", "D": "学习同思考", "C": "爱国同思考", "B": "实践同思考", "A": "观察同思考" },
    { "q": "《新时代的中国青年》白皮书强调,新时代中国青年享受更全面的保障支持,成长成才有了(    )。", "a": "ABCD", "F": "", "E": "", "D": "更良好的法治环境", "C": "更有力的政策支持", "B": "更温暖的组织关怀", "A": "更可靠的社会保障" },
    { "q": "关于新时代青年发展的新机遇,以下说法正确的是(    )。", "a": "ABD", "F": "", "E": "", "D": "享受更全面的保障支持", "C": "能够为社会作出更多贡献", "B": "拥有更高质量的发展条件", "A": "获得更多人生出彩机会" },
    { "q": "中华民族是历史悠久、饱经沧桑的古老民族,更是自强不息、朝气蓬勃的青春民族。在5000多年源远流长的文明历史中,中华民族始终有着(    )。", "a": "ABCD", "F": "", "E": "", "D": "\"少年强则国强,少年进步则国进步\"的信念", "C": "\"希望寄托在你们身上\"的期待", "B": "\"长江后浪推前浪\"的情怀", "A": "\"自古英雄出少年\"的传统" },
    { "q": "中华民族是历史悠久、饱经沧桑的古老民族,更是自强不息、朝气蓬勃的青春民族。千百年来,(    )始终是推动中华民族勇毅前行、屹立于世界民族之林的磅礴力量!", "a": "BCD", "F": "", "E": "", "D": "青春的力量", "C": "青春的创造", "B": "青春的涌动", "A": "青春的激情" },
    { "q": "坚持和加强党中央集中统一领导,要增强党内政治生活(),用好批评和自我批评武器,持续净化党内政治生态。", "a": "ABCD", "F": "", "E": "", "D": "政治性", "C": "原则性", "B": "时代性", "A": "战斗性" },
    { "q": "党坚持依规治党,严格遵守党章,形成比较完善的党内法规体系,严格制度执行,党的建设()水平明显提高。", "a": "BCD", "F": "", "E": "", "D": "规范化", "C": "科学化", "B": "制度化", "A": "大众化" },
    { "q": "党的纪律是刚性约束,政治纪律更是全党在()方面必须遵守的刚性约束。", "a": "ABCD", "F": "", "E": "", "D": "政治言论", "C": "政治立场", "B": "政治行动", "A": "政治方向" },
    { "q": "新形势下,我们党的自身建设面临一系列新情况新问题新挑战,落实()的任务比以往任何时候都更为繁重、更为紧迫。", "a": "AC", "F": "", "E": "", "D": "自我革命", "C": "从严治党", "B": "依法治国", "A": "党要管党" },
    { "q": "党的二十大报告提出,坚决打赢反腐败斗争攻坚战持久战。深化标本兼治,推进反腐败国家立法,加强新时代廉洁文化建设,教育引导广大党员、干部增强不想腐的自觉,清清白白做人、干干净净做事,使()紧密结合、协调联动,不断取得更多制度性成果和更大治理效能。", "a": "BCD", "F": "", "E": "", "D": "教育引导", "C": "规范权力", "B": "严厉惩治", "A": "思想改造" },
    { "q": "新形势下党面临的\"考验\"包括()。", "a": "ABCD", "F": "", "E": "", "D": "改革开放考验", "C": "长期执政考验", "B": "市场经济考验", "A": "外部环境考验" },
    { "q": "完善党的自我革命制度规范体系。要坚持制度治党、依规治党,(),完善党内法规制度体系,增强党内法规权威性和执行力,形成坚持真理、修正错误,发现问题、纠正偏差的机制。", "a": "AD", "F": "", "E": "", "D": "以党章为根本", "C": "以民主集中制为根本", "B": "以党章为核心", "A": "以民主集中制为核心" },
    { "q": "一百多年来,中国共产党(),从最初50多名党员发展到今天拥有9600多万名党员的世界第一大执政党,历经千锤百炼而朝气蓬勃,正带领中国人民以不可阻挡的步伐迈向伟大复兴。", "a": "ABCD", "F": "", "E": "", "D": "坚持理想信念", "C": "坚持性质宗旨", "B": "坚守初心使命", "A": "勇于自我革命" },
    { "q": "党的十九届四中全会提出建立()的制度,把其作为加强党的建设的永恒课题和全体党员、干部的终身课题,形成长效机制,坚持不懈锤炼党员、干部忠诚干净担当的政治品格。", "a": "BC", "F": "", "E": "", "D": "终身学习", "C": "牢记使命", "B": "不忘初心", "A": "\"两学一做\"" },
    { "q": "我们党始终坚持从严治党,保持了党的()。", "a": "BD", "F": "", "E": "", "D": "先进性", "C": "组织性", "B": "纯洁性", "A": "革命性" },
    { "q": "中国共产党是中国特色社会主义制度的创建者。(    )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "党和国家大政方针的决定权在人民代表大会。历史表明,要治理好中国共产党这个大党、治理好中国这个大国,保证党的团结和集中统一至关重要,维护党中央权威至关重要。(    )", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "政治意识就是要求向党中央看齐,向党的理论和路线方针政策看齐,向党中央决策部署看齐,做到党中央提倡的坚决响应、党中央决定的坚决执行、党中央禁止的坚决不做。(    )", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "党的领导第一位的就是定政策,制定切实管用的政策措施。(    )", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "党、政、军、民、学在党中央的集中统一领导下,既各司其职、各负其责又相互配合,这样治国理政才有方向、有章法、有力量。(    )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "中国共产党的领导是由科学社会主义的历史逻辑和中国特色社会主义迈向新征程的实践逻辑决定的。(    )", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "《中国共产党章程(修正案)》和宪法总纲确认了党的领导在中国特色社会主义中的地位,也就确定了党在国家治理中的核心领导地位。(   )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "中国共产党领导人大、政府、政协、监察机关、审判机关、检察机关、武装力量、人民团体等,不领导企事业单位、基层群众性自治组织、社会组织等。(    )", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "中国特色社会主义制度是一个严密完整的科学制度体系,起四梁八柱作用的是党的根本制度。(    )", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "政策是体现执政党性质宗旨的试金石,是反映治国理政水平的标志。(    )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "核心意识就是要始终坚持、切实加强党的领导,特别是党中央的集中统一领导,更加紧密地团结在以习近平同志为核心的党中央周围,更加坚定地维护党中央权威,更加自觉地在思想上政治上行动上同党中央保持高度一致。(    )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "中国共产党领导是中国特色社会主义最本质的特征,就在于党的领导直接关系着中国特色社会主义的性质、方向和命运。(    )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "在坚持和加强党的全面领导问题上,一些人把它与过去党的一元化领导简单等同起来,这种认识是错误的。(    )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "党的十九届三中全会审议通过了《中共中央关于全面深化改革若干重大问题的决定》。(    )", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "党的十九届六中全会从制度建设层面对坚持和加强党的全面领导作出新的战略安排,把党的领导制度明确为我国的根本领导制度。(    )", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "一个国家、一个政党,领导核心至关重要。坚决维护习近平总书记党中央的核心、全党的核心地位,保证全党令行禁止,形成思想和行动高度统一的整体,这是一个成熟的马克思主义执政党的必然要求。(    )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )经过百年奋斗特别是党的十八大以来新的实践,我们党给出了跳出历史周期率的第一个答案,这就是自我革命。(     )", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )全面从严治党,党委(党组)负主体责任。(    )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )百年来,我们党就是在不断吸取经验、守正创新中成长成熟的,我们一次次用改革发展祛除顽瘴痼疾,一次次靠自身努力和外来帮助的双重作用解决了自身问题。(     )", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )全面从严治党是实现中华民族伟大复兴的根本任务。(     )", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )全面深化改革是决定党兴衰成败的关键因素。(     )", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )我们党作为世界上最大的马克思主义执政党,要始终赢得人民拥护、巩固长期执政地位,必须时刻保持解决大党独有难题的清醒和坚定。(    )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )党的二十大报告首次提出\"健全全面从严治党体系\"。(     )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )我们要落实新时代党的建设总要求,健全全面从严治党体系,全面推进党的自我净化、自我完善、自我革新、自我提高,使我们党坚守初心使命,始终成为中国特色社会主义事业的坚强领导核心。(     )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )中国共产党的反腐败成绩是\"足以同在中国这样一个世界上人口最多的国家解决温饱问题、极大消除贫困相提并论的一个巨大贡献\"。(     )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )腐败是危害党的生命力和战斗力的最大毒瘤。(     )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )中国共产党的伟大不在于不犯错误, 而在于从不讳疾忌医, 敢于直面问题, 勇于自我革命, 具有极强的自我修复能力。(     )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )严密的组织体系是党的优势所在、力量所在。(    )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )党的二十大报告提出,要以零容忍态度反腐惩恶,更加有力遏制增量,更加有效清除存量,坚决查处政治问题和经济问题交织的腐败,坚决防止基层党员成为利益集团和权势团体的代言人、代理人,坚决治理政商勾连破坏政治生态和经济发展环境问题,决不姑息。(     )", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )党的十九大报告提出,要坚持制度治党、依规治党,以党章为根本,以民主集中制为核心,完善党内法规制度体系,增强党内法规权威性和执行力,形成坚持真理、修正错误,发现问题、纠正偏差的机制。(    )", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "(  )新形势下党面临\"四大考验\"包括:长期执政考验、改革开放考验、市场经济考验、经济全球化考验。(     )", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "文明差异不应该成为世界冲突的根源,而应该成为人类文明进步的动力。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "人类命运共同体理念是回答和解决当今世界面临的\"时代之问\"的中国方案,也是给世界人民带来福祉的人间正道。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "未来,中国会减少对全球发展合作的资源投入,致力于携手发达国家,实现双方利益最大化。", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "中国坚决反对保护主义,反对\"筑墙设垒\"、\"脱钩断链\",反对单边制裁、极限施压。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "解决全球性问题和挑战需要世界各国同舟共济、协调行动。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "当今世界,逆全球化思潮正在发酵,保护主义的负面效应日益显现,收入分配不平等、发展空间不平衡已成为全球经济治理面临的最突出问题。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "人类是不可分割的有机整体的现实逻辑在于人类历史是在无太大差异的民族、文化的相遇相知中向前发展。", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "习近平主席在莫斯科国际关系学院发表《共同构建人类命运共同体》的主旨演讲,提出世界怎么了、我们怎么办?", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "在新形势下,中国将继续履行大国责任,展现大国担当,作出大国贡献,提供更多全球公共产品,为世界和平与发展事业添砖加瓦。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },

  ];


  logWithTime("题库数量：" + tiku.length)


  //************************************* */
  alert(
    "FBI WARNING\n " +
    "1、推荐设备:Xiaomi、Redmi\n" +
    "2、仅支持推荐设备完美运行\n" +
    "3、兼容一部分其他手机(需添加‘信任文件’)\n" +
    "4、不支持任何平板设备运行此助手\n" +
    "5、使用非推荐设备所产生一切后果需自行承担")


  alert(
    "FBI WARNING\n " +
    "1、本助手只能在微信中运行\n" +
    "2、*建议0 : 背到都是自己的 , 不建议使用本助手\n" +
    "3、*建议1 : 200秒后提交\n" +
    "4、*警告 : 如有发现不听取 ‘建议1’ 者将在后续版本中加入强制十分钟限速\n" +
    "5、使用本助手所产生一切后果需自行承担")


  device.wakeUpIfNeeded();
  device.keepScreenOn();
  logWithTime("剩余电量" + device.getBattery())
  logWithTime("保持屏幕常亮")
  var url1 = ("www.baidu.com")
  alert(
    "正在使用： 4399 ")
  alert(
    "注意！ \n " +
    "\n" +
    "\n" +
    "完事前 ， 不要动 ! \n " +
    "\n" +
    "完事前 ， 不要动 ! \n " +
    "\n" +
    "完事前 ， 不要动 ! \n " +
    "\n" +
    "【看到 ‘开测!’ 后 建议 最小化 左上角 运行台】")

  alert(
    "注意！！！ \n " +
    "\n" +
    "\n" +
    "完事前 ， 不要动 ! \n " +
    "\n" +
    "如遇小助手中途卡住，不要手动点击！按音量上键后，重新运行即可！\n " +
    "\n" +
    "如遇小助手中途卡住，不要手动点击！按音量上键后，重新运行即可！\n " +
    "\n" +
    "如遇小助手中途卡住，不要手动点击！按音量上键后，重新运行即可！\n " +
    "\n")

  app.launchApp("微信")
  sleep(1000);
  unlock();
  id("grs").findOne().click();
  logWithTime("测一码")
  sleep(500)
  id("knx").className("android.widget.TextView").text("扫一扫").findOne().parent().click();
  logWithTime("正在测码");
  logWithTime("等待考试开始");
  //console.hide();
  className("android.view.View").depth("10").indexInParent(0).findOne();
  logWithTime("开 测 ！");

  //此次未收入题库数Y
  var X = 0;//计数器X
  var Y = 0;

  //此次未匹配答案数Z
  var x = 0;//计数器x
  var z = 0;//计数器z
  var Z = 0;


  //几种 正则表达式
  pattern = /[`~!@#$^&*()=|{},':;'“”,\\\[\]\.<>\/?~！@#￥…… & *（）——|{},【】'；：""'。，、？\s \d \多选题 \单选题 \判断题 ]/g;    //去标点符号，空格，数字，题型
  pattern1 = /[`~!@#$^&*()=|{},':;'“”,\\\[\]\.<>\/?~！@#￥…… & *（）——|{},【】'；：""'。，、？\s \多选题 \单选题 \判断题 a-z A-Z]/g;      //保留选项
  pattern2 = /[^A-Z]/g;                                                                                                        //只保留英文字母
  pattern3 = /[^\u4e00-\u9fa5]/g;                                                                                            //只保留汉字



  //获取题目 打印出来
  for (var n = 0; n >= 0; n++) {
    var timu = className("android.view.View").depth("12").indexInParent(n).findOne(1000);
    //log(timu);

    if (timu != null) {
      var arr = timu.children();
      var a = arr.length;
      //log(a);

      var q = timu.child(0);
      var Q_txt = q.text().replace(pattern, "");
      logWithTime(n + 1 + "、" + Q_txt);




      for (var k = 0; k < tiku.length; k++) {                          // 题库循环   -->   找题目
        var que = tiku[k].q;
        let que = que.replace(pattern, "");
        var daan = tiku[k].a;
        var daan_txt = String;
        var daan_txt1 = String;

        if (que == Q_txt) {
          X = 0;
          log("答案：" + daan);
          //log(daan.length)
          //log(daan[0])
          for (r = 0; r < daan.length; r++) {
            //获取ABCD
            for (var i = 1; i < a; i++) {

              var selection = timu.child(i)
              var selectioni = selection.child(1);
              //log(selectioni.text());
              var xuan = selectioni.text().replace(pattern1, "")
              var pan = selectioni.text().replace(pattern1, "")
              //log(xuan)

              if (daan[r] == "A") {
                daan_txt = tiku[k].A.replace(pattern1, "")
                log("A:" + daan_txt)
              } else if (daan[r] == "B") {
                daan_txt = tiku[k].B.replace(pattern1, "")
                log("B:" + daan_txt)
              } else if (daan[r] == "C") {
                daan_txt = tiku[k].C.replace(pattern1, "")
                log("C:" + daan_txt)
              } else if (daan[r] == "D") {
                daan_txt = tiku[k].D.replace(pattern1, "")
                log("D:" + daan_txt)
              } else if (daan[r] == "E") {
                daan_txt = tiku[k].E.replace(pattern1, "")
                log("E:" + daan_txt)
              } else if (daan[r] == "F") {
                daan_txt = tiku[k].F.replace(pattern1, "")
                log("F:" + daan_txt)
              } else if (daan == "正确" || daan == "对") {
                daan_txt = "正确";
                daan_txt1 = "对";
                if (xuan == daan_txt) {
                  log("判断:" + daan_txt)
                } else if (xuan == daan_txt1) {
                  log("判断:" + daan_txt1)
                }

              } else if (daan == "错误" || daan == "错") {
                daan_txt = "错误";
                daan_txt1 = "错";
                if (xuan == daan_txt) {
                  log("判断:" + daan_txt)
                } else if (xuan == daan_txt1) {
                  log("判断:" + daan_txt1)
                }

              } else {
                log("不知道")
              };


              if (xuan == daan_txt || pan == daan_txt1) {
                //log(xuan)
                selection.click()
                x = x + 1;
              } else {
                continue
              }

            }
            if (x == 0) {
              z = z + 1;
            } else {
              z = 0
            }

          }
          x = 0;

          if (z !== 0 && k < tiku.length - 1) {
            continue
          } else if (z !== 0 && k == tiku.length - 1) {
            Z = Z + 1;
            z = 0;
          } else if (z == 0) {
            break;
          }
          //另一种思路：
          //z = z / (daan.length) 
          //Z = Z + z


        } else {
          X = X + 1;
          if (X == tiku.length) {
            Y = Y + 1;
            X = 0;
          }
          continue
        }

      }








    } else {

      log("已获取全部题目");
      break;

    }




  }
  alert("完事！\n" +
    "此次未收入题库数：" + Y +
    "\n此次未匹配答案数：" + Z);

}

测码()
