“ui”
function 测码() {
  auto.waitFor();
  console.show();


  //显示当前时分秒
  //function formatDate() {
  //var year = d.getFullYear();
  //var month = d.getMonth() + 1;
  //var date = d.getDate();
  //var hour = d.getHours();
  //var day = d.getDay()
  //var minute = d.getMinutes();
  //var second = d.getSeconds();
  //var millisecond = d.getMilliseconds();
  //var 时间 = （ year + "-" + month + "-" + date + " " + hour + ":" + minute + ":" + second + ":" + millisecond）;
  //}
  //console.log(时间)
  //

  //显示当前时间
  var d = new Date();
  console.log(d)
  //

  //获取实时时间戳
  function timestamp() {
    var d = new Date
    var hour = d.getHours();
    var minute = d.getMinutes();
    var second = d.getSeconds();
    var millisecond = d.getMilliseconds();
    var t = (hour + ":" + minute + ":" + second + ":" + millisecond);

    //return t
    console.log(t)
  }
  //

  // 获取时分秒用于记录日志
  function logWithTime(msg) {
    timestamp() + console.info(" " + msg);
  }
  //

  //向上滑动
  function upslide() {
    var c = device.width;
    var b = device.height;
    toast("正在滑动")
    swipe(c / 2, b / 10 * 9, c / 2, b / 10, 500);
  }
  //

  //解锁手机
  if (!device.isScreenOn()) {
    toast("正在唤醒");
    logWithTime("正在唤醒");
    device.wakeUp();
    sleep(500);

    sleep(500);

  } else {
    toast("未锁屏");
    logWithTime("未锁屏");
  }
  //

  //解锁应用锁
  function unlock() {
    if (packageName("com.miui.securitycenter").exists()) {
      logWithTime("检测到应用锁");
      if (id("lockPattern").exists()) {
        logWithTime("检测到密码验证");
        logWithTime("正在验证");
        //gesture(延迟(多手势) , 持续时间 , 点1 ，点2 ， ......)
      } else {
        logWithTime("非密码验证")
        logWithTime("正在寻找切换")
        //此处需要增加两个个浏览近期任务recents()动作
        sleep(500)
        recents()
        sleep(500)
        recents()
        id("finger_password_switch").findOne().click()
        logWithTime("正在切换密码验证");
        id("lockPattern").findOne();
        logWithTime("正在验证")
      }
      sleep(1000)
      gesture(1250, [335, 2360], [710, 1975], [1105, 1975], [1105, 2360], [1105, 2745], [710, 2745], [335, 2745], [710, 2360], [335, 1975])
      logWithTime("验证成功")
    } else {
      logWithTime("未发现应用锁")
    }
  }
  sleep(2000)
  //
  const tiku = [

    {"q":"2020年9月,习近平总书记在湖南省长沙市主持召开基层代表座谈会并发表重要讲话,听取基层干部群众代表对\"十四五\"规划编制的意见和建议。\"十四五\"规划编制网上征求意见,也得到广大人民群众的积极响应,留言就有100多万条,从中整理出了1000余条建议。这体现了(    )。","a":"D","F":"","E":"","D":"我们党坚持走群众路线","C":"我们党以满足人民日益增长的美好生活需要为根本目的","B":"我们党没有自己特殊的利益","A":"我们党一直致力于促进人的全面发展"},
    {"q":"在党的二十大报告中,\"人民\"是贯穿始终的一条主线,出现的次数高达105次。这体现了我们党(    )。","a":"A","F":"","E":"","D":"增长了政治智慧","C":"赢得人民信任、得到人民支持","B":"增强了执政本领","A":"坚持以人民为中心的根本立场"},
    {"q":"延安红色政权是陕北人民用小米哺育出来的,淮海战役的胜利是人民用小车推出来的,农村改革是小岗村村民\"冒死\"摁红手印开启的,乡镇企业是苏南群众在改革大潮中摸索出来的,新时代数字经济、共享经济、网购经济的新业态新模式是亿万网民推动兴起的。这些都说明(    )。","a":"D","F":"","E":"","D":"党的历史伟业是人民创造的","C":"我国的政权是人民的政权","B":"必须坚持和完善党的领导","A":"党坚持走群众路线"},
    {"q":"在习近平总书记引用过的诗句中,能体现党的根本立场的是(    )。","a":"D","F":"","E":"","D":"\"些小吾曹州县吏,一枝一叶总关情\"","C":"\"宰相必起于州部,猛将必发于卒伍\"","B":"\"物之不齐,物之情也\"","A":"\"大道之行也,天下为公\""},
    {"q":"(    )是我们党的生命线和根本工作路线,是我们党永葆青春活力和战斗力的重要传家宝。","a":"D","F":"","E":"","D":"群众路线","C":"武装斗争","B":"统一战线","A":"党的领导"},
    {"q":"习近平总书记在庆祝中国共产党成立100周年大会的讲话中,号召\"牢记初心使命,坚定理想信念,践行党的宗旨\"。中国共产党人的初心和使命是(    )。①全心全意为人民服务②为中国人民谋幸福③实现共产主义④为中华民族谋复兴","a":"C","F":"","E":"","D":"③④","C":"②④","B":"①②","A":"①③"},
    {"q":"中国式现代化是(    )的现代化。这是中国特色社会主义制度的本质决定的。","a":"A","F":"","E":"","D":"物质文明和精神文明相协调","C":"和平发展","B":"人与自然和谐共生","A":"全体人民共同富裕"},
    {"q":"习近平总书记在庆祝中国共产党成立100周年大会上发表重要讲话并指出:江山就是人民、人民就是江山。打江山、守江山,守的是(    )。","a":"D","F":"","E":"","D":"人民的心","C":"制度体系","B":"发展成就","A":"人民民主专政"},
    {"q":"实现全体人民共同富裕的宏伟目标,最终靠的是(    )。","a":"C","F":"","E":"","D":"资源","C":"发展","B":"改革","A":"人口红利"},
    {"q":"据约翰斯·霍普金斯大学数据,截至2022年6月7日,美国累计确诊病例8499.6万,累计死亡100.9万例。据中国31个省(自治区、直辖市)和新疆生产建设兵团报告,累计确诊病例22.4万,累计死亡5226例。中美抗疫对比差别如此之大,凸显了(    )。","a":"A","F":"","E":"","D":"中国综合国力已经超越美国","C":"中美抗疫方法的不同","B":"中国医疗资源已经成为全世界第一","A":"人民立场是马克思主义政党区别于资产阶级政党的显著标志"},
    {"q":"在中国共产党领导的社会主义中国,关于党性和人民性的关系,下列表述错误的是(    )。","a":"D","F":"","E":"","D":"党性和人民性要统筹兼顾","C":"没有脱离党性的人民性","B":"党性寓于人民性之中","A":"党性和人民性是一致的、统一的"},
    {"q":"党的十九届六中全会通过的《中共中央关于党的百年奋斗重大成就和历史经验的决议》全面回顾总结了党的百年奋斗历程和重大成就。回望百年征程,中国共产党领导中国人民迎来了中华民族从站起来到富起来、强起来的伟大飞跃,创造了一个又一个彪炳史册的人间奇迹。这表明(    )。","a":"D","F":"","E":"","D":"中国共产党始终代表最广大人民的根本利益","C":"中国共产党始终坚持以中国特色社会主义理论为指导","B":"中国共产党始终坚持全面建成小康社会的奋斗目标","A":"中国共产党始终是执政党,坚持立党为公、执政为民"},
    {"q":"\"什么是共产党?共产党就是自己有一条被子,也要剪下半条给老百姓的人。\"\"半条棉被\"的故事体现了(    )。","a":"D","F":"","E":"","D":"中国共产党的人民情怀和为民本质","C":"中国共产党始终把作风建设放在首位","B":"以人为本、执政为民已成为所有党员的自觉行动","A":"党员除了代表广大人民的利益,没有个人利益"},
    {"q":"坚持以人民为中心的根本立场,必须把(    )贯彻到治国理政全部活动之中。","a":"C","F":"","E":"","D":"党的领导","C":"群众路线","B":"经济发展","A":"依法治国"},
    {"q":"(    )是社会主义的本质要求,是中国式现代化的重要特征。","a":"B","F":"","E":"","D":"建设创新型国家","C":"全面小康","B":"共同富裕","A":"建设工业强国"},
    {"q":"中国共产党的最大政治优势是(    )。","a":"A","F":"","E":"","D":"理论联系实际","C":"中国共产党领导的多党合作和政治协商制度","B":"批评与自我批评","A":"密切联系群众"},
    {"q":"实现(    )是共产主义的基本原则。","a":"C","F":"","E":"","D":"现代化","C":"人的全面发展","B":"人类命运共同体","A":"共同富裕"},
    {"q":"中国共产党作为马克思主义政党,把带领人民创造美好生活、实现共同富裕作为矢志不渝的奋斗目标,体现了新时代坚持和发展中国特色社会主义的(    )。","a":"A","F":"","E":"","D":"最终理想","C":"基本目标","B":"最高目标","A":"内在要求"},
    {"q":"促进人民精神生活共同富裕,要强化(    )引领。","a":"D","F":"","E":"","D":"社会主义核心价值观","C":"中华优秀传统文化","B":"党史教育","A":"爱国主义"},
    {"q":"新时代中国共产党深刻把握推进共同富裕规律,提出\"要深入研究不同阶段的目标,分阶段促进共同富裕:到(    ),全体人民共同富裕基本实现,居民收入和实际消费水平差距缩小到合理区间\"。","a":"B","F":"","E":"","D":"2035年","C":"'十四五'末","B":"本世纪中叶","A":"中国共产党成立一百年"},
    {"q":"(    )是马克思主义的本质属性。","a":"A","F":"","E":"","D":"纯洁性","C":"革命性","B":"先进性","A":"人民性"},
    {"q":"(    )是中国共产党的根本政治立场,是马克思主义政党区别于其他政党的显著标志。","a":"C","F":"","E":"","D":"阶级立场","C":"人民立场","B":"民族立场","A":"执政党立场"},
    {"q":"\"这么大一个国家,责任非常重、工作非常艰巨。我将无我,不负人民。\"2019年3月22日,习近平总书记在国事访问期间的一番肺腑之言,感动了无数人。习近平总书记的讲话旨在说明(    )。","a":"A","F":"","E":"","D":"党的奋斗目标","C":"党的先进性","B":"党的最高理想","A":"党的宗旨"},
    {"q":"(    )是党一切工作的出发点和落脚点。","a":"B","F":"","E":"","D":"实现共同富裕","C":"实现中华民族伟大复兴","B":"让老百姓过上好日子","A":"实现共产主义"},
    {"q":"新时代中国共产党深刻把握推进共同富裕规律,提出\"要深入研究不同阶段的目标,分阶段促进共同富裕:到(    ),全体人民共同富裕取得更为明显的实质性进展,基本公共服务实现均等化\"。","a":"C","F":"","E":"","D":"本世纪中叶","C":"2035年","B":"中国共产党成立一百年","A":"'十四五'末"},
    {"q":"(    )是促进共同富裕的重点帮扶保障人群。","a":"B","F":"","E":"","D":"无劳动能力群体","C":"残障人士","B":"低收入群体","A":"中等收入群体"},
    {"q":"世界工会联合会总书记乔治·马瑞克斯说:\"我要说中国共产党的智慧和信仰,来自人民也服务于人民,中国共产党的经验、智慧和领导能力,是中国能够充满自信地实现和平发展的保障。\"这体现了(    )。","a":"A","F":"","E":"","D":"中国共产党没有自己的利益","C":"国家立场是中国共产党的根本立场","B":"中国共产党不讲亲情的原则和立场","A":"中国共产党的性质以及宗旨"},
    {"q":"适应我国社会主要矛盾的变化,更好满足人民日益增长的美好生活需要,必须把(    )作为为人民谋幸福的着力点,不断夯实党长期执政基础。","a":"D","F":"","E":"","D":"促进全体人民共同富裕","C":"实现社会主义现代化","B":"扎实推动乡村振兴","A":"全面建成小康社会"},
    {"q":"促进共同富裕,最艰巨最繁重的任务仍然在(    )。","a":"C","F":"","E":"","D":"老工业城市","C":"农村","B":"西部地区","A":"乡镇"},
    {"q":"全球治理体系变革要更好地反映国际格局的变化,更加平衡地反映大多数国家特别是新兴市场国家和()的意愿和利益。","a":"D","F":"","E":"","D":"发展中国家","C":"落后国家","B":"发达国家","A":"第三世界"},
    {"q":"中国积极参与全球治理体系改革和建设,践行()的全球治理观,坚持真正的多边主义,推进国际关系民主化,推动全球治理朝着更加公正合理的方向发展。","a":"C","F":"","E":"","D":"公平公正公开","C":"共商共建共享","B":"合作共赢","A":"多边主义"},
    {"q":"中国坚持在()基础上同各国发展友好合作,推动构建新型国际关系,深化拓展平等、开放、合作的全球伙伴关系,致力于扩大同各国利益的汇合点。","a":"D","F":"","E":"","D":"和平共处五项原则","C":"改革开放","B":"共商共建共享","A":"对外开放"},
    {"q":"当今世界正处于大发展、大变革、大调整时期,国际力量对比发生深刻变化,国际体系和国际秩序正面临深度调整。()在全球治理体系中的话语权提升。","a":"A","F":"","E":"","D":"新型市场国家","C":"超级大国","B":"\"一带一路\"沿线国家","A":"发展中国家"},
    {"q":"运筹好大国关系,我们要将中欧两大力量、两大市场、两大文明结合起来,共同打造中欧之间的()四大伙伴关系。","a":"D","F":"","E":"","D":"和平、增长、改革、文明","C":"和平、增长、改革、合作","B":"和平、合作、改革、文明","A":"和平、增长、开放、文明"},
    {"q":"运筹好大国关系,推动构建总体稳定、均衡发展的()框架至关重要。","a":"D","F":"","E":"","D":"大国关系","C":"稳定关系","B":"联盟关系","A":"合作关系"},
    {"q":"广大发展中国家是我国在国际事务中的天然同盟军,要秉持正确义利观和()理念,加强同发展中国家团结合作。","a":"B","F":"","E":"","D":"合作共赢","C":"开放繁荣","B":"真实亲诚","A":"公平合理"},
    {"q":"中国坚持()正确方向,推动贸易和投资自由化便利化,推进双边、区域和多边合作,促进国际宏观经济政策协调,共同营造有利于发展的国际环境。","a":"C","F":"","E":"","D":"全球一体化","C":"经济全球化","B":"单边主义","A":"大国合作化"},
    {"q":"进一步发展全球伙伴关系,要以()为重点,以发展中国家为基础,以多边为舞台,全面发展同各国友好合作,不断完善我国全方位、多层次、立体化的外交布局,努力开创中国特色大国外交新局面。","a":"C","F":"","E":"","D":"新型市场国家","C":"周边和大国","B":"不发达国家","A":"发达国家"},
    {"q":"当前,世界进入新的动荡变革期,百年变局与世纪疫情交织叠加,经济复苏步履维艰,()挑战更加突出,全球发展事业遭遇逆风逆流。","a":"C","F":"","E":"","D":"政治","C":"安全","B":"经济","A":"发展"},
    {"q":"要践行真正的多边主义,维护以()为核心的国际体系。","a":"B","F":"","E":"","D":"主权国家","C":"国家利益","B":"联合国","A":"国际法"},
    {"q":"要切实抓好周边外交工作,秉承()的周边外交理念,打造周边命运共同体。","a":"B","F":"","E":"","D":"合作共赢","C":"和平发展","B":"亲诚惠容","A":"稳定合作"},
    {"q":"构建()是世界各国人民前途所在。","a":"B","F":"","E":"","D":"新型国际关系","C":"新型国际秩序","B":"人类命运共同体","A":"新型国际文明"},
    {"q":"倡导以()为核心的新型国际关系正是寻求处理好国家间关系、保持国际社会稳定发展的\"中国方案\",充分彰显中国作为负责任大国的使命担当。","a":"D","F":"","E":"","D":"合作共赢","C":"和平发展","B":"相互尊重","A":"亲诚惠容"},
    {"q":"运筹好大国关系,我们要推进中俄()。","a":"B","F":"","E":"","D":"新时代全面战略同盟伙伴关系","C":"面向21世纪全面战略协作伙伴关系","B":"新时代全面战略协作伙伴关系","A":"面向21世纪全面战略同盟伙伴关系"},
    {"q":"中国坚定奉行()的和平外交政策,始终根据事情本身的是非曲直决定自己的立场和政策。","a":"D","F":"","E":"","D":"独立自主","C":"和平发展","B":"协商对话","A":"相互尊重"},
    {"q":"世界上的事情越来越需要各国共同商量着办,下列选项中,不属于多数国家的共识的是()。","a":"D","F":"","E":"","D":"打破国际惯例","C":"建立国际机制","B":"遵守国际规则","A":"追求国际正义"},
    {"q":"\"一国两制\"构想最早是针对(    )问题提出来的。","a":"C","F":"","E":"","D":"香港","C":"台湾","B":"南海","A":"澳门"},
    {"q":"在(    )方针指导之下,香港、澳门特别行政区享有的高度自治权受到充分保障,港澳同胞当家作主、依法享有广泛自由和民主权利。","a":"B","F":"","E":"","D":"高度自治","C":"\"港人治港\"\"澳人治澳\"","B":"\"一国两制\"","A":"寄希望于港澳人民"},
    {"q":"努力推进\"一国两制\"在香港、澳门的实践行稳致远,应该坚持\"一国\"原则与尊重\"两制\"差异相结合,维护中央权力与保障特别行政区自治权相结合,(     )与提高港澳自身竞争力相结合。","a":"A","F":"","E":"","D":"增强中国共产党的政治领导力","C":"维护党中央权威和集中统一领导","B":"加强中央管控力度","A":"发挥祖国内地坚强后盾作用"},
    {"q":"1949年以来两岸领导人的首次会面是(    )。","a":"D","F":"","E":"","D":"2015年11月7日,习近平与马英九会面","C":"2015年9月1日,习近平会见连战","B":"2018年7月13日,习近平会见连战","A":"2005年4月26日至5月3日,胡锦涛会见连战"},
    {"q":"\"一国两制\"伟大构想坚持从实际出发,照顾各方利益,既体现了实现祖国统一、维护国家主权的原则性,又充分考虑香港、澳门的历史和现实,体现了高度的(    )。","a":"A","F":"","E":"","D":"稳定性","C":"普适性","B":"集中性","A":"灵活性"},
    {"q":"维护和用好(    )是\"一国两制\"方针全面准确贯彻落实的根本保障。","a":"B","F":"","E":"","D":"\"港人治港\"\"澳人治澳\"方针政策","C":"高度自治权","B":"中央全面管治权","A":"宪法和基本法"},
    {"q":"2019年1月,习近平在(    )发表四十周年纪念会上发表题为《为实现民族伟大复兴推进祖国和平统一而共同奋斗》重要讲话,全面阐述了立足新时代,在民族复兴伟大征程中推进祖国统一进程的重大政策主张,集中体现了新时代党解决台湾问题总体方略的基本内涵。","a":"A","F":"","E":"","D":"《一个中国的原则与台湾问题》白皮书","C":"《台湾问题与中国的统一》","B":"《台湾问题与新时代中国统一事业》白皮书","A":"《告台湾同胞书》"},
    {"q":"(    )从国家层面建立健全了中央对香港全面管治权的法律制度和执行机制,是中央行使对香港全面管治权的一个具体体现,是\"一国两制\"事业的重要里程碑。","a":"D","F":"","E":"","D":"《中华人民共和国香港特别行政区维护国家安全法》","C":"《中华人民共和国香港特别行政区基本法》","B":"《反分裂国家法》","A":"《中华人民共和国宪法》"},
    {"q":"2021年7月1日,习近平总书记在庆祝中国共产党成立100周年大会上提及要全面准确贯彻\"一国两制\"、\"港人治港\"、\"澳人治澳\"、高度自治的方针,落实特别行政区维护国家安全的法律制度和(     ),维护国家主权、安全、发展利益,维护特别行政区社会大局稳定,保持香港、澳门长期繁荣稳定。","a":"B","F":"","E":"","D":"统筹规划","C":"具体条例","B":"执行机制","A":"监督机制"},
    {"q":"2022年7月1日,习近平总书记在庆祝香港回归祖国25周年大会暨香港特别行政区第六届政府就职典礼上的重要讲话中指出:\"'一国两制'是前无古人的伟大创举。'一国两制'的根本宗旨是(     )。\"","a":"B","F":"","E":"","D":"维护中国共产党的领导","C":"保持香港和澳门的独特地位和优势","B":"维护国家主权、安全、发展利益,保持香港、澳门长期繁荣稳定","A":"落实\"爱国者治港\"\"爱国者治澳\""},
    {"q":"只有深刻理解和准确把握\"一国两制\"的(    ),才能确保\"一国两制\"事业始终朝着正确的方向行稳致远。","a":"D","F":"","E":"","D":"实践规律","C":"执行标准","B":"目标方向","A":"深刻意蕴"},
    {"q":"在坚持\"九二共识\"、反对\"台独\"的共同政治基础上,两岸各政党、各界别推举代表性人士,就两岸关系和民族未来开展广泛深入的民主协商,就推动两岸关系和平发展达成(     )安排。","a":"C","F":"","E":"","D":"全局性","C":"制度性","B":"总体性","A":"计划性"},
    {"q":"(    )建设,是习近平总书记亲自谋划、亲自部署、亲自推动的重大国家战略。\"一个国家、两种制度、三个关税区、三种货币\"之下的区域建设,开世界未有之先例。","a":"B","F":"","E":"","D":"雄安新区","C":"浦东新区","B":"粤港澳大湾区","A":"长三角经济带"},
    {"q":"我国政府对香港、澳门恢复行使主权,就是恢复行使对香港、澳门的(    )。","a":"B","F":"","E":"","D":"监督权","C":"管辖权","B":"全面管治权","A":"立法权"},
    {"q":"中国政府主张\"一国两制\"和平统一台湾,但决不承诺放弃使用武力,保留采取一切必要措施的选项,这针对的是(    )。","a":"B","F":"","E":"","D":"台湾各个社会团体","C":"台湾民众","B":"外部势力干涉和极少数\"台独\"分裂分子及其分裂活动","A":"国民党"},
    {"q":"(    ),为新时代对台工作提供了根本遵循和行动指南。","a":"A","F":"","E":"","D":"\"一国两制\"","C":"\"九二共识\"","B":"和平统一方针","A":"新时代党解决台湾问题的总体方略"},
    {"q":"以(    )方式实现祖国统一,最符合包括台湾同胞在内的中华民族整体利益,最有利于中国的长期稳定发展,是中国共产党和中国政府解决台湾问题的第一选择。","a":"D","F":"","E":"","D":"和平","C":"中立","B":"武力","A":"协商"},
    {"q":"我们党(    ),一旦脱离群众,就会失去生命力。","a":"ABD","F":"","E":"","D":"植根人民","C":"领导人民","B":"服务人民","A":"来自人民"},
    {"q":"坚持以人民为中心的发展思想,就要在高质量发展中促进共同富裕,做到(    )。","a":"ACD","F":"","E":"","D":"发展依靠人民","C":"发展成果由人民共享","B":"发展成果平均分配","A":"发展为了人民"},
    {"q":"截至2021年11月底,我国现有行政村已全面实现\"村村通宽带\",贫困地区通信难等问题得到历史性解决,为全面推进乡村振兴、加快农业农村现代化提供坚实网络支撑。这说明(    )。","a":"AD","F":"","E":"","D":"这是我们党把共享作为发展的重要理念的结果","C":"我国已经达到了共同富裕的基本标准","B":"我国已经基本消除城乡差距","A":"全体人民朝着共同富裕方向稳步前进"},
    {"q":"党的十九届六中全会进一步明确,必须坚持以人民为中心的发展思想,发展全过程人民民主,推动(    )取得更为明显的实质性进展。","a":"AC","F":"","E":"","D":"社会主义现代化","C":"人的全面发展","B":"创新经济再上新台阶","A":"全体人民共同富裕"},
    {"q":"习近平总书记在省部级主要领导干部学习贯彻党的十九届六中全会精神专题研讨班开班式上强调,要用好\"我为群众办实事\"实践活动形成的良好机制,始终做到眼睛向下、脚步向下,要多上炕头、多下地头,着力解决好群众最关心、最直接、最现实的问题。这告诉我们,作为党的领导干部(    )。","a":"BC","F":"","E":"","D":"要始终将民族解放和人民幸福作为价值追求","C":"要始终把人民安居乐业、安危冷暖放在心上,用心用情用力解决群众关心的实际问题","B":"要践行全心全意为人民服务的根本宗旨","A":"要以提高组织运行效率作为工作的落脚点"},
    {"q":"促进人的全面发展与促进共同富裕相统一,(    )。","a":"ABC","F":"","E":"","D":"是中国共产党的最高理想","C":"是中国共产党人的奋斗目标","B":"是马克思主义的价值追求","A":"是社会主义的本质要求"},
    {"q":"马克思主义政党与资本主义政党区别在于,马克思主义政党(    )。","a":"ABC","F":"","E":"","D":"为了实现、维护和巩固政党的利益要求、政治意志","C":"经济基础为生产资料公有制","B":"始终同人民在一起,为人民利益而奋斗","A":"站在人民立场上,始终将最广大人民群众的根本利益作为自己的最高利益"},
    {"q":"回望上下五千年,(    )。","a":"ABCD","F":"","E":"","D":"博大精深的中华文明是中国人民创造的","C":"波澜壮阔的中华民族发展史是中国人民书写的","B":"历久弥新的中华民族精神是中国人民培育的","A":"中华民族迎来了从站起来、富起来到强起来的伟大飞跃是中国人民奋斗出来的"},
    {"q":"我们党发展壮大的一条重要经验,就是(    )。","a":"CD","F":"","E":"","D":"始终把政治智慧的增长、执政本领的增强深深扎根于人民的创造性实践中","C":"始终把群众作为智慧和力量的源泉","B":"始终同人民生死相依、休戚与共","A":"始终赢得人民信任、得到人民支持"},
    {"q":"\"江山就是人民、人民就是江山\"充分说明(    )。","a":"ABC","F":"","E":"","D":"赢得人民,就赢得了永久的胜利","C":"人民是中国共产党执政兴国的最大底气","B":"人民是我们党的生命之根、执政之基、力量之源","A":"我国国体政体的人民性"},
    {"q":"2021年是中国共产党成立100周年。自1921年建党以来,中国共产党团结带领全国各族人民,谱写了壮丽辉煌的历史篇章,中华民族迎来了从站起来、富起来到强起来的伟大飞跃,迎来了实现伟大复兴的光明前景。中国共产党取得如此伟大成就的原因在于(    )。","a":"AD","F":"","E":"","D":"始终坚持为中国人民谋幸福,为中华民族谋复兴","C":"始终坚持以中国特色社会主义理论体系为指导思想","B":"始终把成为超级大国作为最高目标","A":"始终坚持以人民为中心,立党为公、执政为民"},
    {"q":"党的十八大以来,以习近平同志为核心的党中央把握发展阶段新变化,把逐步实现全体人民共同富裕摆在更加重要的位置上,(    ),为促进共同富裕创造了良好条件。","a":"ABCD","F":"","E":"","D":"推动区域协调发展","C":"采取有力措施保障和改善民生","B":"打赢脱贫攻坚战","A":"全面建成小康社会"},
    {"q":"党的二十大报告提出,我们深入贯彻以人民为中心的发展思想,在幼有所育、学有所教、劳有所得、病有所医、老有所养、住有所居、弱有所扶上持续用力,人民生活全方位改善。这表明(    )。","a":"BCD","F":"","E":"","D":"人民对美好生活的向往就是党的奋斗目标","C":"党和政府坚持以人民为中心的发展思想","B":"发展的根本目的就是增进民生福祉","A":"我国已达到共同富裕标准"},
    {"q":"只有扎实推进共同富裕,党领导人民才能(    )。","a":"ACD","F":"","E":"","D":"切实防范与化解现代化进程中的重大风险","C":"有效保持政治稳定与社会安定","B":"坚持公有制经济的主体地位","A":"妥善处理好现代化进程中效率与公平、分化与整合、发展与稳定、开放与自主等重大关系"},
    {"q":"我们说的共同富裕(    )。","a":"BCD","F":"","E":"","D":"是人民群众物质生活和精神生活都富裕","C":"是全体人民共同富裕","B":"不是少数人的富裕,也不是整齐划一的平均主义","A":"是物质水平基本达到均等的富裕"},
    {"q":"群众路线的基本内容是(    )。","a":"ABCD","F":"","E":"","D":"从群众中来","C":"到群众中去","B":"一切为了群众","A":"一切依靠群众"},
    {"q":"为打通精准扶贫\"最后一公里\",中国累计选派25.5万个驻村工作队、300多万名第一书记和驻村干部,同近200万名乡镇干部和数百万名村干部一道奋战在扶贫一线。他们和贫困群众想在一起、干在一起,拧成一股绳、攒足一股劲,以行动兑现对人民的承诺。党员干部奋战脱贫攻坚主战场,(    )。","a":"BC","F":"","E":"","D":"完善了打赢脱贫攻坚战实现共同富裕的行政体制","C":"是坚持党的执政理念贯彻群众路线的内在要求","B":"体现了中国共产党人为人民谋幸福的初心","A":"旨在推进乡村治理体系的完善和治理能力现代化"},
    {"q":"扎实推动共同富裕应当把握的基本原则包括(    )。","a":"ABCD","F":"","E":"","D":"坚持循序渐进","C":"坚持基本经济制度","B":"尽力而为量力而行","A":"鼓励勤劳创新致富"},
    {"q":"习近平总书记强调指出,中国共产党的根基在人民、血脉在人民。党团结带领人民进行革命、建设、改革,根本目的就是让人民过上好日子,无论面临多大挑战和压力,无论付出多大牺牲和代价,这一点都始终不渝、毫不动摇。这表明中国共产党(    )。","a":"CD","F":"","E":"","D":"坚持依靠人民创造历史伟业","C":"坚持不忘初心、牢记使命","B":"坚持完善领导方式和执政方式","A":"坚持理论联系实际的优良作风"},
    {"q":"必须把权力关进制度的笼子里,依法(),让权力在阳光下运行。","a":"ABCD","F":"","E":"","D":"制约权力","C":"监督权力","B":"设定权力","A":"规范权力"},
    {"q":"坚持和加强党的全面领导,以调动全党()为着力点。","a":"ABC","F":"","E":"","D":"斗争性","C":"积极性","B":"主动性","A":"创造性"},
    {"q":"在坚持党中央权威和集中统一领导这个重大原则问题上,全党全国必须保持高度的(),丝毫不能动摇。","a":"ABC","F":"","E":"","D":"学习自觉","C":"行动自觉","B":"思想自觉","A":"政治自觉"},
    {"q":"只有党的政治建设抓好了,党的()把握住了,党的政治能力提高了,党的建设才能铸魂扎根。","a":"ABD","F":"","E":"","D":"政治方向","C":"政治模式","B":"政治大局","A":"政治立场"},
    {"q":"新形势下党面临的\"危险\"包括()。","a":"ABCD","F":"","E":"","D":"精神懈怠危险","C":"消极腐败危险","B":"能力不足危险","A":"脱离群众危险"},
    {"q":"\"全面从严治党\"的\"全面\"体现为()。","a":"ABD","F":"","E":"","D":"对象全覆盖","C":"权力全保障","B":"责任全担负","A":"领域全范围"},
    {"q":"加强和改进作风建设,持之以恒纠治\"四风\",措施包括()。","a":"ABCD","F":"","E":"","D":"严肃查处违反中央八项规定精神问题","C":"力戒形式主义和官僚主义作风","B":"健全作风建设长效机制","A":"严肃整治享乐主义和奢靡之风"},
    {"q":"党的十八大以来,以习近平同志为核心的党中央将全面从严治党纳入\"四个全面\"战略布局,把严的标准、严的措施贯穿管党治党全过程和各方面,为实现中华民族伟大复兴提供坚强()。","a":"AC","F":"","E":"","D":"政治制度","C":"政治引领","B":"政治方向","A":"政治保障"},
    {"q":"党的十九大以来,作风建设更加注重集中整治()问题。","a":"CD","F":"","E":"","D":"形式主义","C":"官僚主义","B":"奢靡之风","A":"享乐主义"},
    {"q":"构建人类命运共同体思想主张()的国家,在国际活动中目标一致、利益共生、权利共享、责任共担,从而促进人类社会整体发展。","a":"ABCD","F":"","E":"","D":"不同意识形态","C":"不同发展水平","B":"不同历史文化","A":"不同社会制度"},
    {"q":"运筹好大国关系,推动构建()的大国关系框架至关重要。","a":"AC","F":"","E":"","D":"均势发展","C":"均衡发展","B":"结盟合作","A":"总体稳定"},
    {"q":"中国共产党的根本宗旨就是全心全意为人民服务。","a":"A","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"扎实推动共同富裕,要加快完善社会主义市场经济体制,推动发展更平衡、更协调、更包容。","a":"A","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"阶级立场是中国共产党的根本政治立场,是马克思主义政党区别于其他政党的显著标志。","a":"B","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"进入新时代,我们走上了创造美好生活、逐步实现全体人民共同富裕的新征程,要分阶段促进共同富裕,不断促进人的全面发展,朝着实现全体人民共同富裕的目标稳步前进。","a":"A","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"农民是促进共同富裕的重点帮扶保障人群。","a":"B","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"共同富裕意味着消除贫富差距,实现平均分配。","a":"B","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"只有扎实推进共同富裕,党领导人民才能妥善处理好现代化进程中效率与公平、分化与整合、发展与稳定、开放与自主等重大关系,才能切实防范与化解现代化进程中的重大风险,才能有效保持政治稳定与社会安定。","a":"A","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"群众路线始终是党的生命线和根本工作路线,是我们党永葆青春活力和战斗力的重要传家宝。","a":"A","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"面对新时代的新形势新任务,必须把党治国理政的实践经验作为源头活水,推动党和国家事业不断向前发展。","a":"B","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"解决我国发展不平衡不充分的问题是实现共同富裕的根本目标。","a":"B","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"当前,我国发展不平衡不充分问题已经得到解决,城乡区域发展和收入分配基本持平。","a":"B","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"我们党发展壮大的一条重要经验,就是始终把党中央作为智慧和力量的源泉,始终把政治智慧的增长、执政本领的增强深深扎根于全党全军的创造性实践中。","a":"B","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"坚持以人民为中心的发展理念,就要求人民的主体地位,保障人民的各项利益,促进人的全面发展。","a":"B","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"共同富裕是社会主义的本质要求,是中国式现代化的重要特征,要坚持以人民为中心的发展思想,在高质量发展中促进共同富裕。","a":"A","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"让老百姓过上好日子是党一切工作的出发点和落脚点。","a":"A","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"人民是历史的创造者,是决定党和国家前途命运的根本力量。","a":"A","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"人的全面发展是中国特色社会主义的终极目标。","a":"B","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"各国要相互尊重、平等协商,坚决摒弃冷战思维和强权政治。","a":"A","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"当今世界,国际力量对比发生深刻变化,一批发达国家取得加速发展,国际影响力进一步增强,是近代以来国际力量对比中最具革命性的变化。","a":"B","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"当今世界正经历百年未有之大变局,这样的大变局不是一时一事、一域一国之变,是世界之变、时代之变、历史之变。","a":"A","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"当今世界,任何单边主义、极端利己主义都是根本行不通的,任何脱钩、断供、极限施压的行径都是根本行不通的,任何搞\"小圈子\"、以意识形态划线挑动对立对抗也都是根本行不通的。","a":"A","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"当前,世界百年变局和世纪疫情交织,单边主义、保护主义抬头,经济全球化遭遇逆流。","a":"A","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"推动中美关系健康稳定发展,不仅符合两国人民根本利益,而且是国际社会的共同期待。","a":"A","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"《中华人民共和国香港特别行政区维护国家安全法》的公布施行,有效地维护了国家安全,有效地防范、制止和惩治了与香港特别行政区有关的危害国家安全的犯罪,堵塞了香港特别行政区在维护国家安全方面存在的制度漏洞。","a":"A","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
  ];


  logWithTime("题库数量：" + tiku.length)


  //************************************* */
  alert(
    "FBI WARNING\n " +
    "1、推荐设备:Xiaomi、Redmi\n" +
    "2、仅支持推荐设备完美运行\n" +
    "3、兼容一部分其他手机(需添加‘信任文件’)\n" +
    "4、不支持任何平板设备运行此助手\n" +
    "5、使用非推荐设备所产生一切后果需自行承担")


  alert(
    "FBI WARNING\n " +
    "1、本助手只能在微信中运行\n" +
    "2、*建议0 : 背到都是自己的 , 不建议使用本助手\n" +
    "3、*建议1 : 200秒后提交\n" +
    "4、*警告 : 如有发现不听取 ‘建议1’ 者将在后续版本中加入强制十分钟限速\n" +
    "5、使用本助手所产生一切后果需自行承担")


  device.wakeUpIfNeeded();
  device.keepScreenOn();
  logWithTime("剩余电量" + device.getBattery())
  logWithTime("保持屏幕常亮")
  var url1 = ("www.baidu.com")
  alert(
    "正在使用： 4399 ")
  alert(
    "注意！ \n " +
    "\n" +
    "\n" +
    "完事前 ， 不要动 ! \n " +
    "\n" +
    "完事前 ， 不要动 ! \n " +
    "\n" +
    "完事前 ， 不要动 ! \n " +
    "\n" +
    "【看到 ‘开测!’ 后 建议 最小化 左上角 运行台】")

  alert(
    "注意！！！ \n " +
    "\n" +
    "\n" +
    "完事前 ， 不要动 ! \n " +
    "\n" +
    "如遇小助手中途卡住，不要手动点击！按音量上键后，重新运行即可！\n " +
    "\n" +
    "如遇小助手中途卡住，不要手动点击！按音量上键后，重新运行即可！\n " +
    "\n" +
    "如遇小助手中途卡住，不要手动点击！按音量上键后，重新运行即可！\n " +
    "\n")

  app.launchApp("微信")
  sleep(1000);
  unlock();
  id("grs").findOne().click();
  logWithTime("测一码")
  sleep(500)
  id("knx").className("android.widget.TextView").text("扫一扫").findOne().parent().click();
  logWithTime("正在测码");
  logWithTime("等待考试开始");
  //console.hide();
  className("android.view.View").depth("10").indexInParent(0).findOne();
  logWithTime("开 测 ！");

  //此次未收入题库数Y
  var X = 0;//计数器X
  var Y = 0;

  //此次未匹配答案数Z
  var x = 0;//计数器x
  var z = 0;//计数器z
  var Z = 0;


  //几种 正则表达式
  pattern = /[`~!@#$^&*()=|{},':;'“”,\\\[\]\.<>\/?~！@#￥…… & *（）——|{},【】'；：""'。，、？\s \d \多选题 \单选题 \判断题 ]/g;    //去标点符号，空格，数字，题型
  pattern1 = /[`~!@#$^&*()=|{},':;'“”,\\\[\]\.<>\/?~！@#￥…… & *（）——|{},【】'；：""'。，、？\s \多选题 \单选题 \判断题 a-z A-Z]/g;      //保留选项
  pattern2 = /[^A-Z]/g;                                                                                                        //只保留英文字母
  pattern3 = /[^\u4e00-\u9fa5]/g;                                                                                            //只保留汉字



  //获取题目 打印出来
  for (var n = 0; n >= 0; n++) {
    var timu = className("android.view.View").depth("12").indexInParent(n).findOne(1000);
    //log(timu);

    if (timu != null) {
      var arr = timu.children();
      var a = arr.length;
      //log(a);

      var q = timu.child(0);
      var Q_txt = q.text().replace(pattern, "");
      logWithTime(n + 1 + "、" + Q_txt);




      for (var k = 0; k < tiku.length; k++) {                          // 题库循环   -->   找题目
        var que = tiku[k].q;
        let que = que.replace(pattern, "");
        var daan = tiku[k].a;
        var daan_txt = String;
        var daan_txt1 = String;

        if (que == Q_txt) {
          X = 0;
          log("答案：" + daan);
          //log(daan.length)
          //log(daan[0])
          for (r = 0; r < daan.length; r++) {
            //获取ABCD
            for (var i = 1; i < a; i++) {

              var selection = timu.child(i)
              var selectioni = selection.child(1);
              //log(selectioni.text());
              var xuan = selectioni.text().replace(pattern1, "")
              var pan = selectioni.text().replace(pattern1, "")
              //log(xuan)

              if (daan[r] == "A") {
                daan_txt = tiku[k].A.replace(pattern1, "")
                log("A:" + daan_txt)
              } else if (daan[r] == "B") {
                daan_txt = tiku[k].B.replace(pattern1, "")
                log("B:" + daan_txt)
              } else if (daan[r] == "C") {
                daan_txt = tiku[k].C.replace(pattern1, "")
                log("C:" + daan_txt)
              } else if (daan[r] == "D") {
                daan_txt = tiku[k].D.replace(pattern1, "")
                log("D:" + daan_txt)
              } else if (daan[r] == "E") {
                daan_txt = tiku[k].E.replace(pattern1, "")
                log("E:" + daan_txt)
              } else if (daan[r] == "F") {
                daan_txt = tiku[k].F.replace(pattern1, "")
                log("F:" + daan_txt)
              } else if (daan == "正确" || daan == "对") {
                daan_txt = "正确";
                daan_txt1 = "对";
                if (xuan == daan_txt) {
                  log("判断:" + daan_txt)
                } else if (xuan == daan_txt1) {
                  log("判断:" + daan_txt1)
                }

              } else if (daan == "错误" || daan == "错") {
                daan_txt = "错误";
                daan_txt1 = "错";
                if (xuan == daan_txt) {
                  log("判断:" + daan_txt)
                } else if (xuan == daan_txt1) {
                  log("判断:" + daan_txt1)
                }

              } else {
                log("不知道")
              };


              if (xuan == daan_txt || pan == daan_txt1) {
                //log(xuan)
                selection.click()
                x = x + 1;
              } else {
                continue
              }

            }
            if (x == 0) {
              z = z + 1;
            } else {
              z = 0
            }

          }
          x = 0;

          if (z !== 0 && k < tiku.length - 1) {
            continue
          } else if (z !== 0 && k == tiku.length - 1) {
            Z = Z + 1;
            z = 0;
          } else if (z == 0) {
            break;
          }
          //另一种思路：
          //z = z / (daan.length) 
          //Z = Z + z


        } else {
          X = X + 1;
          if (X == tiku.length) {
            Y = Y + 1;
            X = 0;
          }
          continue
        }

      }








    } else {

      log("已获取全部题目");
      break;

    }




  }
  alert("完事！\n" +
    "此次未收入题库数：" + Y +
    "\n此次未匹配答案数：" + Z);

}

测码()
