"uii"
auto.waitFor();

var ls = storages.create("ls");

var depth = ls.get("路径")

console.show();

log(depth)


//显示当前时分秒
//function formatDate() {
//var year = d.getFullYear();
//var month = d.getMonth() + 1;
//var date = d.getDate();
//var hour = d.getHours();
//var day = d.getDay()
//var minute = d.getMinutes();
//var second = d.getSeconds();
//var millisecond = d.getMilliseconds();
//var 时间 = （ year + "-" + month + "-" + date + " " + hour + ":" + minute + ":" + second + ":" + millisecond）;
//}
//console.log(时间)
//

//显示当前时间
var d = new Date();
console.log(d)
//

//获取实时时间戳
function timestamp() {
    var d = new Date
    var hour = d.getHours();
    var minute = d.getMinutes();
    var second = d.getSeconds();
    var millisecond = d.getMilliseconds();
    var t = (hour + ":" + minute + ":" + second + ":" + millisecond);

    //return t
    console.log(t)
}
//

// 获取时分秒用于记录日志
function logWithTime(msg) {
    timestamp() + console.info(" " + msg);
}

const tiku = [

    {"q":"新时代坚持和发展中国特色社会主义，根本动力仍然是(  )。","a":"D","F":"","E":"","D":"全面深化改革","C":"科技创新","B":"对外开放","A":"深化合作"},
    {"q":"中国特色社会主义制度是一个严密完整的制度体系，起四梁八柱作用的是根本制度、基本制度、重要制度，其中具有统领地位的是(   )。","a":"A","F":"","E":"","D":"协商民主制度","C":"国家监察制度","B":"人民代表大会制度","A":"党的领导制度"},
    {"q":"党的二十大报告指出，我国成为(   )多个国家和地区的主要贸易伙伴。","a":"B","F":"","E":"","D":"150","C":"120","B":"140","A":"130"},
    {"q":"党的十八届三中全会作出了全面深化改革的决定，把(   )确定为全面深化改革的总目标。","a":"D","F":"","E":"","D":"完善和发展中国特色社会主义制度、推进国家治理体系和治理能力现代化","C":"完善和发展科学执政和民主执政水平、推进国家治理体系现代化","B":"完善和发展依法执政和民主执政水平、推进国家治理能力现代化","A":"完善和发展中国特色社会主义理论、推进国家治理能力现代化"},
    {"q":"我国社会主义实践后半程的主要历史任务是完善和发展中国特色社会主义制度，为党和国家事业发展、为人民幸福安康、为社会和谐稳定、为国家长治久安提供一整套(   )的制度体系。","a":"D","F":"","E":"","D":"更完备、更稳定、更管用","C":"更全面、更稳定、更先进","B":"更完备、更稳定、更先进","A":"更全面、更稳定、更管用"},
    {"q":"党坚持改革正确方向，以促进社会公平正义、(   )为出发点和落脚点。","a":"A","F":"","E":"","D":"生产力发展","C":"坚持党的集中统一领导","B":"生产方式变革","A":"增进人民福祉"},
    {"q":"(   )是保证全面深化改革乘风破浪、奋勇向前的指南针、定盘星和压舱石。","a":"B","F":"","E":"","D":"根本政治制度","C":"党的政治建设","B":"党的集中统一领导","A":"人民的实践创造"},
    {"q":"全面深化改革必须始终站稳人民立场，坚持(   )的改革价值取向。","a":"C","F":"","E":"","D":"以创新为引领","C":"以人民为中心","B":"以发展为中心","A":"以经济建设为中心"},
    {"q":"在全面深化改革中，要坚持以(    )为重点，发挥其牵引作用。","a":"B","F":"","E":"","D":"政治体制改革","C":"国家机构改革","B":"经济体制改革","A":"文化体制改革"},
    {"q":"推进国家治理体系和治理能力现代化，绝不是资本主义化。西方的治理体系和治理能力现代化以资本为中心，我国的治理体系和治理能力现代化以(   )为中心。","a":"C","F":"","E":"","D":"技术","C":"人民","B":"政党","A":"改革"},
    {"q":"习近平总书记指出:\"(    )是决定当代中国命运的关键一招，也是决定实现'两个一百年'奋斗目标、实现中华民族伟大复兴的关键一招。\"","a":"D","F":"","E":"","D":"改革开放","C":"全面建成小康社会","B":"深化改革","A":"实现社会主义现代化"},
    {"q":"党的十八届三中全会通过的《中共中央关于全面深化改革若干重大问题的决定》提出了\"六个紧紧围绕\"，以下说法不正确的是(   )。","a":"A","F":"","E":"","D":"紧紧围绕更好保障和改善民生、促进社会公平正义深化社会体制改革","C":"紧紧围绕建设美丽中国深化生态文明体制改革","B":"紧紧围绕使市场在资源配置中起决定性作用深化经济体制改革","A":"紧紧围绕坚持党的领导、人民当家作主、依法治国有机统一深化党的建设制度改革"},
    {"q":"(   )是当代中国发展进步的活力之源，是我们党和人民大踏步赶上时代前进步伐的重要法宝，是坚持和发展中国特色社会主义的必由之路。","a":"A","F":"","E":"","D":"对外开放","C":"改革创新","B":"开放合作","A":"改革开放"},
    {"q":"改革开放40多年来，我国经济一直保持中高速增长，在世界主要国家中名列前茅。近年来，我国对世界经济增长贡献率超过(   )。","a":"B","F":"","E":"","D":"15%","C":"20%","B":"30%","A":"40%"},
    {"q":"习近平总书记在(   )上发表主旨演讲时指出:\"世界经济的大海，你要还是不要，都在那儿，是回避不了的。想人为切断各国经济的资金流、技术流、产品流、产业流、人员流，让世界经济的大海退回到一个一个孤立的小湖泊、小河流，是不可能的，也是不符合历史潮流的。\"","a":"B","F":"","E":"","D":"第三届中国国际进口博览会开幕式","C":"第四届中国国际进口博览会开幕式","B":"世界经济论坛2017年年会开幕式","A":"博鳌亚洲论坛2018年年会开幕式"},
    {"q":"党的十八届三中全会通过了(   )。","a":"C","F":"","E":"","D":"《中共中央关于深化党和国家机构改革的决定》","C":"《中共中央关于全面深化改革若干重大问题的决定》","B":"《中共中央关于坚持和完善中国特色社会主义制度、推进国家治理体系和治理能力现代化若干重大问题的决定》","A":"《深化党和国家机构改革方案》"},
    {"q":"中央全面深化改革领导小组于(   )年更名为中央全面深化改革委员会。","a":"A","F":"","E":"","D":"2017","C":"2019","B":"2016","A":"2018"},
    {"q":"(   )是运用国家制度管理国家各方面事务的能力。","a":"B","F":"","E":"","D":"现代化建设能力","C":"执政能力","B":"国家治理能力","A":"政治执行力"},
    {"q":"(    )对坚持和完善中国特色社会主义制度、推进国家治理体系和治理能力现代化作出总体擘画。","a":"D","F":"","E":"","D":"党的十九届四中全会","C":"党的十八届四中全会","B":"党的十九届三中全会","A":"党的十八届三中全会"},
    {"q":"我国坚持(   )，推动共建\"一带一路\"高质量发展，推进一大批关系沿线国家经济发展、民生改善的合作项目，建设和平之路、繁荣之路、开放之路、绿色之路、创新之路、文明之路。","a":"A","F":"","E":"","D":"共建共享共荣","C":"共商共享共荣","B":"共商共建共荣","A":"共商共建共享"},
    {"q":"完善和发展中国特色社会主义制度、推进国家治理体系和治理能力现代化。后一句规定了(   )。","a":"A","F":"","E":"","D":"全面深化改革的根本方向","C":"在根本方向指引下完善和发展中国特色社会主义制度的鲜明指向","B":"全面深化改革的主要目的","A":"全面深化改革的出发点和落脚点"},
    {"q":"党的十八届三中全会开启了(   )。","a":"C","F":"","E":"","D":"中国特色社会主义新时代","C":"社会主义现代化建设历史新时期","B":"新发展阶段","A":"全面深化改革、系统整体设计推进改革的新时代"},
    {"q":"我国坚持对内对外开放相互促进、\"引进来\"和\"走出去\"更好结合，推动贸易和投资自由化便利化，构建面向全球的高标准自由贸易区网络，建设(   )和海南自由贸易港。","a":"A","F":"","E":"","D":"出口加工区","C":"转口贸易区","B":"保税港区","A":"自由贸易试验区"},
    {"q":"中国愿加大对全球发展合作的资源投入，致力于缩小(   )，坚定支持和帮助广大发展中国家加快发展。","a":"A","F":"","E":"","D":"科技差距","C":"东西差距","B":"劳动力差距","A":"南北差距"},
    {"q":"党的二十大报告提出，中国坚持对外开放的基本国策，坚定奉行(    )的开放战略，不断以中国新发展为世界提供新机遇，推动建设开放型世界经济，更好惠及各国人民。","a":"A","F":"","E":"","D":"多方合作","C":"互利互惠","B":"积极主动","A":"互利共赢"},
    {"q":"推进改革的目的是要不断推进我国社会主义制度自我完善和发展，赋予社会主义新的生机活力。这里面最核心的是(   )。","a":"B","F":"","E":"","D":"坚持和改善党的领导、坚持和完善中国特色社会主义理论体系","C":"坚持党的领导、坚持以马克思主义为指导","B":"坚持和改善党的领导、坚持和完善中国特色社会主义制度","A":"坚持党的领导、坚持中国特色社会主义道路"},
    {"q":"党的十九届四中全会提出完善和发展我国国家制度和国家治理体系的任务要求，以下说法错误的是(   )。","a":"C","F":"","E":"","D":"坚持和完善中国特色社会主义行政体制，构建职责明确、依法行政的政府治理体系","C":"坚持和完善人民代表大会制度，发展社会主义民主政治","B":"坚持和完善党的领导制度体系，提高党科学执政、民主执政、依法执政水平","A":"坚持和完善中国特色社会主义法治体系，提高党依法治国、依法执政能力"},
    {"q":"深化党和国家机构改革是对党和国家组织结构和管理体制的一次系统性、整体性重构。我们整体性(   )。","a":"C","F":"","E":"","D":"增强群团组织活力","C":"推进中央和地方各级各类机构改革","B":"增强党的领导力","A":"增强政府执行力"},
    {"q":"(    )是划时代的，实现改革由局部探索、破冰突围到系统集成、全面深化的转变，开创了我国改革开放新局面。","a":"A","F":"","E":"","D":"党的十九届四中全会","C":"党的十九届三中全会","B":"党的十八届四中全会","A":"党的十八届三中全会"},
    {"q":"自2017年以来，中国吸引外资连续四年位居世界(    )，对外投资流量稳居全球前三位。","a":"C","F":"","E":"","D":"第三","C":"第二","B":"第四","A":"第一"},
    {"q":"(   )这是一切敌人最惧怕我们的一点，也是保证我们党长期执政、国家长治久安的根本法宝。","a":"B","F":"","E":"","D":"民心所指，军旗所向","C":"党旗所指，民心所向","B":"党旗所指，军旗所向","A":"军旗所指，人民所向"},
    {"q":"习近平强军思想明确强国必须强军，(   )是新时代坚持和发展中国特色社会主义、实现中华民族伟大复兴的战略支撑。","a":"D","F":"","E":"","D":"巩固国防和强大人民军队","C":"研制现代化武器装备","B":"加强人民军队作风建设","A":"保障国家安全"},
    {"q":"(   )是我国战略威慑的核心力量，是我国大国地位的战略支撑，是维护国家安全的重要基石。","a":"C","F":"","E":"","D":"空军","C":"火箭军","B":"陆军","A":"海军"},
    {"q":"2020年，阿塞拜疆与亚美尼亚发生\"纳卡冲突\"，双方大范围使用无人机和反无人机作战，为打击对方提供高精度的目标位置信息和战斗毁伤评估信息。可以看出(   )成为战争制权争夺的核心，智能主导、自主驭能、以智谋胜将成为智能化战争的基本法则。","a":"C","F":"","E":"","D":"\"自主权\"","C":"\"制智权\"","B":"\"制胜权\"","A":"\"智能权\""},
    {"q":"随着世界进入新的动荡变革期，我国国家安全形势不稳定性不确定性增大，各方向各领域都面临不少安全挑战，坚持总体国家安全观，为建设社会主义现代化国家提供坚强保障，(   )始终是保底手段。","a":"D","F":"","E":"","D":"军事力量","C":"国防力量","B":"武装力量","A":"政治力量"},
    {"q":"依法治军、(   )是我们党建军治军的基本方略。","a":"B","F":"","E":"","D":"科技兴军","C":"改革强军","B":"从严治军","A":"从严治党"},
    {"q":"实现碳达峰碳中和是一场广泛而深刻的(    )系统性变革，要立足我国能源资源禀赋，坚持先立后破，有计划分步骤实施碳达峰行动。","a":"C","F":"","E":"","D":"文明社会","C":"经济社会","B":"生态社会","A":"政治社会"},
    {"q":"党的(   )把生态文明建设纳入中国特色社会主义现代化建设\"五位一体\"总体布局。","a":"D","F":"","E":"","D":"十八大","C":"二十大","B":"十九大","A":"十七大"},
    {"q":"人因自然而生，人与自然是一种(    )。生态环境没有替代品，用之不觉，失之难存。如果竭泽而渔，最后必然是什么鱼也没有了。","a":"B","F":"","E":"","D":"依存关系","C":"对立关系","B":"共生关系","A":"剥削关系"},
    {"q":"\"绿水青山\"既是自然财富、生态财富，又是(    )。","a":"A","F":"","E":"","D":"社会财富、世界财富","C":"人类财富、经济财富","B":"政治财富、共享财富","A":"社会财富、经济财富"},
    {"q":"实现(    )是我国向世界作出的庄严承诺，也是一场广泛而深刻的经济社会变革，绝不是轻轻松松就能实现的。","a":"A","F":"","E":"","D":"节能减排","C":"碳中和","B":"碳达峰","A":"碳达峰、碳中和"},
    {"q":"我们坚持绿水青山就是金山银山的理念，坚持(    )一体化保护和系统治理，全方位、全地域、全过程加强生态环境保护。","a":"A","F":"","E":"","D":"山水林田湖草","C":"绿水青山","B":"蓝天碧水净土","A":"山水林田湖草沙"},
    {"q":"积极参与和引领全球气候治理，要秉持(    )理念，以更加积极姿态参与全球气候谈判议程和国际规则制定，推动构建公平合理、合作共赢的全球气候治理体系。","a":"A","F":"","E":"","D":"生态文明建设","C":"人与自然生命共同体","B":"生态环境保护","A":"人类命运共同体"},
    {"q":"我国生态文明是以(    )为依循、以实现人与自然和谐共生的现代化为目标的文明新形态。","a":"C","F":"","E":"","D":"经济规律","C":"生态规律","B":"发展规律","A":"历史规律"},
    {"q":"人与(    )的关系是人类社会最基本的关系。","a":"B","F":"","E":"","D":"社会","C":"人","B":"自然","A":"群众"},
    {"q":"生态文明是人类社会进步的重大成果。人类经历了原始文明、农业文明、工业文明，(    )是工业文明发展到一定阶段的产物，是实现人与自然和谐发展的新要求。","a":"C","F":"","E":"","D":"自然文明","C":"生态文明","B":"海洋文明","A":"环保文明"},
    {"q":"面对全球环境治理前所未有的困难，国际社会要以前所未有的雄心和行动，勇于担当，勠力同心，共同构建(    )。","a":"A","F":"","E":"","D":"生态保护制度","C":"环境保护组织","B":"生态文明体系","A":"人与自然生命共同体"},
    {"q":"每年的(    )是世界动物日，世界动物日旨在号召人们保护动物、善待动物。对动物最好的保护，就是不去干扰它们的自由生活，不购买野生动物制品、不穿野兽皮毛服装。","a":"B","F":"","E":"","D":"11月4日","C":"9月4日","B":"10月4日","A":"12月4日"},
    {"q":"优化国土空间开发保护格局，建立以(    )为主体的自然保护地体系，持续开展大规模国土绿化行动，加强大江大河和重要湖泊湿地及海岸带生态保护和系统治理。","a":"C","F":"","E":"","D":"养土护田","C":"国家公园","B":"植树造林","A":"湿地公园"},
    {"q":"随着经济社会不断发展，我国已成为世界上最大的能源消费国，大量能源需要进口，要破解我国资源保障能力较弱对经济社会可持续发展的制约，必须着力开发利用(    )，提高资源利用效率。","a":"B","F":"","E":"","D":"石油资源","C":"非可再生能源","B":"清洁能源","A":"化石燃料"},
    {"q":"发展经济和保护生态环境都是为了(    )。","a":"C","F":"","E":"","D":"社会","C":"民生","B":"发展","A":"国家"},
    {"q":"随着我国社会主要矛盾转化为人民日益增长的美好生活需要和不平衡不充分的发展之间的矛盾，人民群众对优美生态环境需要已经成为这一矛盾的重要方面，广大人民群众热切期盼加快提高(    )质量。","a":"D","F":"","E":"","D":"生态环境","C":"精神生活","B":"物质生活","A":"经济发展"},
    {"q":"下列选项中不正确的是:(    )。","a":"A","F":"","E":"","D":"中国共产党是第一个把生态文明建设作为一个行动纲领的执政党","C":"我国是将绿色发展纳入\"一带一路\"合作规划和中非合作计划的引领者","B":"我国是全球气候变化谈判进程和《巴黎协定》签署、生效、实施的积极推动者","A":"我国能源基本实现自给自足，不需要依赖进口能源供给"},
    {"q":"推动经济社会发展绿色化、低碳化是实现(    )的关键环节。","a":"C","F":"","E":"","D":"生产力发展","C":"高质量发展","B":"节能环保发展","A":"高速度发展"},
    {"q":"生态环境是关系党的使命宗旨的重大(   )，也是关系民生的重大社会问题。","a":"A","F":"","E":"","D":"政策问题","C":"民生问题","B":"经济问题","A":"政治问题"},
    {"q":"党的十八大以来，党中央以前所未有的力度抓生态文明建设，全党全国推动绿色发展的自觉性和主动性显著增强，美丽中国建设迈出重大步伐，我国生态环境保护发生(   )变化。","a":"B","F":"","E":"","D":"全局性、根本性、制度性","C":"根本性、全局性、时代性","B":"历史性、转折性、全局性","A":"历史性、根本性、全局性"},
    {"q":"建设(    )是顺应人类文明进程、实现人与自然和谐共生的必然要求，具有历史必然性。","a":"D","F":"","E":"","D":"生态文明","C":"法治文明","B":"政治文明","A":"精神文明"},
    {"q":"下列积极参与气候变化等全球环境治理的意义中不正确的是(    )。","a":"D","F":"","E":"","D":"可以一劳永逸解决环境恶化问题","C":"可化解全球生态环境问题给中华民族永续发展带来的风险","B":"展现我国作为负责任发展中大国的担当和影响力","A":"能推动国际社会共同构建人与自然命运共同体"},
    {"q":"绿水青山的诱人景象及其(    )特征，不仅会成为当地人民的生态福祉，而且会使游客、人才和投资者偏爱有加，成为引来\"金凤凰\"的\"梧桐树\"和激活土地、劳动力、资产等要素的\"催化剂\"。","a":"A","F":"","E":"","D":"宜居宜工宜游","C":"宜农宜工宜商","B":"宜居宜业宜农","A":"宜居宜业宜游"},
    {"q":"只有实行最严格的制度、最严密的(    )，才能为生态文明建设提供可靠保障。","a":"B","F":"","E":"","D":"法制","C":"理论","B":"法治","A":"体制"},
    {"q":"改革开放以后，党日益重视生态环境保护。同时，(    )仍然是一个明显短板，资源环境约束趋紧、生态系统退化等问题越来越突出，特别是各类环境污染、生态破坏呈高发态势，成为国土之伤、民生之痛。","a":"A","F":"","E":"","D":"环境保护机制","C":"生态系统建设","B":"生态保护问题","A":"生态文明建设"},
    {"q":"党从思想、法律、体制、组织、作风上全面发力，全方位、全地域、全过程加强生态环境保护，推动划定生态保护(    )、环境质量底线、资源利用上线，开展一系列根本性、开创性、长远性工作。","a":"B","F":"","E":"","D":"机制","C":"下限","B":"红线","A":"方向"},
    {"q":"推动形成(    )是贯彻新发展理念的必然要求，必须把生态文明建设摆在全局工作的突出地位。","a":"D","F":"","E":"","D":"绿色发展方式和生活方式","C":"绿色生产方式和发展方式","B":"绿色生活方式","A":"绿色生活方式和出行方式"},
    {"q":"党的十八大以来，我们党深刻回答了为什么建设生态文明、建设什么样的生态文明、怎样建设生态文明的重大理论和实践问题，提出了一系列新理念新思想新战略，形成了(    )，成为习近平新时代中国特色社会主义思想的重要组成部分。","a":"D","F":"","E":"","D":"习近平生态文明思想","C":"习近平法治思想","B":"生态文明建设理论","A":"生态文明司法保护理论"},
    {"q":"生态文明建设是关系中华民族永续发展的(    )。","a":"D","F":"","E":"","D":"根本大计","C":"重要因素","B":"基本目标","A":"主要任务"},
    {"q":"2019年4月26日，习近平主席在第二届\"一带一路\"国际合作高峰论坛开幕式上发表题为《齐心开创共建\"一带一路\"美好未来》的主旨演讲，指出:\"我们要坚持开放、绿色、廉洁理念，把绿色作为底色，推动绿色基础设施建设、绿色投资、(    )，保护好我们赖以生存的共同家园。\"","a":"B","F":"","E":"","D":"绿色生产","C":"绿色产业","B":"绿色金融","A":"绿色发展"},
    {"q":"推动形成绿色发展方式和生活方式，是(    )的一场深刻革命。","a":"A","F":"","E":"","D":"上层建筑","C":"生产关系","B":"社会主义","A":"发展观"},
    {"q":"\"绿水青山就是金山银山\"的理念反映的是(    )辩证统一的关系。","a":"B","F":"","E":"","D":"生态环境与民生之间","C":"生态环境与人类文明之间","B":"生态环境保护和经济发展之间","A":"保护自然与社会发展之间"},
    {"q":"党的二十大报告提出，优化(   )，建立生育支持政策体系，降低生育、养育、教育成本。","a":"B","F":"","E":"","D":"生育鼓励政策","C":"人才队伍结构","B":"人口发展战略","A":"社会人口结构"},
    {"q":"党的二十大报告提出，实施积极应对(   )国家战略，发展养老事业和养老产业，优化孤寡老人服务，推动实现全体老年人享有基本养老服务。","a":"C","F":"","E":"","D":"人口长期发展","C":"人口老龄化","B":"人才强国","A":"延迟退休"},
    {"q":"党的十八大以来，党和国家组织结构实现系统性、整体性重构。我们重构性健全(   )。","a":"ABCD","F":"","E":"","D":"政府治理体系","C":"群团工作体系","B":"党的领导体系","A":"武装力量体系"},
    {"q":"2012年12月，习近平总书记在广东考察工作时深刻指出:\"我们的改革开放是(   )的。\"","a":"ABC","F":"","E":"","D":"有部署","C":"有原则","B":"有方向","A":"有立场"},
    {"q":"党的二十大报告提岀，稳步扩大(   )等制度型开放。","a":"ABCD","F":"","E":"","D":"标准","C":"规则","B":"管理","A":"规制"},
    {"q":"党的十八大以来，党和国家组织结构实现系统性、整体性重构。我们系统性增强(   )。","a":"ABCD","F":"","E":"","D":"党的领导力","C":"政府执行力","B":"群团组织活力","A":"武装力量战斗力"},
    {"q":"关于党的十九届四中全会通过的《中共中央关于坚持和完善中国特色社会主义制度、推进国家治理体系和治理能力现代化若干重大问题的决定》，以下说法正确的是(    )。","a":"ABCD","F":"","E":"","D":"系统总结了我国国家制度和国家治理体系的显著优势","C":"聚焦坚持和完善支撑中国特色社会主义制度的根本制度、基本制度、重要制度","B":"全面回答了在我国国家制度和国家治理体系上应该坚持和巩固什么、完善和发展什么这个重大政治问题","A":"明确了各项制度必须坚持和巩固的根本点、完善和发展的方向，为推动各方面制度更加成熟更加完善明确了时间表、路线图"},
    {"q":"改革开放是(   )。","a":"ABCD","F":"","E":"","D":"坚持和发展中国特色社会主义的必由之路","C":"决定当代中国命运的关键一招","B":"决定实现\"两个一百年\"奋斗目标、实现中华民族伟大复兴的关键一招","A":"我们党的一次伟大觉醒"},
    {"q":"党的二十大报告中强调要\"扩大面向全球的高标准自由贸易区网络\"，以下说法正确的是(   )。","a":"ACD","F":"","E":"","D":"扩大面向全球的高标准自由贸易区网络，是我国实行更高水平对外开放的战略举措","C":"扩大面向全球的高标准自由贸易区网络，是推动国际经贸治理体系改革完善的客观要求","B":"2021年1月1日，世界上人口最多、经贸规模最大、最具发展潜力的自由贸易区协定--《区域全面经济伙伴关系协定》生效","A":"扩大面向全球的高标准自由贸易区网络，是我国推动更深层次体制改革的重要动力"},
    {"q":"我国改革开放40多年取得了辉煌成就，以下说法正确的是(    )。","a":"ABCD","F":"","E":"","D":"政治稳定，人民民主不断扩大","C":"建成世界上最大的社会保障体系，全面建成小康社会","B":"文化自信不断增强，国家文化软实力大幅提升","A":"经济总量跃居世界第二，人民生活水平极大提高"},
    {"q":"中央全面深化改革委员会负责对改革的(   )。","a":"ABCD","F":"","E":"","D":"督促落实","C":"统筹协调","B":"整体推进","A":"总体设计"},
    {"q":"党推动改革(   )，从夯基垒台、立柱架梁到全面推进、积厚成势，再到系统集成、协同高效，各领域基础性制度框架基本确立，许多领域实现历史性变革、系统性重塑、整体性重构。","a":"ABCD","F":"","E":"","D":"纵深推进","C":"多点突破","B":"全面发力","A":"蹄疾步稳"},
    {"q":"《中共中央关于全面深化改革若干重大问题的决定》提出\"六个紧紧围绕\"，以下说法正确的是(   )。","a":"AD","F":"","E":"","D":"紧紧围绕更好保障和改善民生、促进社会公平正义深化社会体制改革","C":"紧紧围绕加强社会主义民主政治制度建设深化政治体制改革","B":"紧紧围绕人与自然和谐发展深化生态文明体制改革","A":"紧紧围绕使市场在资源配置中起决定性作用深化经济体制改革"},
    {"q":"党的十八大以来，我国坚持对内对外开放相互促进、\"引进来\"和\"走出去\"更好结合，构建(   )的开放型经济体系。","a":"BCD","F":"","E":"","D":"互利共赢","C":"安全高效","B":"多元平衡","A":"多边合作"},
    {"q":"全面深化改革，必须更加注重改革的(   )，善于打好改革\"组合拳\"。","a":"ABD","F":"","E":"","D":"整体性","C":"总体性","B":"协同性","A":"系统性"},
    {"q":"中央依据宪法和基本法对特别行政区拥有全面管治权，包括(    )。","a":"ABCD","F":"","E":"","D":"基本法解释权和修改权","C":"中央对特别行政区法律备案权","B":"行政长官和主要官员任命权","A":"中央政府向行政长官发出指令权"},
    {"q":"下列关于《中华人民共和国香港特别行政区维护国家安全法》的说法正确的有(    )。","a":"ACD","F":"","E":"","D":"是根据中华人民共和国宪法、中华人民共和国香港特别行政区基本法等法律制度制定的","C":"有力保持香港特别行政区的繁荣和稳定，保障香港特别行政区居民的合法权益","B":"是由香港特别行政区根据法定程序制定的维护国家安全立法","A":"全面准确贯彻了\"一国两制\"、\"港人治港\"、高度自治的方针"},
    {"q":"特别行政区享有高度自治权，但不能享有独立的(    )。","a":"CD","F":"","E":"","D":"外交权","C":"国防事务的管理权","B":"立法权","A":"行政管理权"},
    {"q":"党的十八大以来，国家安全得到全面加强，经受住了来自(    )等方面的风险挑战考验，为党和国家兴旺发达、长治久安提供了有力保证。","a":"ABCD","F":"","E":"","D":"自然界","C":"政治","B":"经济","A":"意识形态"},
    {"q":"要坚持(   )的新安全观，积极塑造外部安全环境，加强安全领域合作，引导国际社会共同维护国际安全。","a":"ABCD","F":"","E":"","D":"综合","C":"合作","B":"共同","A":"可持续"},
    {"q":"进入新时代，我国面临复杂多变的安全和发展环境，面临更为严峻的国家安全形势，以下说法正确的有(    )。","a":"ABCD","F":"","E":"","D":"各种可以预见和难以预见的风险因素明显增多","C":"传统安全威胁和非传统安全威胁相互交织","B":"各方面风险可能不断积累甚至集中显露","A":"国家安全内涵和外延比历史上任何时候都要丰富，时空领域比历史上任何时候都要宽广，内外因素比历史上任何时候都要复杂"},
    {"q":"要坚决反对一切分裂祖国的活动，严厉打击(   )这\"三股势力\"。","a":"ACD","F":"","E":"","D":"极端主义","C":"恐怖主义","B":"极权主义","A":"分裂主义"},
    {"q":"政治安全的核心是(   )。","a":"AC","F":"","E":"","D":"意识形态安全","C":"制度安全","B":"执政安全","A":"政权安全"},
    {"q":"总体国家安全观(    )。","a":"ACD","F":"","E":"","D":"是马克思主义国家安全理论中国化的最新成果","C":"是中国共产党和中国人民捍卫国家主权、安全、发展利益百年奋斗实践经验和集体智慧的结晶","B":"是我们党历史上第二个被确立为国家安全工作指导思想的重大战略思想","A":"强调国家安全要贯穿到党和国家工作全局各方面、各环节，绝非某一领域、单一部门的职责"},
    {"q":"必须坚持总体国家安全观，以人民安全为宗旨，以政治安全为根本，以经济安全为基础，以(    )安全为保障，以促进国际安全为依托，走出一条中国特色国家安全道路。","a":"ABCD","F":"","E":"","D":"社会","C":"军事","B":"科技","A":"文化"},
    {"q":"关于网络安全，以下说法正确的是(   )。","a":"ABCD","F":"","E":"","D":"维护网络安全，要依法加强网络空间治理","C":"维护网络安全，要切实维护国家网络空间主权安全，共同构建网络空间命运共同体","B":"维护网络安全，要加速推动信息领域核心技术突破","A":"网络安全已经成为我国面临的最复杂、最现实、最严峻的非传统安全问题之一"},
    {"q":"在强军目标下调整优化军事战略布局，要根据中国地缘战略环境、面临安全威胁和军队战略任务，构建(   )的战略部署和军事布势;应对太空、网络空间等新型安全领域威胁，维护共同安全;加强海外利益攸关区国际安全合作，维护海外利益安全。","a":"ABCD","F":"","E":"","D":"分区负责","C":"互为一体","B":"相互策应","A":"全局统筹"},
    {"q":"着力抓好军队党的政治建设，严肃政治纪律和政治规矩，确保部队(   )，确保枪杆子永远听党指挥。","a":"ACD","F":"","E":"","D":"绝对可靠","C":"绝对纯洁","B":"绝对先进","A":"绝对忠诚"},
    {"q":"党的二十大作出如期实现建军一百年奋斗目标的战略部署，蕴含着鲜明的(   )，最终要落到全面提高打赢能力上来。","a":"ABD","F":"","E":"","D":"实战指向","C":"军事指向","B":"政治指向","A":"战略指向"},
    {"q":"深入贯彻习近平强军思想，全面贯彻新时代军事教育方针，着眼加快推进(       )三位一体新型军事人才培养体系建设，健全与人力资源政策制度改革相契合的人才培养体系。","a":"ABC","F":"","E":"","D":"全民国防教育","C":"军事职业教育","B":"部队训练实践","A":"军队院校教育"},
    {"q":"坚定灵活开展军事斗争，始终从政治高度和国家利益全局筹划指导军事行动，在涉及国家主权和领土完整问题上(   )，特别是坚决粉碎\"台独\"分裂和外来干涉图谋，确保国家核心利益不受损，确保政治和战略主动。","a":"ABCD","F":"","E":"","D":"敢于斗争","C":"寸土必争","B":"善于斗争","A":"寸步不让"},
    {"q":"在重塑人民军队组织形态方面，按照\"(   )\"原则，强化军委集中统一领导和战略指挥、战略管理功能，打破长期实行的总部体制、大军区体制、大陆军体制，构建新的军队领导管理和作战指挥体制。","a":"ACD","F":"","E":"","D":"军种主建","C":"战区主战","B":"部队自建","A":"军委管总"},
    {"q":"必须扭住能打仗、打胜仗这个强军之要，强化(   )思想。按照打仗的要求搞建设、抓准备，坚持不懈拓展和深化军事斗争准备。锻造召之即来、来之能战、战之必胜的精兵劲旅。","a":"ABC","F":"","E":"","D":"备兵打仗","C":"当兵打仗","B":"练兵打仗","A":"带兵打仗"},
    {"q":"党对军队绝对领导的制度，包括(   )。","a":"ABCD","F":"","E":"","D":"军队的最高领导权和指挥权属于党中央和中央军委，军委实行主席负责制","C":"实行支部建在连上","B":"实行党委制、政治委员制、政治机关制","A":"实行党委统一的集体领导下的首长分工负责制"},
    {"q":"现代战争要求我们必须拓宽战略视野、更新战略思维，着力加强联合作战指挥体系和能力建设，构建(   )的战略战役指挥体系。","a":"ABCD","F":"","E":"","D":"专司主营","C":"常态运行","B":"精干高效","A":"平战一体"},
    {"q":"全军各级要坚决贯彻党中央和中央军委决策指示，准确把握国家安全和军事斗争形势变化，紧盯科技之变、战争之变、对手之变，大力推进(   )，全面推进军事训练转型升级，练就能战善战的精兵劲旅。","a":"ABD","F":"","E":"","D":"体系练兵","C":"战训转型","B":"科技练兵","A":"战训耦合"},
    {"q":"全军必须坚决落实党中央、中央军委和习主席决策部署，强化(    )，做到全部精力向打仗聚焦，全部工作向打仗用劲，完成党和人民赋予的新时代使命任务。","a":"ACD","F":"","E":"","D":"打仗意识","C":"危机意识","B":"学习意识","A":"忧患意识"},
    {"q":"随着我军军事训练进入全方位变革、整体性提升的新阶段，要求加快实现军事训练转型升级。必须坚持(   )，弘扬一不怕苦、二不怕死战斗精神，全面提高训练水平和打赢能力。","a":"ABCD","F":"","E":"","D":"依法治训","C":"科技强训","B":"联战联训","A":"实战实训"},
    {"q":"改革开放以后，人民军队(   )水平不断提高，国防实力日益增强，为国家改革发展稳定提供了可靠安全保障。","a":"ACD","F":"","E":"","D":"现代化","C":"革命化","B":"信息化","A":"正规化"},
    {"q":"习近平强军思想是全面推进新时代强军事业的科学指南，必须坚持不懈用以教育武装部队，培养有灵魂、有本事、有血性、有品德的新时代革命军人，锻造具有(    )的过硬部队。","a":"ABCD","F":"","E":"","D":"铁一般信仰","C":"铁一般纪律","B":"铁一般担当","A":"铁一般信念"},
    {"q":"世界新军事革命正加速推进，武器装备远程精确化、(   )趋势更加明显，战争形态加速向信息化战争演变，智能化战争初现端倪。","a":"ACD","F":"","E":"","D":"智能化","C":"无人化","B":"信息化","A":"隐身化"},
    {"q":"党对人民军队的绝对领导是(   )。","a":"ABCD","F":"","E":"","D":"人民军队的建军之本","C":"人民军队的强军之魂","B":"中国特色社会主义的本质特征","A":"党和国家的重要政治优势"},
    {"q":"党的十八届三中全会提出了全面深化改革总目标，并且围绕这个总目标，合理布局了全面深化改革的战略重点、优先顺序、主攻方向、工作机制、推进方式和时间表、路线图，形成了改革理论和政策的一系列新的重大突破。(    )","a":"A","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"全面深化改革总目标是一个有机整体，推进国家治理体系和治理能力现代化规定了全面深化改革的根本方向。(    )","a":"B","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"推进国家治理体系和治理能力现代化不等于资本主义化，因为西方的治理体系和治理能力现代化以资本为中心，我国的治理体系和治理能力现代化以人民为中心。(    )","a":"A","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"在扩大对外开放的同时，要加快建构起我国海外利益保护机制和风险预警防范体系，特别是要提升防范国际金融风险的能力。(    )","a":"A","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"我国对外开放不断向纵深发展，逐步形成从沿江到沿海、从内陆到沿边，多层次、多渠道、全方位开放的新格局。(    )","a":"B","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"整体运筹备战与止战、威慑与实战、战争行动与和平时期军事力量运用，统筹竞争、斗争、战争，统筹各方向各领域，塑造安全态势、遏控危机冲突、打赢全局战争。(   )","a":"B","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"加快构建新型军事训练体系，坚持以战领训、以训促战、战训一致，大抓信息化军事训练。(   )","a":"B","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"当兵就是要打仗，这就像工人要做工、农民要种田一样，打仗和准备打仗是军人的天职，也是军队使命职责之所在。(   )","a":"A","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"建军一百年奋斗目标，体现了党的历史使命、国家战略需求和我军使命任务的有机统一，丰富拓展了党在新时代强军目标的时代内涵，标定了未来10年我军建设的中心任务，意义重大而深远。(   )","a":"B","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"党的十八大以来，党中央和中央军委狠抓全面从严治军，果断决策整肃人民军队政治纲纪，在延安召开全军政治工作会议，对新时代政治建军作出部署。(   )","a":"B","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"创新军事战略和作战指导，要大兴作战问题研究之风，认真研究总结世界近几场局部战争和我军军事斗争实践经验，加强核心作战概念和作战理论研究，创新作战方式和军事力量运用方式，丰富斗争策略和方法，夺取未来战场主动权。(   )","a":"A","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"既要绿水青山，也要金山银山;绿水青山就是金山银山。绿水青山既是自然财富，又是社会财富、经济财富。(   )","a":"A","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"习近平总书记在党的二十大报告中指出:\"全面实行排污许可制，健全现代环境治理体系。\"这进一步指明了推动生态环境治理体系和治理能力现代化的方向。(    )","a":"A","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"\"民之所好好之，民之所恶恶之。\"积极回应人民群众所想、所盼、所急，不断满足人民群众日益增长的优美生态环境需要是新时代中国共产党不忘初心、牢记使命的自觉担当。(   )","a":"A","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"现在，随着我国社会主要矛盾转化为人民日益增长的物质财富需要和不平衡不充分的发展之间的矛盾，人民群众对优美生态环境需要已经成为这一矛盾的重要方面。(   )","a":"B","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"保护生态环境已成为全球共识，但把生态文明建设作为一个执政党的行动纲领，中国共产党是第一个。(   )","a":"A","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"只有实行最严格的制度、最严密的法治，才能为生态文明建设提供可靠保障。(   )","a":"A","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"立足我国能源资源禀赋，坚持先破后立，有计划分步骤实施碳达峰行动。(   )","a":"B","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"人类对大自然的伤害最终会伤及人类自身，这是无法抗拒的规律。(   )","a":"A","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"党的十八大以来，我国全面加强生态文明建设，决心之大、力度之大、成效之大前所未有。(   )","a":"A","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"加快发展方式绿色转型，要发展绿色低碳产业，健全资源环境要素市场化配置体系，加快节能降碳先进技术研发和推广应用。(   )","a":"A","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"在整个建设过程中，我们不是只讲索取不讲投入，不是只讲发展不讲保护，不是只讲利用不讲修复，而是像保护眼睛一样保护生态环境，还自然以宁静、和谐、美丽，追求人与自然和谐共生。(   )","a":"A","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"我国积极参与全球环境与气候治理，作出力争2040年前实现碳达峰、2060年前实现碳中和的庄严承诺，体现了负责任大国的担当。(   )","a":"B","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"过去一段时期，我国生态退化比较严重，致使我国经济社会发展的环境承载力下降。要破解这一短板问题，必须加快构建生态功能保障基线，提升生态系统质量和稳定性。(   )","a":"A","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"我国目前仍处于并将长期处于社会主义初级阶段。改善民生不能脱离这个最大实际提出过高目标。(   )","a":"A","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"2017年，党的十九大把精准脱贫作为三大攻坚战之一进行全面部署。(   )","a":"A","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"就业是经济的\"晴雨表\"，是社会的\"稳定器\"。(   )","a":"A","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"我国已经历史性地解决绝对贫困问题、如期全面建成小康社会，\"全部消灭贫穷\"的历史任务已经完成。(   )","a":"B","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"心理健康和精神卫生是公共卫生的重要组成部分，也是重大的民生问题和突出的社会问题。(   )","a":"A","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},
    {"q":"安全规范，就是要统筹和平和安全，加强社会保障基金规范管理，守住社会保障基金安全底线。(   )","a":"B","F":"","E":"","D":"","C":"","B":"错误","A":"正确"},


];


logWithTime("题库数量：" + tiku.length)



//此次未收入题库数Y
var X = 0;//计数器X
var Y = 0;

//此次未匹配答案数Z
var x = 0;//计数器x
var z = 0;//计数器z
var Z = 0;


//几种 正则表达式
pattern = /[`~!@#$^&*()=|{},':;'“”,\\\[\]\.<>\/?~！@#￥…… & *（）——|{},【】'；：""'。，、？\s \d \多选题 \单选题 \判断题 ]/g;    //去标点符号，空格，数字，题型
pattern1 = /[`~!@#$^&*()=|{},':;'“”,\\\[\]\.<>\/?~！@#￥…… & *（）——|{},【】'；：""'。，、？\s \多选题 \单选题 \判断题 a-z A-Z]/g;      //保留选项
pattern2 = /[^A-Z]/g;                                                                                                        //只保留英文字母
pattern3 = /[^\u4e00-\u9fa5]/g;                                                                                            //只保留汉字



//获取题目 打印出来
for (var n = 0; n >= 0; n++) {
    var timu = className("android.view.View").depth(depth).indexInParent(n).findOne(1000);
    //log(timu);

    if (timu != null) {
        var arr = timu.children();
        var a = arr.length;
        //log(a);

        var q = timu.child(0).child(timu.child(0).children().length - 1);//这里后面的child(1)有时候会变
        var Q_txt = q.text().replace(pattern, "");
        logWithTime(n + 1 + "、" + Q_txt);




        for (var k = 0; k < tiku.length; k++) {                          // 题库循环   -->   找题目
            var que = tiku[k].q;
            let que = que.replace(pattern, "");
            var daan = tiku[k].a;
            var daan_txt = String;
            var daan_txt1 = String;

            if (que == Q_txt) {
                X = 0;
                log("答案：" + daan);
                //log(daan.length)
                //log(daan[0])
                for (r = 0; r < daan.length; r++) {
                    //获取ABCD
                    for (var i = 1; i < a; i++) {

                        var selection = timu.child(i)
                        var selectioni = selection.child(1);
                        //log(selectioni.text());
                        var xuan = selectioni.text().replace(pattern1, "")
                        var pan = selectioni.text().replace(pattern1, "")
                        //log(xuan)

                        if (daan[r] == "A") {
                            daan_txt = tiku[k].A.replace(pattern1, "")
                            log("A:" + daan_txt)
                        } else if (daan[r] == "B") {
                            daan_txt = tiku[k].B.replace(pattern1, "")
                            log("B:" + daan_txt)
                        } else if (daan[r] == "C") {
                            daan_txt = tiku[k].C.replace(pattern1, "")
                            log("C:" + daan_txt)
                        } else if (daan[r] == "D") {
                            daan_txt = tiku[k].D.replace(pattern1, "")
                            log("D:" + daan_txt)
                        } else if (daan[r] == "E") {
                            daan_txt = tiku[k].E.replace(pattern1, "")
                            log("E:" + daan_txt)
                        } else if (daan[r] == "F") {
                            daan_txt = tiku[k].F.replace(pattern1, "")
                            log("F:" + daan_txt)
                        } else if (daan == "正确" || daan == "对") {
                            daan_txt = "正确";
                            daan_txt1 = "对";
                            if (xuan == daan_txt) {
                                log("判断:" + daan_txt)
                            } else if (xuan == daan_txt1) {
                                log("判断:" + daan_txt1)
                            }

                        } else if (daan == "错误" || daan == "错") {
                            daan_txt = "错误";
                            daan_txt1 = "错";
                            if (xuan == daan_txt) {
                                log("判断:" + daan_txt)
                            } else if (xuan == daan_txt1) {
                                log("判断:" + daan_txt1)
                            }

                        } else {
                            log("不知道")
                        };


                        if (xuan == daan_txt || pan == daan_txt1) {
                            //log(xuan)
                            selection.click()
                            x = x + 1;
                        } else {
                            continue
                        }

                    }
                    if (x == 0) {
                        z = z + 1;
                    } else {
                        z = 0
                    }

                }
                x = 0;

                if (z !== 0 && k < tiku.length - 1) {
                    continue
                } else if (z !== 0 && k == tiku.length - 1) {
                    Z = Z + 1;
                    z = 0;
                } else if (z == 0) {
                    break;
                }
                //另一种思路：
                //z = z / (daan.length) 
                //Z = Z + z


            } else {
                X = X + 1;
                if (X == tiku.length) {
                    Y = Y + 1;
                    X = 0;
                }
                continue
            }

        }








    } else {

        log("已获取全部题目");
        break;

    }




}
alert("完事！\n" +
    "此次未收入题库数：" + Y +
    "\n此次未匹配答案数：" + Z);
