"ui"
auto.waitFor();

var ls = storages.create("ls");

var depth = ls.get("路径")

console.show();

log(depth)


//显示当前时分秒
//function formatDate() {
//var year = d.getFullYear();
//var month = d.getMonth() + 1;
//var date = d.getDate();
//var hour = d.getHours();
//var day = d.getDay()
//var minute = d.getMinutes();
//var second = d.getSeconds();
//var millisecond = d.getMilliseconds();
//var 时间 = （ year + "-" + month + "-" + date + " " + hour + ":" + minute + ":" + second + ":" + millisecond）;
//}
//console.log(时间)
//

//显示当前时间
var d = new Date();
console.log(d)
//

//获取实时时间戳
function timestamp() {
    var d = new Date
    var hour = d.getHours();
    var minute = d.getMinutes();
    var second = d.getSeconds();
    var millisecond = d.getMilliseconds();
    var t = (hour + ":" + minute + ":" + second + ":" + millisecond);

    //return t
    console.log(t)
}
//

// 获取时分秒用于记录日志
function logWithTime(msg) {
    timestamp() + console.info(" " + msg);
}

const tiku = [

    { "q": "贯彻开放发展理念,建设(    )、安全高效的全面开放体系,才能更好提高现代化经济体系的国际竞争力。", "a": "C", "F": "", "E": "", "D": "互利共赢", "C": "多元平衡", "B": "协调创新", "A": "自由平等" },
    { "q": "维持出口高增长、出口占国内生产总值的高比例已不大可能,必须把经济增长动力更多放在创新驱动和扩大内需特别是(    )上。", "a": "B", "F": "", "E": "", "D": "技术研发", "C": "增加出口", "B": "消费需求", "A": "转型升级" },
    { "q": "立足新发展阶段明确了我国发展的历史方位,构建新发展格局明确了我国经济现代化的(    )。", "a": "C", "F": "", "E": "", "D": "行动指南", "C": "路径选择", "B": "基本方针", "A": "根本任务" },
    { "q": "我国发展处于重要战略机遇期,下列选项中不属于我国经济方面五个新机遇的是(    )。", "a": "C", "F": "", "E": "", "D": "加快绿色发展带来新机遇", "C": "加入国际大循环带来新机遇", "B": "加快经济结构优化升级带来新机遇", "A": "提升科技创新能力带来新机遇" },
    { "q": "改革开放以来,特别是加入世界贸易组织后,我国加入国际大循环,市场和资源\"两头在外\",形成(    )发展模式,对我国快速提升经济实力、改善人民生活发挥了重要作用。", "a": "B", "F": "", "E": "", "D": "经济结构倾斜型", "C": "\"统一市场\"", "B": "\"世界工厂\"", "A": "粗放型" },
    { "q": "(    ),这既是我们党领导现代化建设的出发点和落脚点,也是新发展理念的\"根\"和\"魂\"。", "a": "B", "F": "", "E": "", "D": "大力发展生产力", "C": "坚持实事求是、稳中求进", "B": "为人民谋幸福、为民族谋复兴", "A": "促进人的全面发展" },
    { "q": "正确认识党和人民事业所处的历史方位和发展阶段,是我们党明确阶段性中心任务、制定路线方针政策的(    ),也是我们党领导革命、建设、改革不断取得胜利的重要经验。", "a": "B", "F": "", "E": "", "D": "行动指南", "C": "根本保证", "B": "根本依据", "A": "重要前提" },
    { "q": "推动高质量发展是我国经济发展的(    )。", "a": "A", "F": "", "E": "", "D": "指导原则", "C": "路径选择", "B": "根本保证", "A": "鲜明主题" },
    { "q": "(    )是国之重器、国之利器,必须牢牢掌握在自己手上,必须依靠自力更生、自主创新。", "a": "A", "F": "", "E": "", "D": "产业资本", "C": "科学实验室", "B": "重工业产业", "A": "重大科技创新成果" },
    { "q": "国内循环与国际循环相互促进、相得益彰,(    )统筹协调、有效协同,新发展格局正为高质量发展注入新的强大动力。", "a": "B", "F": "", "E": "", "D": "增强内需与扩大出口", "C": "加强需求侧管理与扩大消费", "B": "供给侧改革与需求侧管理", "A": "扩大内需战略与供给侧改革" },
    { "q": "关于畅通国内大循环,下列说法错误的是(    )。", "a": "B", "F": "", "E": "", "D": "贯通生产、分配、流通、消费各环节", "C": "促进国民经济良性循环", "B": "形成供给牵引需求、需求创造供给的更高水平动态平衡", "A": "依托强大国内市场" },
    { "q": "关于新常态下我国经济发展的主要特点,以下说法错误的是(   )。", "a": "D", "F": "", "E": "", "D": "增长速度从中高速增长转向高速增长", "C": "发展方式从规模速度型转向质量效率型", "B": "发展动力从主要依靠资源和低成本劳动力等要素投入转向创新驱动", "A": "经济结构从增量扩能为主转向调整存量、做优增量并举" },
    { "q": "(   )为国家建设、国防安全、人民生活改善作出了突出贡献。", "a": "C", "F": "", "E": "", "D": "私有制经济", "C": "公有制经济", "B": "个体经济", "A": "集体经济" },
    { "q": "构建以国内大循环为主体、国内国际双循环相互促进的新发展格局,是根据我国(    )、环境、条件变化,特别是基于我国比较优势变化,审时度势作出的重大决策。", "a": "A", "F": "", "E": "", "D": "经济状况", "C": "生态发展", "B": "科技发展", "A": "发展阶段" },
    { "q": "2018年,党中央进一步提出深化供给侧结构性改革的\"巩固、增强、提升、(    )\"八字方针。", "a": "B", "F": "", "E": "", "D": "深化", "C": "全面", "B": "畅通", "A": "准确" },
    { "q": "当前和今后一个时期,我国经济发展面临的问题,供给和需求两侧都有,矛盾的主要方面在(    )。", "a": "C", "F": "", "E": "", "D": "需求侧", "C": "供给侧", "B": "供需平衡", "A": "供给和需求两侧" },
    { "q": "完善社会主义市场经济体制核心问题是处理好(    )的关系。", "a": "D", "F": "", "E": "", "D": "政府和市场", "C": "国家和企业", "B": "政府和企业", "A": "国家和市场" },
    { "q": "经济发展是一个(    )的过程,量积累到一定阶段,必须转向质的提升。", "a": "A", "F": "", "E": "", "D": "直线式上升", "C": "回旋式上升", "B": "波动式上升", "A": "螺旋式上升" },
    { "q": "改革开放以来,我们遭遇过很多外部风险冲击,最终都能化险为夷,靠的就是办好自己的事、把发展立足点放在(    )。", "a": "D", "F": "", "E": "", "D": "国内", "C": "国际", "B": "发达国家", "A": "发展中国家" },
    { "q": "加快建设全国统一大市场,其主要目标不包括(   )。", "a": "A", "F": "", "E": "", "D": "促进科技创新和产业升级", "C": "加快营造稳定公平透明可预期的营商环境", "B": "持续推动国内市场高效畅通和规模拓展", "A": "培育参与国内竞争新优势" },
    { "q": "党的十九届四中全会第一次从(    )、分配制度、资源配置方式等方面阐述了我国基本经济制度的内涵,把我们党对社会主义基本经济制度的认识提高到一个新境界。", "a": "D", "F": "", "E": "", "D": "所有制结构", "C": "发展模式", "B": "经济特点", "A": "生产力水平" },
    { "q": "下列选项不属于新常态下我国经济发展大势\"四个没有变\"的是(    )。", "a": "D", "F": "", "E": "", "D": "经济发展平稳的基本面没有变", "C": "经济韧性好、潜力足、回旋余地大的基本特质没有变", "B": "经济结构调整优化的前进态势没有变", "A": "经济持续增长的良好支撑基础和条件没有变" },
    { "q": "2021年12月8日,习近平总书记指出\"要发挥(    )的功能和作用。要处理好效率和公平关系,构建初次分配、再分配、三次分配协调配套的基础性制度安排。\"", "a": "A", "F": "", "E": "", "D": "流通", "C": "消费", "B": "生产", "A": "分配" },
    { "q": "我国经济已由高速增长阶段转向高质量发展阶段,正处在转变发展方式、优化经济结构、(    )的攻关期,建设现代化经济体系是跨越关口的迫切要求和我国发展的战略目标。", "a": "B", "F": "", "E": "", "D": "细化主攻领域", "C": "巩固经济地位", "B": "转换增长动力", "A": "优化发展模式" },
    { "q": "习近平总书记指出:\"发展必须是科学发展,必须坚定不移贯彻(    )的发展理念。\"", "a": "A", "F": "", "E": "", "D": "创新、协调、绿色、开放、普惠", "C": "创新、协调、绿色、合作、共享", "B": "创新、发展、绿色、开放、共享", "A": "创新、协调、绿色、开放、共享" },
    { "q": "(    )是社会主义市场经济发展的重要成果,也是我们党长期执政、团结带领全国人民实现\"两个一百年\"奋斗目标和中华民族伟大复兴中国梦的重要力量。", "a": "D", "F": "", "E": "", "D": "民营经济", "C": "实体经济", "B": "国有企业", "A": "公有制经济" },
    { "q": "我国进入新发展阶段的基本依据不包括(    )。", "a": "A", "F": "", "E": "", "D": "新发展阶段是党带领人民迎来从站起来、富起来到强起来历史性跨越的新阶段", "C": "我们已经拥有开启新征程、实现新的更高目标的雄厚物质基础", "B": "马克思主义坚信人类社会必然走向共产主义,但实现这一崇高目标必然经历若干历史阶段", "A": "我国社会主要矛盾已经转化" },
    { "q": "党的十八届五中全会鲜明提出了五大发展理念。五大发展理念中,(    )注重解决社会公平正义问题。", "a": "B", "F": "", "E": "", "D": "开放", "C": "协调", "B": "共享", "A": "创新" },
    { "q": "关于习近平经济思想基本内容的十三个方面,以下说法错误的是(   )。", "a": "C", "F": "", "E": "", "D": "明确坚持和完善社会主义基本经济制度是我国经济发展的制度基础", "C": "明确坚持目标导向部署实施国家重大发展战略是我国经济发展的重要保障", "B": "明确大力发展制造业和实体经济是我国经济发展的主要着力点", "A": "明确坚定不移全面扩大开放是我国经济发展的重要法宝" },
    { "q": "2018年4月,在十九届中央国家安全委员会第一次会议上,习近平总书记进一步阐述了总体国家安全观,(   )。", "a": "A", "F": "", "E": "", "D": "系统总结新时代维护国家安全取得的重大成就和宝贵经验", "C": "提出\"十个坚持\"的工作要求", "B": "将\"坚持总体国家安全观\"写入党章", "A": "提出坚持人民安全、政治安全、国家利益至上的有机统一等重大判断" },
    { "q": "总体国家安全观具有重大而深远的意义,其理论意义是(   )。", "a": "B", "F": "", "E": "", "D": "总体国家安全观为坚持把马克思主义基本原理同中国具体实际相结合、同中华优秀传统文化相结合树立了光辉典范", "C": "总体国家安全观经过实践检验、富有实践伟力,为维护和塑造新时代国家安全提供了行动纲领", "B": "总体国家安全观深化了我们党对中国特色社会主义建设规律的认识,为发展马克思主义国家安全理论作出了重大原创性贡献", "A": "总体国家安全观开辟了国家安全治理新路径,为推动和完善全球安全治理贡献了中国方案" },
    { "q": "在(   )上,习近平总书记首次提出\"坚持总体国家安全观\",强调走中国特色国家安全道路。", "a": "A", "F": "", "E": "", "D": "党的十八届五中全会", "C": "党的十九届五中全会", "B": "党的十九大", "A": "中央国家安全委员会第一次会议" },
    { "q": "要提高(   ),透过复杂现象把握本质,抓住要害、找准原因,果断决策,引导群众、组织群众,整合各方力量、科学排兵布阵,有效予以处理。", "a": "D", "F": "", "E": "", "D": "风险化解能力", "C": "研判风险能力", "B": "预判风险能力", "A": "识别风险能力" },
    { "q": "(   )与人民群众切身利益关系最密切,是人民群众安全感的晴雨表,是社会安定的风向标。", "a": "B", "F": "", "E": "", "D": "经济安全", "C": "生物安全", "B": "社会安全", "A": "网络安全" },
    { "q": "健全开放安全保障体系,是\"中国开放的大门越开越大\"的(   )。", "a": "C", "F": "", "E": "", "D": "根本条件", "C": "重要保证", "B": "基础", "A": "目的" },
    { "q": "关于中国特色国家安全道路的重要特征,以下说法错误的是(   )。", "a": "D", "F": "", "E": "", "D": "坚持党的绝对领导,完善集中统一、高效权威的国家安全工作体制,实现人民安全、国土安全、国家利益至上相统一", "C": "坚持安全发展,推动高质量发展和高水平安全动态平衡", "B": "坚持走和平发展道路,促进自身安全和共同安全相协调", "A": "坚持捍卫国家主权和领土完整,维护边疆、边境、周边安定有序" },
    { "q": "发展和安全是一体之两翼、驱动之双轮。发展是安全的(   )。", "a": "A", "F": "", "E": "", "D": "目的和保障", "C": "条件和保障", "B": "基础和条件", "A": "基础和目的" },
    { "q": "(   )涉及国家主权、政权、制度和意识形态的稳固,是一个国家最根本的需求,是一切国家生存和发展的基础条件。", "a": "B", "F": "", "E": "", "D": "国土安全", "C": "经济安全", "B": "政治安全", "A": "军事安全" },
    { "q": "(   )涉及国家主权、政权、制度和意识形态的稳固,是一个国家最根本的需求,是一切国家生存和发展的基础条件。", "a": "D", "F": "", "E": "", "D": "国土安全", "C": "经济安全", "B": "政治安全", "A": "军事安全" },
    { "q": "2020年10月,国家安全机关组织实施(   )专项行动,破获数百起间谍窃密案件,抓获一批台湾间谍及运用人员,打掉台湾间谍情报机关针对祖国大陆布建的间谍情报网络,有效维护了国家安全和利益。", "a": "B", "F": "", "E": "", "D": "\"天网-2020\"", "C": "\"雷霆-2020\"", "B": "\"迅雷-2020\"", "A": "\"猎狐-2020\"" },
    { "q": "各种风险我们都要防控,但重点要防控那些可能迟滞或中断中华民族伟大复兴进程的(   )。", "a": "A", "F": "", "E": "", "D": "经济风险", "C": "国内风险", "B": "国际风险", "A": "全局性风险" },
    { "q": "(   )安全是立国之基,其安全状态与国家能否繁荣息息相关。", "a": "B", "F": "", "E": "", "D": "科技", "C": "经济", "B": "国土", "A": "军事" },
    { "q": "《中华人民共和国国家安全法》第十四条规定:每年(   )为全民国家安全教育日。", "a": "A", "F": "", "E": "", "D": "4月28日", "C": "12月4日", "B": "4月5日", "A": "4月15日" },
    { "q": "2021年11月,党的十九届六中全会(   )。", "a": "D", "F": "", "E": "", "D": "系统总结新时代维护国家安全取得的重大成就和宝贵经验", "C": "提出\"十个坚持\"的工作要求", "B": "将\"坚持总体国家安全观\"写入党章", "A": "首次把统筹发展和安全纳入\"十四五\"时期我国经济社会发展的指导思想" },
    { "q": "我们要打赢防范化解重大风险攻坚战,必须坚持和完善中国特色社会主义制度、推进国家治理体系和治理能力现代化,运用(   )应对风险挑战的冲击。", "a": "D", "F": "", "E": "", "D": "制度威力", "C": "治理效能", "B": "政治优势", "A": "治理体系优势" },
    { "q": "难以预测,但突然发生时会引起连锁反应、带来巨大负面影响的小概率事件是指(   )。", "a": "D", "F": "", "E": "", "D": "黑天鹅事件", "C": "白天鹅事件", "B": "大白鲨事件", "A": "灰犀牛事件" },
    { "q": "(    )攸关党和国家生死存亡,是国家安全的根本。", "a": "C", "F": "", "E": "", "D": "国土安全", "C": "政治安全", "B": "外部安全", "A": "经济安全" },
    { "q": "关于网络安全,以下说法不正确的是(   )。", "a": "C", "F": "", "E": "", "D": "维护网络安全,要加速推动信息领域核心技术突破", "C": "网络安全是国家安全的基础", "B": "维护网络安全,要切实维护国家网络空间主权安全,共同构建网络空间命运共同体", "A": "维护网络安全,要加强关键信息基础设施网络安全防护" },
    { "q": "发展和安全是一体之两翼、驱动之双轮。安全是发展的(   )。", "a": "D", "F": "", "E": "", "D": "条件和保障", "C": "基础和目的", "B": "目的和保障", "A": "基础和条件" },
    { "q": "以下不属于总体国家安全观\"十个坚持\"的工作要求的是(    )。", "a": "A", "F": "", "E": "", "D": "坚持把政治安全放在首位", "C": "坚持推进国家安全体系和能力现代化", "B": "坚持把防范化解国家安全风险摆在突出位置", "A": "坚持统筹维护国家安全和塑造国家安全" },
    { "q": "(   )将\"坚持总体国家安全观\"纳入新时代坚持和发展中国特色社会主义的基本方略,并写入党章。", "a": "D", "F": "", "E": "", "D": "党的十九大", "C": "党的十九届六中全会", "B": "党的二十大", "A": "党的十八大" },
    { "q": "\"国家安全是安邦定国的重要基石,维护国家安全是全国各族人民根本利益所在。\"是在(    )上提出的。", "a": "A", "F": "", "E": "", "D": "党的二十大", "C": "党的十九届五中全会", "B": "党的十九届四中全会", "A": "党的十九大" },
    { "q": "(   )首次把统筹发展和安全纳入\"十四五\"时期我国经济社会发展的指导思想,历史性地用专章对筑牢国家安全屏障作出战略部署。", "a": "C", "F": "", "E": "", "D": "党的十九大", "C": "党的十九届五中全会", "B": "党的十九届四中全会", "A": "党的十九届六中全会" },
    { "q": "关于总体国家安全观,以下说法错误的是(   )。", "a": "B", "F": "", "E": "", "D": "总体国家安全观是中国共产党和中国人民捍卫国家主权、安全、发展利益百年奋斗实践经验和集体智慧的结晶", "C": "总体国家安全观是新时代国家安全工作的根本遵循和行动指南", "B": "必须坚持总体国家安全观,以人民安全为根本,以政治安全为宗旨,以经济安全为基础,以军事、科技、文化、社会安全为保障", "A": "总体国家安全观是习近平新时代中国特色社会主义思想的重要组成部分" },
    { "q": "2020年12月,十九届中央政治局第二十六次集体学习时,习近平总书记对总体国家安全观作出全面、系统、完整的论述,阐明了新时代国家安全工作的总体目标,(   )。", "a": "D", "F": "", "E": "", "D": "提出\"十个坚持\"的工作要求", "C": "首次提出\"坚持总体国家安全观\"", "B": "系统总结新时代维护国家安全取得的重大成就和宝贵经验", "A": "提出坚持人民安全、政治安全、国家利益至上的有机统一等重大判断" },
    { "q": "习近平主席强调,实施新时代(    )战略,推动军事人员能力素质、结构布局、开发管理全面转型升级,锻造德才兼备的高素质、专业化新型军事人才,对实现党在新时代的强军目标、把我军全面建成世界一流军队具有十分重要的意义。", "a": "C", "F": "", "E": "", "D": "人才强国", "C": "人才强军", "B": "教育强军", "A": "人才创新" },
    { "q": "提高人民军队打赢能力,要加强军事力量常态化多样化运用,坚定灵活开展军事斗争,塑造安全态势,遏控危机冲突,打赢(   )。", "a": "C", "F": "", "E": "", "D": "整体战争", "C": "局部战争", "B": "世界战争", "A": "军事战争" },
    { "q": "要坚持人民军队最高领导权和指挥权属于(   ),健全人民军队党的建设制度体系,把党对人民军队的绝对领导贯彻到军队建设各领域全过程。", "a": "D", "F": "", "E": "", "D": "党中央和中央军委", "C": "国务院", "B": "全国人大", "A": "国家" },
    { "q": "设计武器装备就是设计未来战争。把发展(   )武器装备摆在战略位置,抓紧攻坚具有前瞻性、战略性意义的\"杀手锏\"装备,加强前瞻性、先导性、探索性、颠覆性技术研究,加快军事智能化发展。", "a": "C", "F": "", "E": "", "D": "高精尖", "C": "高技术", "B": "高杀伤性", "A": "高智能" },
    { "q": "对我军来说,学习宣传贯彻党的二十大精神,要把聚焦点和着力点放在(   )上,这是未来5年我军建设的中心任务,必须全力以赴,务期必成。", "a": "C", "F": "", "E": "", "D": "实现建党一百年奋斗目标", "C": "实现建军一百年奋斗目标", "B": "实现中华民族伟大复兴", "A": "全面建成小康社会" },
    { "q": "适应国家发展战略和安全战略新要求,与时俱进创新军事战略指导,调整优化军事战略布局,完善新时代军事战略体系,不断赋予(   )战略思想新的内涵。", "a": "D", "F": "", "E": "", "D": "积极防御", "C": "自主防御", "B": "积极备战", "A": "积极进攻" },
    { "q": "要把创新摆在我军建设发展全局的(   ),全面推进军事理论、技术、组织、管理、文化各方面创新,带动全军把创新驱动发展的引擎全速发动起来,建设创新型人民军队。", "a": "D", "F": "", "E": "", "D": "核心位置", "C": "首要位置", "B": "辅助位置", "A": "基础位置" },
    { "q": "习近平强军思想对实现党在新时代的强军目标、全面建成世界一流军队作出系统谋划,从基本任务看,要求我军全面推进(   )现代化、军队组织形态现代化、军事人员现代化、武器装备现代化。", "a": "A", "F": "", "E": "", "D": "军事教育", "C": "军事战略", "B": "军事策略", "A": "军事理论" },
    { "q": "(   )是灵魂,决定军队建设的政治方向。", "a": "D", "F": "", "E": "", "D": "听党指挥", "C": "作风优良", "B": "纪律严明", "A": "能打胜仗" },
    { "q": "中央军委实行(   ),是坚持党对人民军队绝对领导的根本制度和根本实现形式,在党领导军队的一整套制度体系中处于最高层次、居于统领地位。", "a": "D", "F": "", "E": "", "D": "主席负责制", "C": "集体负责制", "B": "双重从属制", "A": "合议制" },
    { "q": "2014年10月30日,全军政治工作会议在福建省上杭县古田镇召开。习近平总书记在会议上强调,军队政治工作的时代主题是:紧紧围绕实现中华民族伟大复兴的中国梦,为实现党在新形势下的强军目标提供坚强(   )。", "a": "A", "F": "", "E": "", "D": "制度保证", "C": "思想保证", "B": "经济保证", "A": "政治保证" },
    { "q": "党对军队的(   )是中国特色社会主义的本质特征,是党和国家的重要政治优势,是人民军队的建军之本、强军之魂。", "a": "B", "F": "", "E": "", "D": "政治领导", "C": "直接指挥", "B": "绝对领导", "A": "思想领导" },
    { "q": "当前,新一轮科技革命和军事革命迅猛发展,战略高新技术群体迸发。从世界近几场局部战争和军事行动看,智能化无人作战系统大量投入实战,(   )战斗力已经成为改变战争规则的关键变量。", "a": "C", "F": "", "E": "", "D": "新质新量", "C": "新域新质", "B": "新核新论", "A": "新域新核" },
    { "q": "现代战争(   )的特征更加突出,必须加快军兵种和武警部队转型建设,优化内部力量结构,融入体系、支撑体系,推动我军力量体系和作战能力整体提升。", "a": "C", "F": "", "E": "", "D": "运用重点作战力量实施重点打击", "C": "运用精锐作战力量实施精确作战", "B": "运用重点作战力量实施积极防御", "A": "运用精锐作战力量实施区域作战" },
    { "q": "(   )是核心,反映军队的根本职能和军队建设的根本指向。", "a": "D", "F": "", "E": "", "D": "能打胜仗", "C": "纪律严明", "B": "作风优良", "A": "听党指挥" },
    { "q": "2020年4月17日召开的中央政治局会议首次提出\"六保\"。以下属于\"六保\"内容的是(   )。", "a": "BCD", "F": "", "E": "", "D": "保粮食能源安全", "C": "保基层运转", "B": "保产业链供应链稳定", "A": "保政府主体" },
    { "q": "加快建设全国统一大市场主要目标,包括持续推动国内市场高效畅通和规模拓展、(     )。", "a": "ABCD", "F": "", "E": "", "D": "培育参与国际竞争合作新优势", "C": "促进科技创新和产业升级", "B": "进一步降低市场交易成本", "A": "加快营造稳定公平透明可预期的营商环境" },
    { "q": "建设现代化经济体系的重点举措主要包括大力发展实体经济、(    )和深化经济体制改革。", "a": "ABCD", "F": "", "E": "", "D": "着力发展开放型经济", "C": "实施区域协调发展战略", "B": "实施创新驱动发展战略", "A": "实施乡村振兴战略" },
    { "q": "推动高质量发展,是(    )的必然要求。", "a": "ABD", "F": "", "E": "", "D": "适应我国社会主要矛盾变化", "C": "扩大内需", "B": "保持经济持续健康发展", "A": "遵循经济规律发展" },
    { "q": "国际环境日趋复杂,新冠肺炎疫情影响广泛深远,经济全球化遭遇逆流,世界进入新的动荡变革期,大国博弈日趋激烈,(    )对世界和平与发展构成威胁。", "a": "BCD", "F": "", "E": "", "D": "霸权主义", "C": "单边主义", "B": "保护主义", "A": "多边主义" },
    { "q": "新发展理念回答了关于发展的目的、动力、方式、路径等一系列理论和实践问题,阐明了我们党关于发展的政治立场、(    )等重大政治问题。", "a": "ACD", "F": "", "E": "", "D": "发展道路", "C": "发展模式", "B": "指导原则", "A": "价值导向" },
    { "q": "社会主义初级阶段是(     )的。", "a": "AB", "F": "", "E": "", "D": "一个自发、被动、不用费多大气力自然而然就可以跨过的阶段", "C": "一个静态、一成不变、停滞不前的阶段", "B": "一个动态、积极有为、始终洋溢着蓬勃生机活力的过程", "A": "一个阶梯式递进、不断发展进步、日益接近质的飞跃的量的积累和发展变化的过程" },
    { "q": "现代化经济体系,是由社会经济活动各个环节、各个层面、各个领域的相互关系和内在联系构成的一个有机整体。现代化经济体系包括(    )。", "a": "ACD", "F": "", "E": "", "D": "资源节约、环境友好的绿色发展体系", "C": "创新引领、协同发展的产业体系", "B": "统一开放、竞争有序的全面开放体系", "A": "体现效率、促进公平的收入分配体系" },
    { "q": "坚持以高质量发展为主题、以供给侧结构性改革为主线、建设现代化经济体系、把握扩大内需战略基点,打好(  )三大攻坚战等重大决策,明确了做好新时代经济工作的现实路径。", "a": "ABC", "F": "", "E": "", "D": "网络安全", "C": "精准脱贫", "B": "防范化解重大风险", "A": "污染防治" },
    { "q": "关于习近平经济思想主要内容的十三个方面,以下说法正确的是(   )。", "a": "AC", "F": "", "E": "", "D": "明确大力发展制造业和实体经济是我国经济发展的重要法宝", "C": "明确统筹发展和安全是我国经济发展的重要保障", "B": "明确坚持以人民为中心的发展思想是我国经济发展的根本保证", "A": "明确坚持正确工作策略和方法是做好经济工作的方法论" },
    { "q": "我国经济进入新常态,遇到一系列新情况新矛盾。从国内看,我国经济发展面临着(     )。", "a": "ABD", "F": "", "E": "", "D": "速度换挡节点", "C": "模式转型节点", "B": "动力转换节点", "A": "结构调整节点" },
    { "q": "我国经济发展进入新常态,已由高速增长阶段转向高质量发展阶段,面临(     )\"三期叠加\"的复杂局面,传统发展模式难以为继。", "a": "ABC", "F": "", "E": "", "D": "产业转型优化期", "C": "前期刺激政策消化期", "B": "增长速度换挡期", "A": "结构调整阵痛期" },
    { "q": "尽管在前行的道路上,难免还会面临新问题、新挑战,但我国经济发展长期向好的基本面没有变,经济(     )的基本特质也没有变。", "a": "ABD", "F": "", "E": "", "D": "潜力足", "C": "市场广", "B": "回旋余地大", "A": "韧性好" },
    { "q": "关于新发展理念,以下说法正确的是(     )。", "a": "ABCD", "F": "", "E": "", "D": "新发展理念回答了关于发展的目的、动力、方式、路径等一系列理论和实践问题", "C": "新发展理念集中反映了我们党对经济社会发展规律认识的深化", "B": "新发展理念是在分析国内外发展大势的基础上形成的", "A": "新发展理念是在深刻总结国内外发展经验教训的基础上形成的" },
    { "q": "2018年,党中央进一步提出深化供给侧结构性改革的\"巩固、增强、提升、畅通\"八字方针,具体是指(    )。", "a": "ABCD", "F": "", "E": "", "D": "增强微观主体活力,发挥企业和企业家主观能动性,建立公平开放透明的市场规则和法治化营商环境,促进正向激励和优胜劣汰,发展更多优质企业", "C": "畅通国民经济循环,加快建设统一开放、竞争有序的现代市场体系,提高金融体系服务实体经济能力,形成国内市场和生产主体、经济增长和就业扩大、金融和实体经济良性循环", "B": "巩固\"三去一降一补\"成果,推动更多产能过剩行业加快出清,降低全社会各类营商成本,加大基础设施等领域补短板力度", "A": "提升产业链水平,注重利用技术创新和规模效应形成新的竞争优势,培育和发展新的产业集群" },
    { "q": "处理好政府和市场关系是经济体制改革的关键。以下属于政府的职责和作用的是(    )。", "a": "ABCD", "F": "", "E": "", "D": "加强市场监管,维护市场秩序", "C": "保持宏观经济稳定", "B": "优化公共服务", "A": "保障公平竞争" },
    { "q": "坚持(    ),使全体人民有更多获得感、幸福感、安全感,朝着共同富裕方向稳步前进。", "a": "ABCD", "F": "", "E": "", "D": "全民共享", "C": "渐进共享", "B": "全面共享", "A": "共建共享" },
    { "q": "2015年,党中央提出实施供给侧结构性改革,明确去产能、(    )几大重点任务,通过大力推动\"破、立、降\",使供需结构失衡得到矫正,通货紧缩趋向得到遏制。", "a": "ABCD", "F": "", "E": "", "D": "降成本", "C": "去库存", "B": "补短板", "A": "去杠杆" },
    { "q": "关于资本,以下说法正确的是(   )。", "a": "ABCD", "F": "", "E": "", "D": "在社会主义市场经济条件下规范和引导资本发展,既是一个重大经济问题、也是一个重大政治问题", "C": "资本是带动各类生产要素集聚配置的重要纽带", "B": "在社会主义市场经济条件下规范和引导资本发展,既是一个重大实践问题、也是一个重大理论问题", "A": "资本是社会主义市场经济的重要生产要素" },
    { "q": "供给侧结构性改革不是西方\"供给学派\"的翻版,是因为供给侧结构性改革(   )。", "a": "ABCD", "F": "", "E": "", "D": "既发挥市场在资源配置中的决定性作用又更好发挥政府作用", "C": "既突出发展社会生产力又注重完善生产关系", "B": "既强调供给又关注需求", "A": "既着眼当前又立足长远" },
    { "q": "2018年7月31日召开的中共中央政治局会议首次提出\"六稳\"。以下属于\"六稳\"内容的是(   )。", "a": "ABCD", "F": "", "E": "", "D": "稳外资", "C": "稳投资", "B": "稳就业", "A": "稳外贸" },
    { "q": "我国发展仍然处于重要战略机遇期。经济方面的五个新机遇包括:加快经济结构优化升级带来新机遇、(    )。", "a": "ABCD", "F": "", "E": "", "D": "深化改革开放带来新机遇", "C": "加快绿色发展带来新机遇", "B": "提升科技创新能力带来新机遇", "A": "参与全球经济治理体系变革带来新机遇" },
    { "q": "要更好发挥政府作用,在尊重市场规律的基础上,用(   )。", "a": "BD", "F": "", "E": "", "D": "政策引导市场预期", "C": "规划规范市场行为", "B": "改革激发市场活力", "A": "法治明确投资方向" },
    { "q": "中央全面管治权与特区高度自治权之间是(    )的关系。", "a": "BC", "F": "", "E": "", "D": "源与流", "C": "互相监督", "B": "本与末", "A": "并列" },
    { "q": "我们要全面准确、坚定不移贯彻(    )的方针,坚持依法治港治澳,维护宪法和基本法确定的特别行政区宪制秩序。", "a": "ABCD", "F": "", "E": "", "D": "高度自治", "C": "\"港人治港\"", "B": "\"一国两制\"", "A": "\"澳人治澳\"" },
    { "q": "坚持\"一国两制\"方针,(    )。", "a": "ABCD", "F": "", "E": "", "D": "符合港澳居民利益", "C": "符合国家根本利益", "B": "符合香港、澳门繁荣稳定实际需要", "A": "符合全国人民共同意愿" },
    { "q": "两岸统一后,可以给台湾带来的好处包括(    )。", "a": "ABCD", "F": "", "E": "", "D": "长期困扰台湾经济发展和民生改善的众多难题,可以在两岸融合发展、应通尽通中得到解决", "C": "台湾财政收入尽可用于改善民生,多为老百姓做实事、办好事、解难事", "B": "台湾的文化创造力将得到充分发扬", "A": "台湾经济将以大陆市场为广阔腹地,发展空间更大,竞争力更强" },
    { "q": "习近平在庆祝中国共产党成立100周年大会上的讲话中指出:\"解决台湾问题、实现祖国完全统一,是中国共产党矢志不渝的历史任务,是全体中华儿女的共同愿望。要坚持(    ),推进祖国和平统一进程。\"", "a": "AD", "F": "", "E": "", "D": "一个中国原则", "C": "\"一国两制\"", "B": "和平统一", "A": "\"九二共识\"" },
    { "q": "在确保国家(    )的前提下,和平统一后,台湾同胞的社会制度和生活方式等将得到充分尊重,台湾同胞的私人财产、宗教信仰、合法权益将得到充分保障。", "a": "ACD", "F": "", "E": "", "D": "安全", "C": "主权", "B": "战略方针", "A": "发展利益" },
    { "q": "为完善香港、澳门融入国家发展大局、同内地优势互补、协同发展机制,中央将进一步(     )。", "a": "ABCD", "F": "", "E": "", "D": "完善便利香港、澳门居民在内地学习、创业、就业、生活的政策措施", "C": "注重发挥香港、澳门参与共建\"一带一路\"的独特作用", "B": "推动粤港澳大湾区制度机制创新,率先实现要素便捷流动", "A": "健全香港、澳门与内地在各领域深入开展交流合作的各种机制" },
    { "q": "两岸关系发展历程证明:(     ),是任何人任何势力都无法改变的。", "a": "ABCD", "F": "", "E": "", "D": "两岸同胞都是中国人,血浓于水、守望相助的天然情感和民族认同", "C": "国家强大、民族复兴、两岸统一的历史大势", "B": "台湾是中国一部分、两岸同属一个中国的历史和法理事实", "A": "台海形势走向和平稳定、两岸关系向前发展的时代潮流" },
    { "q": "\"一国两制\"在香港、澳门的成功实践深入推进,具体表现为(     )。", "a": "ABCD", "F": "", "E": "", "D": "港澳同胞对港澳保持繁荣稳定的信心、对国家发展和民族复兴的信心不断增强", "C": "把发挥祖国内地坚强后盾作用和提高香港、澳门自身竞争力有机结合起来", "B": "中央牢牢掌握宪法和基本法赋予的中央对香港、澳门全面管治权", "A": "支持行政长官和特别行政区政府依法施政、积极作为" },
    { "q": "坚持和完善\"一国两制\"制度体系,落实中央全面管治权,落实(    )原则,落实特别行政区维护国家安全的法律制度和执行机制。", "a": "BC", "F": "", "E": "", "D": "\"港人治港\"", "C": "\"爱国者治港\"", "B": "\"爱国者治澳\"", "A": "\"澳人治澳\"" },
    { "q": "实现两岸和平统一,必须面对大陆和台湾(    )不同这一基本问题。\"一国两制\"正是为解决这个问题而提出的最具包容性的方案。", "a": "CD", "F": "", "E": "", "D": "社会制度", "C": "意识形态", "B": "风俗习惯", "A": "文化背景" },
    { "q": "特别行政区的高度自治权包括(    )。", "a": "BCD", "F": "", "E": "", "D": "立法权", "C": "独立的司法权和终审权", "B": "行政管理权", "A": "国防事务的管理权" },
    { "q": "中共十九届六中全会审议通过的《中共中央关于党的百年奋斗重大成就和历史经验的决议》中提及解决台湾问题、实现祖国完全统一是(     )。", "a": "ACD", "F": "", "E": "", "D": "党矢志不渝的历史任务", "C": "全体中华儿女的共同愿望", "B": "坚持一个中国原则和\"九二共识\"的伟大实践", "A": "实现中华民族伟大复兴的必然要求" },
    { "q": "\"和平统一、一国两制\"是实现国家统一的最佳方式。台海形势从紧张对峙走向缓和改善,两岸关系不断取得突破性进展,具体表现为(    )。", "a": "ABD", "F": "", "E": "", "D": "开启两岸协商谈判,推进两岸政党党际交流", "C": "给予外部势力沉重打击", "B": "开辟两岸关系和平发展道路,实现两岸领导人历史性会晤", "A": "巩固国际社会坚持一个中国原则的格局,取得系列反\"台独\"、反分裂斗争的重大胜利" },
    { "q": "\"一国两制\"制度创新成果以(    )为基础,保持港澳原有的资本主义制度和生活方式不变、法律基本不变。", "a": "AC", "F": "", "E": "", "D": "国家安全法", "C": "基本法", "B": "《反分裂国家法》", "A": "宪法" },
    { "q": "要坚持开放和安全的有机统筹,在保障安全中持续扩大开放,着力增强(   ),创造有利于我国经济社会发展的安全环境,牢固树立开放型经济安全防线。", "a": "ABD", "F": "", "E": "", "D": "风险防控能力", "C": "资源竞争能力", "B": "开放监管能力", "A": "自身竞争能力" },
    { "q": "总体国家安全观具有重大而深远的意义,其意义包括(   )。", "a": "ABCD", "F": "", "E": "", "D": "总体国家安全观开辟了国家安全治理新路径,为推动和完善全球安全治理贡献了中国方案", "C": "总体国家安全观深化了我们党对中国特色社会主义建设规律的认识,为发展马克思主义国家安全理论作出了重大原创性贡献", "B": "总体国家安全观提炼中华优秀传统战略文化,总结我们党维护国家安全的理论和实践成果,为坚持把马克思主义基本原理同中国具体实际相结合、同中华优秀传统文化相结合树立了光辉典范", "A": "总体国家安全观经过实践检验、富有实践伟力,为维护和塑造新时代国家安全提供了行动纲领" },
    { "q": "社会主义基本经济制度既体现了社会主义制度优越性,又同我国社会主义初级阶段社会生产力发展水平相适应,是党和人民的伟大创造。(   )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "生产资料所有制是生产关系的核心,决定着社会的基本性质和发展方向。(   )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "我国进入新发展阶段的历史依据是我们已经拥有开启新征程、实现新的更高目标的雄厚物质基础。(   )", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "党的二十大报告指出,高质量发展是全面建设社会主义现代化国家的首要任务。(   )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "我国基本经济制度是中国特色社会主义制度的重要支柱,既体现了社会主义制度的优越性,又同我国社会主义初级阶段社会生产力发展水平相适应。(   )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "在确保国家主权、安全、发展利益的前提下,台湾可以作为特别行政区实行高度自治。(   )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "国家安全是指国家政权、主权、统一和领土完整、人民福祉、经济社会可持续发展和国家其他重大利益相对处于没有危险和不受内外威胁的状态,以及保障持续安全状态的能力。(   )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "我们贯彻总体国家安全观,国家安全领导体制和法治体系、战略体系、政策体系不断完善,在原则问题上寸步不让,以坚定的意志品质维护国家主权、安全、发展利益,国家安全得到全面加强。(    )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "我们要打赢防范化解重大风险攻坚战,必须坚持和完善中国特色社会主义制度、推进国家治理体系和治理能力现代化,运用制度威力应对风险挑战的冲击。(    )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "总体国家安全观强调国家安全要贯穿到党和国家工作全局各方面、各环节,绝非某一领域、单一部门的职责,必须汇聚党政军民学各战线各方面各层级的强大合力,全社会全政府全体系全手段应对重大国家安全风险挑战。(    )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "要统筹发展和安全。安全是发展的基础和目的,发展是安全的条件和保障,发展和安全要同步推进。(    )", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "美国次贷危机属于黑天鹅事件。(    )", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "党的二十大报告指出:坚持预防第一、安全为主,建立大安全大应急框架,完善公共安全体系,推动公共安全治理模式向事前预防转型。(   )", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "核安全已经成为我国面临的最复杂、最现实、最严峻的非传统安全问题之一。(    )", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "灰犀牛事件是指难以预测,但突然发生时会引起连锁反应、带来巨大负面影响的小概率事件。(    )", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "总体国家安全观是我们党历史上第一个被确立为国家安全工作指导思想的重大战略思想,是习近平新时代中国特色社会主义思想的重要组成部分,是新时代国家安全工作的根本遵循和行动指南。(   )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "政治安全的核心是政权安全和制度安全,最根本的就是维护中国共产党的领导和执政地位、维护中国特色社会主义制度。(    )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "中国始终坚持对内求发展、求变革、求稳定,建设平安中国;对外求和平、求合作、求共赢,维护世界和平与发展。(    )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "必须坚持总体国家安全观,以政治安全为宗旨,以人民安全为根本,以经济安全为基础,以军事、科技、文化、社会安全为保障,以促进国际安全为依托,走出一条中国特色国家安全道路。(    )", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "走中国特色国家安全道路,努力开创国家安全工作新局面,是对总体国家安全观的贯彻落实,归根到底是为了确保中华民族伟大复兴进程不被迟滞甚至中断。(    )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "扣牢建军一百年奋斗目标,确保国防和军队现代化进程同国家近代化进程相适应、军事能力同国家战略需求相适应,就能更好地以强军支撑强国。(   )", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "建设强大人民军队,首要的是毫不动摇坚持党对人民军队绝对领导的根本原则和制度,坚持人民军队最高领导权和指挥权属于党中央和中央军委,全面深入贯彻军委主席负责制。(   )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "实现建军一百年奋斗目标,根本指向是全面提高捍卫国家主权、安全、发展利益的战略能力。(   )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "中国特色军事变革取得重大进展,但机械化建设任务尚未完成,信息化水平亟待提高,军事安全面临技术突袭和技术代差被拉大的风险,军队现代化水平与国家安全需求相比差距还很大,与世界先进军事水平相比差距还很大。(   )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "坚持机械化信息化智能化融合发展,增加新域新质作战力量比重,是抢占军事竞争和未来战争主动的重要一手。(   )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "改革创新是我军发展的强大动力,推动高质量发展必须用改革创新的办法研究解决问题。(   )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "世界新军事革命以信息化为核心,以军事战略、军事技术、作战思想、作战力量、组织体制和军事管理创新为基本内容,以重塑军事体系为主要目标,其速度之快、范围之广、程度之深、影响之大,为第二次世界大战结束以来所罕见。(   )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "人才是推动我军高质量发展、赢得军事竞争和未来战争主动的关键因素。(   )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "必须牢固树立和践行绿水青山就是金山银山的理念,站在人与社会和谐共生的高度谋划发展。(  )", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "习近平总书记在党的二十大报告中强调,\"健全资源环境要素市场化配置体系\"。这是我国资源环境领域一项重大的、基础性的机制创新,是充分发挥市场在资源环境要素配置中基础性作用的一项重要制度改革。(  )", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    
];


logWithTime("题库数量：" + tiku.length)



//此次未收入题库数Y
var X = 0;//计数器X
var Y = 0;

//此次未匹配答案数Z
var x = 0;//计数器x
var z = 0;//计数器z
var Z = 0;


//几种 正则表达式
pattern = /[`~!@#$^&*()=|{},':;'“”,\\\[\]\.<>\/?~！@#￥…… & *（）——|{},【】'；：""'。，、？\s \d \多选题 \单选题 \判断题 ]/g;    //去标点符号，空格，数字，题型
pattern1 = /[`~!@#$^&*()=|{},':;'“”,\\\[\]\.<>\/?~！@#￥…… & *（）——|{},【】'；：""'。，、？\s \多选题 \单选题 \判断题 a-z A-Z]/g;      //保留选项
pattern2 = /[^A-Z]/g;                                                                                                        //只保留英文字母
pattern3 = /[^\u4e00-\u9fa5]/g;                                                                                            //只保留汉字



//获取题目 打印出来
for (var n = 0; n >= 0; n++) {
    var timu = className("android.view.View").depth(depth).indexInParent(n).findOne(1000);
    //log(timu);

    if (timu != null) {
        var arr = timu.children();
        var a = arr.length;
        //log(a);

        var q = timu.child(0);
        var Q_txt = q.text().replace(pattern, "");
        logWithTime(n + 1 + "、" + Q_txt);




        for (var k = 0; k < tiku.length; k++) {                          // 题库循环   -->   找题目
            var que = tiku[k].q;
            let que = que.replace(pattern, "");
            var daan = tiku[k].a;
            var daan_txt = String;
            var daan_txt1 = String;

            if (que == Q_txt) {
                X = 0;
                log("答案：" + daan);
                //log(daan.length)
                //log(daan[0])
                for (r = 0; r < daan.length; r++) {
                    //获取ABCD
                    for (var i = 1; i < a; i++) {

                        var selection = timu.child(i)
                        var selectioni = selection.child(1);
                        //log(selectioni.text());
                        var xuan = selectioni.text().replace(pattern1, "")
                        var pan = selectioni.text().replace(pattern1, "")
                        //log(xuan)

                        if (daan[r] == "A") {
                            daan_txt = tiku[k].A.replace(pattern1, "")
                            log("A:" + daan_txt)
                        } else if (daan[r] == "B") {
                            daan_txt = tiku[k].B.replace(pattern1, "")
                            log("B:" + daan_txt)
                        } else if (daan[r] == "C") {
                            daan_txt = tiku[k].C.replace(pattern1, "")
                            log("C:" + daan_txt)
                        } else if (daan[r] == "D") {
                            daan_txt = tiku[k].D.replace(pattern1, "")
                            log("D:" + daan_txt)
                        } else if (daan[r] == "E") {
                            daan_txt = tiku[k].E.replace(pattern1, "")
                            log("E:" + daan_txt)
                        } else if (daan[r] == "F") {
                            daan_txt = tiku[k].F.replace(pattern1, "")
                            log("F:" + daan_txt)
                        } else if (daan == "正确" || daan == "对") {
                            daan_txt = "正确";
                            daan_txt1 = "对";
                            if (xuan == daan_txt) {
                                log("判断:" + daan_txt)
                            } else if (xuan == daan_txt1) {
                                log("判断:" + daan_txt1)
                            }

                        } else if (daan == "错误" || daan == "错") {
                            daan_txt = "错误";
                            daan_txt1 = "错";
                            if (xuan == daan_txt) {
                                log("判断:" + daan_txt)
                            } else if (xuan == daan_txt1) {
                                log("判断:" + daan_txt1)
                            }

                        } else {
                            log("不知道")
                        };


                        if (xuan == daan_txt || pan == daan_txt1) {
                            //log(xuan)
                            selection.click()
                            x = x + 1;
                        } else {
                            continue
                        }

                    }
                    if (x == 0) {
                        z = z + 1;
                    } else {
                        z = 0
                    }

                }
                x = 0;

                if (z !== 0 && k < tiku.length - 1) {
                    continue
                } else if (z !== 0 && k == tiku.length - 1) {
                    Z = Z + 1;
                    z = 0;
                } else if (z == 0) {
                    break;
                }
                //另一种思路：
                //z = z / (daan.length) 
                //Z = Z + z


            } else {
                X = X + 1;
                if (X == tiku.length) {
                    Y = Y + 1;
                    X = 0;
                }
                continue
            }

        }








    } else {

        log("已获取全部题目");
        break;

    }




}
alert("完事！\n" +
    "此次未收入题库数：" + Y +
    "\n此次未匹配答案数：" + Z);
