"uii"

auto.waitFor();
var ls = storages.create("ls");

var depth = ls.get("路径")
console.show();
log(depth)

//显示当前时分秒
//function formatDate() {
//var year = d.getFullYear();
//var month = d.getMonth() + 1;
//var date = d.getDate();
//var hour = d.getHours();
//var day = d.getDay()
//var minute = d.getMinutes();
//var second = d.getSeconds();
//var millisecond = d.getMilliseconds();
//var 时间 = （ year + "-" + month + "-" + date + " " + hour + ":" + minute + ":" + second + ":" + millisecond）;
//}
//console.log(时间)
//

//显示当前时间
var d = new Date();
console.log(d)
//

//获取实时时间戳
function timestamp() {
    var d = new Date
    var hour = d.getHours();
    var minute = d.getMinutes();
    var second = d.getSeconds();
    var millisecond = d.getMilliseconds();
    var t = (hour + ":" + minute + ":" + second + ":" + millisecond);

    //return t
    console.log(t)
}
//

// 获取时分秒用于记录日志
function logWithTime(msg) {
    timestamp() + console.info(" " + msg);
}

const tiku = [

    { "q": "兼任二职或以上的学生,按照最高加分分值进行加分。不得累计加分。各项加分分值可以累加,但不得重复累计,最高加分分值为( )分。", "a": "B", "F": "", "E": "", "D": "20", "C": "15", "B": "10", "A": "5" },
    { "q": "学生入学后( )内须如实申报健康状况和慢性病史。", "a": "C", "F": "", "E": "", "D": "两个月", "C": "一个月", "B": "一周", "A": "五日" },
    { "q": "未履行请假手续,擅自出校门的,每次扣( )分。", "a": "D", "F": "", "E": "", "D": "10", "C": "6", "B": "5", "A": "2" },
    { "q": "教室、寝室空调学院使用规定中规定,室外温度夏天高于 ____ 度,冬天低于____ 度,可开启空调;室内人员离开寝室1小时以上,应关闭空调。( )", "a": "A", "F": "", "E": "", "D": "35;10", "C": "35;5", "B": "25;10", "A": "30;5" },
    { "q": "午休、晚自习时间、熄灯号(哨)响后,进行娱乐活动的,每次扣( )分。", "a": "C", "F": "", "E": "", "D": "4", "C": "3", "B": "2", "A": "1" },
    { "q": "擅自使用或违反操作规程使用教学设备、仪器、器材、器械等物品的,扣 __ 分;造成损坏的,除按规定赔偿外,扣 ___ 分。( )", "a": "C", "F": "", "E": "", "D": "3, 5", "C": "2, 5", "B": "2, 4", "A": "1, 3" },
    { "q": "学生着警服时,必须着 __ 皮鞋, __ 袜子。( )", "a": "C", "F": "", "E": "", "D": "制式;黑色", "C": "制式;深色", "B": "黑色;深色", "A": "黑色;黑色" },
    { "q": "女学生一律理 __ ,发梢不得过__ 。( )", "a": "A", "F": "", "E": "", "D": "平头;肩", "C": "平头;衣领", "B": "短发;肩", "A": "短发;衣领" },
    { "q": "晚点名:晚点名每周至少( )次,以大队、中队或区队为单位进行。", "a": "A", "F": "", "E": "", "D": "4", "C": "3", "B": "2", "A": "1" },
    { "q": "在院期间,异性之间交往举止不文明,造成不良影响的,给予 __ 处分;发生越轨行为的,给予 __ 处分;造成恶劣影响的,给予___ 处分。( )", "a": "C", "F": "", "E": "", "D": "警告;严重警告;开除学籍", "C": "警告;记过或留校察看;开除学籍", "B": "严重警告;记过或留校察看;开除学籍", "A": "警告;严重警告;记过或留校察看" },
    { "q": "擅自以警察或警察学生身份进行活动,在社会上造成不良影响的,给予 ( ) 处分。", "a": "D", "F": "", "E": "", "D": "开除学籍", "C": "严重警告", "B": "警告", "A": "警告以上" },
    { "q": "编造谎言骗取各种假期的,给予 ( ) 处分。", "a": "B", "F": "", "E": "", "D": "开除学籍", "C": "记过", "B": "严重警告", "A": "警告" },
    { "q": "扣分累计满 ___ 分的,或者有二次单项扣分值为__分以上违纪行为的,给予警告以上处分。( )", "a": "C", "F": "", "E": "", "D": "15;6", "C": "15;5", "B": "10;6", "A": "10;5" },
    { "q": "警告、严重警告解除处分的期限为满 ( ) ,记过满十二个月。", "a": "C", "F": "", "E": "", "D": "12个月", "C": "6个月", "B": "3个月", "A": "1个月" },
    { "q": "本科学生休学时间累计不得超过 ( ) 。", "a": "D", "F": "", "E": "", "D": "1年", "C": "6个月", "B": "3个月", "A": "1个月" },
    { "q": "违反公安部和上海市公安局关于严禁“一机两用”相关规定的,将 ___ 外联其他信息网络或者将 ___ 的设备连接其他信息网络 ( )", "a": "B", "F": "", "E": "", "D": "各类公安设备;存有公安信息", "C": "公安信息网及设备;存有重要信息", "B": "公安信息网及设备;存有公安信息", "A": "公安信息网;存有重要信息" },
    { "q": "在校期间吸烟的,每次扣 ( ) 分。", "a": "C", "F": "", "E": "", "D": "6", "C": "5", "B": "4", "A": "3" },
    { "q": "院综合奖学金分设一等、二等、三等三个级别,授奖面分别不超本区队学生人数的 ( ) 。", "a": "C", "F": "", "E": "", "D": "以上都不对", "C": "2%、6%、12%", "B": "2%、4%、6%", "A": "1%、3%、10%" },
    { "q": "区队 ( ) 召开一次学生大会。", "a": "C", "F": "", "E": "", "D": "以上都不对", "C": "每周", "B": "每两周", "A": "每月" },
    { "q": "学生加分批准部门为 ( )", "a": "C", "F": "", "E": "", "D": "学员管理处", "C": "所在部门", "B": "大队", "A": "中队" },
    { "q": "午休、晚自修、就寝后物品未按规定摆放的,每次扣 ( )分", "a": "B", "F": "", "E": "", "D": "4", "C": "3", "B": "2", "A": "1" },
    { "q": "除洗澡外,在其他地方赤裸上身、穿拖鞋或睡衣裤出入寝室楼、除体育运动外着背心的,每次扣 ( ) 分", "a": "A", "F": "", "E": "", "D": "6", "C": "5", "B": "4", "A": "2" },
    { "q": "请假外出回校后,不履行销假手续的,每次扣( )分", "a": "B", "F": "", "E": "", "D": "4", "C": "3", "B": "2", "A": "1" },
    { "q": "在处理邻里纠纷、家庭内部矛盾时,不顾及( ),言行明显过当,在社区中造成负面影响的,给予严重警告或记过处分。", "a": "C", "F": "", "E": "", "D": "公务员身份", "C": "警察学生身份", "B": "警察身份", "A": "学生身份" },
    { "q": "将警服、警械出卖或借给非公安人员的,除责令其追回警服、警械外,造成后果的,给予( )处分。", "a": "D", "F": "", "E": "", "D": "开除学籍处分", "C": "记过或留校察看", "B": "严重警告", "A": "警告" },
    { "q": "在遇到违反犯罪行为时畏惧退缩,或在国家财产遭受损失、群众发生危难的情况下不予救助,造成不良影响的,给予( )处分。", "a": "C", "F": "", "E": "", "D": "开除学籍处分", "C": "记过或留校察看", "B": "严重警告", "A": "警告" },
    { "q": "熄灯号(哨)响后,进行( )活动的,每次扣3分。", "a": "C", "F": "", "E": "", "D": "文艺", "C": "娱乐", "B": "问题", "A": "自修" },
    { "q": "故意( )的,给予警告处分并赔偿损失;造成严重后果的,给予记过或留校察看处分。", "a": "D", "F": "", "E": "", "D": "损坏公共财物", "C": "私接电线", "B": "违反用电规定", "A": "违反安全规定" },
    { "q": "因故不能出早操的学生,必须事先经 ( ) 批准。", "a": "A", "F": "", "E": "", "D": "区队警务委员", "C": "辅导员", "B": "区队学生干部", "A": "大队值班干部" },
    { "q": "未按时熄灯的,寝室所在学生每人每次扣( ) 分。", "a": "B", "F": "", "E": "", "D": "5", "C": "3", "B": "2", "A": "1" },
    { "q": "未履行请假手续,未在规定时间到指定地点或学院报到的,每次扣( ) 分。", "a": "A", "F": "", "E": "", "D": "10", "C": "5", "B": "3", "A": "2" },
    { "q": "院综合奖学金评定以 ( ) 为单位进行。", "a": "C", "F": "", "E": "", "D": "所在部门", "C": "区队", "B": "中队", "A": "大队" },
    { "q": "在网络上编造、转发危害国家安全、淫秽色情、封建迷信等有害信息的,给予( ) 处分。", "a": "D", "F": "", "E": "", "D": "开除学籍", "C": "记过或留校察看", "B": "严重警告", "A": "警告" },
    { "q": "因个人原因保管不善,遗失警服、警械的,给予 ( ) 处分。", "a": "A", "F": "", "E": "", "D": "开除学籍", "C": "记过或留校察看", "B": "严重警告", "A": "警告" },
    { "q": "因故请假超时,无法按时归队又未及时续假的,每次扣 ( ) 分。", "a": "B", "F": "", "E": "", "D": "5", "C": "3", "B": "2", "A": "1" },
    { "q": "未按规定着装的(包括作训服),或着装不规范的,每次每项扣 ( ) 分。", "a": "A", "F": "", "E": "", "D": "5", "C": "3", "B": "2", "A": "1" },
    { "q": "进办公室不报告的,每次扣 ( ) 分。", "a": "A", "F": "", "E": "", "D": "5", "C": "3", "B": "2", "A": "1" },
    { "q": "本科学生参加中国人民解放军(含中国人民武装警察部队),学院保留其入学资格或者学籍至退役后( )年。", "a": "B", "F": "", "E": "", "D": "5", "C": "3", "B": "2", "A": "1" },
    { "q": "留级仅限( )次。", "a": "A", "F": "", "E": "", "D": "5", "C": "3", "B": "2", "A": "1" },
    { "q": "公安民警违反上述“四个不准”的,视性质、情节、后果,依据有关规定追究相关责任人的( );构成犯罪的,依法追究刑事责任。", "a": "A", "F": "", "E": "", "D": "行政处罚", "C": "纪律处罚", "B": "行政责任", "A": "纪律责任" },
    { "q": "要自觉维护祖国统一,对于“台湾”、“南海”、“钓鱼岛”、“西藏”、“新疆”等话题要( )发布", "a": "C", "F": "", "E": "", "D": "应当", "C": "慎重", "B": "可以", "A": "不能" },
    { "q": "市公安局新闻宣传保密纪律“四不准” 规定,不准未经授权提供( )", "a": "B", "F": "", "E": "", "D": "新闻采访", "C": "新闻通讯", "B": "新闻口径", "A": "新闻稿" },
    { "q": "我院团委微信公众账号的名称是( )", "a": "B", "F": "", "E": "", "D": "崇景小蜘蛛", "C": "901俱乐部", "B": "崇景青澜", "A": "青声入微" },
    { "q": "“主义譬如一面旗子,旗子立起了,大家才有所指望,才知所趋赴。”这句话出( )。", "a": "A", "F": "", "E": "", "D": "习近平", "C": "邓小平", "B": "周恩来", "A": "毛泽东" },
    { "q": "中国人民警察警旗授旗仪式2020年( )在人民大会堂举行。", "a": "D", "F": "", "E": "", "D": "8月26日", "C": "8月25日", "B": "8月24日", "A": "8月23日" },
    { "q": "新修订的《中国共产党纪律处分条例》( )正式印发的。", "a": "B", "F": "", "E": "", "D": "2017年10月", "C": "2016年10月", "B": "2015年10月", "A": "2014年10月" },
    { "q": "“七一”勋章获得者----崔道植是我国第一代刑事技术警察,中国首席枪弹痕迹鉴定专家,( )余年刑侦生涯,检验鉴定7000余件痕迹物证,参与办理1200余起重特大案件疑难痕迹检验鉴定。", "a": "C", "F": "", "E": "", "D": "70", "C": "60", "B": "50", "A": "40" },
    { "q": "在上海,( )建设依托“互联网+公安政务服务”,将公安74项公共服务事项和全部68项行政审批事项接入网上政务大厅,在线办理群众预约、申报、查询等事宜。", "a": "C", "F": "", "E": "", "D": "互联网+", "C": "智慧公安", "B": "智慧城市", "A": "上海公安" },
    { "q": "使用数字证书时要安装( )才可正常使用。", "a": "D", "F": "", "E": "", "D": "驱动程序", "C": "下载软件", "B": "拼音输入法", "A": "五笔输入法" },
    { "q": "网络安全管理的目标是( )。", "a": "D", "F": "", "E": "", "D": "加强网络安全性能", "C": "登记用户使用流量", "B": "修改网络设备参数", "A": "提高网络传输速率" },
    { "q": "用于涉密网的计算机要专机专用、专人管理,严禁连接其他网络,要阻断和关闭其他网络接口,与公安网和其他网络要做到安全有效的( )。", "a": "C", "F": "", "E": "", "D": "加密连接", "C": "物理隔离", "B": "即时连接", "A": "适当隔离" },
    { "q": "计算机病毒具有很强的隐蔽性,当前版本的查毒软件( )。", "a": "B", "F": "", "E": "", "D": "一定不能将其杀除", "C": "一定可将其杀除", "B": "一定可将其检查出来", "A": "一定不可将其检查出来" },
    { "q": "包含公安信息内容的邮件( )。", "a": "D", "F": "", "E": "", "D": "只能在公安网中发送", "C": "可以使用手机发送", "B": "可以在网吧中发送", "A": "可以在家里发送" },
    { "q": "需送外维修的设备,( )进行维修。", "a": "C", "F": "", "E": "", "D": "不需要送定点维修单位", "C": "要送定点维修单位", "B": "可请业务精通的非公安人员来单位", "A": "可联系关系好的任意一家单位" },
    { "q": "( )意味着生命力、凝聚力、向心力、战斗力。", "a": "D", "F": "", "E": "", "D": "纪律", "C": "公正", "B": "服务", "A": "忠诚" },
    { "q": "警旗通用规格共分为( )种。", "a": "A", "F": "", "E": "", "D": "7", "C": "6", "B": "5", "A": "4" },
    { "q": "( )就是培养学生良好习惯的教育。", "a": "B", "F": "", "E": "", "D": "半军事化教育", "C": "军事化教育", "B": "养成教育", "A": "锻炼教育" },
    { "q": "下列哪个不是养成教育的途径( )。", "a": "C", "F": "", "E": "", "D": "学院、家庭、社会、用人单位多方合作", "C": "体能锻炼", "B": "学生自主管理", "A": "警务化管理" },
    { "q": "公安院校不同于普通院校,它肩负的使命是为国家培养预备警察,所以在学生养成教育方面应围绕( )的人民警察核心价值观的养成。", "a": "D", "F": "", "E": "", "D": "忠诚、为民、公正、廉洁", "C": "爱国、敬业、诚信、友善", "B": "自由、平等、公正、法治", "A": "富强、民主、文明、和谐" },
    { "q": "新生入校首先要学会尽快( )。", "a": "A", "F": "", "E": "", "D": "转变", "C": "融入", "B": "独立", "A": "适应" },
    { "q": "《老妇人与美少女》心理挂图给我们的启示,凡事都有( ),换个角度看问题。", "a": "C", "F": "", "E": "", "D": "局限性", "C": "两面性", "B": "一面性", "A": "片面性" },
    { "q": "( )是人生的两大主题,是人生各个段都要经历的过程。", "a": "D", "F": "", "E": "", "D": "适应和发展", "C": "调控", "B": "发展", "A": "适应" },
    { "q": "我们多数人的生活境遇,既不是一无所有,一切糟糕;也不是什么都好,事事如意。这种境遇就相当于“半杯水”。当你面对这半杯水时,心里会产生怎样情绪波动。积极正确的选择是( )", "a": "C", "F": "", "E": "", "D": "以上都不对", "C": "庆幸自己拥有了半杯水,情绪振作,行动积极", "B": "真糟糕", "A": "为少了半杯水而不高兴,情绪消沉" },
    { "q": "每个人都有自己的优势和短板,别给自己贴糟糕的( ),比如,“大家都不喜欢我”、“我不行”等等。", "a": "A", "F": "", "E": "", "D": "以上都不对", "C": "标记", "B": "标识", "A": "标签" },
    { "q": "1829年,以英国内政大臣罗伯特?比尔创立英国伦敦大都市警察(苏格兰场)为标志的第一次警务革命可视为警察的什么运动? ( )", "a": "A", "F": "", "E": "", "D": "现代化", "C": "信息化", "B": "专业化", "A": "正规化" },
    { "q": "“国家安危,公安系于一半”这句话出自我国哪位领导人对公安工作的重要讲话中?( )", "a": "C", "F": "", "E": "", "D": "朱德", "C": "周恩来", "B": "刘少奇", "A": "毛泽东" },
    { "q": "在中国共产党领导下创办的第一所公安学校是?( )", "a": "B", "F": "", "E": "", "D": "中央公安干部学校", "C": "东北公安干部学校", "B": "华东(山东)警官学校", "A": "华北公安干部学校" },
    { "q": "第一位由市公安局局长兼任上海市警务学校校长是谁?( )", "a": "D", "F": "", "E": "", "D": "李士英", "C": "杨光池", "B": "梁国斌", "A": "舒同" },
    { "q": "我院是哪一年在全国省属公安院校中率先试办侦察本科专业?( )", "a": "C", "F": "", "E": "", "D": "2002年", "C": "1996年", "B": "1993年", "A": "1983年" },
    { "q": "违反用电规定,私接电线和电源、擅自使用电器,包括 ( ) 等的,每次扣3分。", "a": "BCD", "F": "", "E": "", "D": "电热毯", "C": "电热棒", "B": "电熨斗", "A": "充电器" },
    { "q": "学生有下列哪些行为的应加重处理,可按扣分标准加倍予以扣分 ( )", "a": "ABCDE", "F": "", "E": "同一条款经教育处理后再次违反的", "D": "被查处的违纪学生找关系说情的", "C": "抵触、辱骂或讽刺挖苦考核人员的", "B": "考核人员指出其错误行为后,不立即终止、不立即整改的", "A": "查处违纪时,学生拒报或不报真实姓名、所属中队的" },
    { "q": "院级奖励种类有 ( )", "a": "ABC", "F": "", "E": "", "D": "", "C": "院综合奖学金 院优秀学生 E 院优秀学生干部 F 院优秀毕业生", "B": "院级嘉奖", "A": "院级通报表扬" },
    { "q": "学生在校期间应当履行下列义务( )", "a": "ABCDE", "F": "", "E": "法律、法规及学生章程规定的其他义务", "D": "按规定缴纳学费及有关费用,履行获得贷学金及助学金的相应义务", "C": "恪守学术道德,完成规定学业", "B": "遵守学生章程和规章制度", "A": "遵守宪法和法律、法规以及公安纪律" },
    { "q": "学生纪律处分种类包括 ( ) 。", "a": "ABD", "F": "", "E": "", "D": "开除学籍", "C": "记大过", "B": "记过或留校察看", "A": "警告" },
    { "q": "男学生一律理 ( ) 。", "a": "BC", "F": "", "E": "", "D": "光头", "C": "板寸头", "B": "平头", "A": "短发" },
    { "q": "不按正常途径反映情况,或用过激方式表达个人诉求的,给予___或___处分,造成严重后果的,给予___处分。 ( )", "a": "BCDE", "F": "", "E": "留校察看", "D": "开除学籍", "C": "记过", "B": "严重警告", "A": "警告" },
    { "q": "学生如有特殊情况确需要外出,必须做到___ ,未办理请、销假手续的,一律作___处理( )", "a": "ABCD", "F": "处分", "E": "扣分", "D": "旷课", "C": "及时销假", "B": "按时归队", "A": "事前请假" },
    { "q": "下列说法正确的是: ( )", "a": "AB", "F": "", "E": "", "D": "学生请事假七日以上的,中队签署意见,报部门和学管处审核,由学管处报院分管领导审批。", "C": "学生请事假48小时以上、七日(含)以内的,中队签署意见,报所在部门审核,并报学管处审批。", "B": "学生请事假4小时以上、48小时(含)以内的,中队签署意见,报所在部门审核,并报学管处审批。", "A": "学生请事假4小时(含)以内的,中队签署意见,报所在部门审批。" },
    { "q": "下列说法正确的是:( )", "a": "ABCD", "F": "", "E": "", "D": "就诊、治疗七日以上、三十日(含)以内的,根据学生书面申请、医院病假证明(区级以上),中队签署意见,经所在部门审核,学管处复核,报院分管领导审批,同时通报教务处。", "C": "就诊、治疗48小时以上、七日(含)以内的,中队签署意见,经所在部门审核,报学管处审批。", "B": "就诊、治疗24小时以上、48小时(含)以内的,中队签署意见,报所在部门审批,并报学管处备案。", "A": "就诊、治疗24小时(含)以内的,按请假程序由中队办理准假手续。" },
    { "q": "学生提出申诉,应在接到学院处理 、处分决定书之日起___日内,由___或者___向申诉委员会提出申请,逾期不再受理。 ( )", "a": "CDF", "F": "邮寄", "E": "家长", "D": "本人", "C": "10", "B": "5", "A": "3" },
    { "q": "为贯彻“从严治警、从严治校”的方针,学院坚持 ( ) 的教育培训原则。", "a": "ABCDE", "F": "", "E": "严格纪律", "D": "严格考核", "C": "严格训练", "B": "严格管理", "A": "严格教育" },
    { "q": "未履行好相关公共场所和公共部位的( )等职责的,每次扣2分。", "a": "BCD", "F": "", "E": "", "D": "节能降耗", "C": "安全防范", "B": "卫生保洁", "A": "规章制度" },
    { "q": "学生警务化管理的主要内容包括: ( )", "a": "ABCD", "F": "", "E": "", "D": "奖惩制度。", "C": "行为规范考核", "B": "日常管理制度", "A": "学生的权利和义务" },
    { "q": "利用( )等物品开玩笑、打闹的,每次扣1分。", "a": "ABCD", "F": "", "E": "", "D": "器械", "C": "器材", "B": "仪器", "A": "教学设备" },
    { "q": "学生发生违纪行为时,在场的___或___若不主动予以制止,则进行责任连带追究,并给予警告或严重警告处分( )。", "a": "BD", "F": "", "E": "", "D": "学生干部", "C": "党员干部", "B": "学生党员", "A": "学生团员" },
    { "q": "对于在重大任务或重点工作中违纪违规的,( )处罚。", "a": "AC", "F": "", "E": "", "D": "严肃", "C": "加重", "B": "从严", "A": "从重" },
    { "q": "学生受到( )处分后,能进行深刻反省,表现良好的,由学生所属部门提出解除处分的书面申请,经学员管理处审核,报分管院领导审批。", "a": "ABC", "F": "", "E": "", "D": "开除学籍处分", "C": "记过或留校察看", "B": "严重警告", "A": "警告" },
    { "q": "( )吹口哨、起哄、喝倒彩或有其他不文明举止的,每次扣2分。", "a": "ABC", "F": "", "E": "", "D": "课间休息", "C": "上课", "B": "集体活动", "A": "集会" },
    { "q": "违反公安部“三项纪律”的,给予___ 处分;造成严重后果或者恶劣影响的,给予 ___ 处分。( )", "a": "CD", "F": "", "E": "", "D": "开除学籍", "C": "记过或留校察看", "B": "严重警告", "A": "警告" },
    { "q": "公安部“三项纪律”是指 ( )", "a": "ABD", "F": "", "E": "", "D": "决不允许进夜总会娱乐", "C": "决不允许接受可能影响公正执行公务的宴请、财物", "B": "决不允许酗酒滋事", "A": "决不允许面对群众危难不勇为" },
    { "q": "安装与公安工作无关的游戏、影视等其他娱乐软件的,给予 ( ) 处分。", "a": "BC", "F": "", "E": "", "D": "开除学籍", "C": "记过或者留校察看", "B": "严重警告", "A": "警告" },
    { "q": "有( )行为的,给予记过或留校察看处分;情节严重的,给予开除学籍处分。", "a": "AB", "F": "", "E": "", "D": "熄灯后使用手机", "C": "上课迟到", "B": "不当得利", "A": "偷窃" },
    { "q": "下列说法正确的是 ( ) 。", "a": "AD", "F": "", "E": "", "D": "本科学生在学院规定期限内,修完教学训练计划规定的内容,未达到毕业要求的,由学院发给结业证书。", "C": "学满一年以上退学的学生,有学院颁发结业证书。", "B": "学生在学院规定期限内,修完教学训练计划规定的内容,未达到毕业要求的,由学院发给肄业证书。", "A": "学满一年以上退学的学生,有学院颁发肄业证书。" },
    { "q": "下列符合加分条件的是:( )", "a": "BCD", "F": "", "E": "", "D": "主动制止、举报其他学生违纪违规行为,并经查证属实的。", "C": "在校期间,获市(局)级以上荣誉称号、院级嘉奖或院级通报表扬的学生", "B": "代表学院(部门)参加市(局)等各类活动并获奖的学生", "A": "主要学生干部或其他干部" },
    { "q": "学生在实训实习期间,有下列 ( ) 行为,给予警告、严重警告、记过或者留校察看处分,造成严重后果的,给予开除学籍处分:", "a": "ABCD", "F": "", "E": "", "D": "工作拈轻怕重、推诿敷衍、消极懈怠。", "C": "不按规定携带、使用、放置、保存警用装备", "B": "参与刑讯逼供、虐待、体罚他人", "A": "发泄不满情绪,散布消极言论" },
    { "q": "有下列 ( ) 泄密行为的,给予警告、严重警告、记过或留校察看处分,造成严重后果的,给予开除学籍处分。", "a": "ABCD", "F": "", "E": "", "D": "其它泄密行为。", "C": "擅自接受媒体采访涉及公安内容的", "B": "在公开场合随意谈论涉密或公安内部事项", "A": "在互联网、手机上擅自上传、发送涉密或公安内部信息" },
    { "q": "有下列 ( ) 行为的,给予严重警告或记过处分,造成严重后果的,给予开除学籍处分。", "a": "ACD", "F": "", "E": "", "D": "擅自在公安信息网上开设与公安工作无关的个人网站(页)、聊天室、BBS等网站(页)的。", "C": "未经审查和批准,从其他信息网络直接下载、转发、粘贴信息到公安信息网的", "B": "在网络上发表夸大其词、格调不高、观点错误言论的", "A": "擅自查询、使用或向社会提供公安网站和各类应用系统信息数据的" },
    { "q": "有下列 ( )行为的,给予严重警告处分。", "a": "ABD", "F": "", "E": "", "D": "弄虚作假,伪造事实,骗取荣誉的。", "C": "因个人原因保管不善,遗失警服、警械的", "B": "编造谎言骗取各种假期的", "A": "寻衅滋事、打架、斗殴的" },
    { "q": "有下列 ( )行为的,给予严重警告、记过或留校察看处分,造成严重后果的,给予开除学籍处分。", "a": "BC", "F": "", "E": "", "D": "不服从或消极应付教学、管理或其他工作人员的。", "C": "未办理请假手续,擅自出市、出国、出境的", "B": "不按正常途径反映情况,或用过激方式表达个人诉求的", "A": "故意损坏公共财物的" },
    { "q": "违反下列哪项内务卫生管理规定的,每次扣2分?( )", "a": "ABD", "F": "", "E": "", "D": "未履行好相关公共场所和公共部位的卫生保洁、安全防范和节能降耗等职责的。", "C": "地面不干净、有果壳、烟蒂等杂物的", "B": "铺面不平整的", "A": "被子为按规定叠放或叠放不整齐的" },
    { "q": "本科学员有下列情形之一的,应当留级:( )。", "a": "ABD", "F": "", "E": "", "D": "本科学生连续休学时间超过半年的。", "C": "行为规范累计扣分达15分的。", "B": "各学年累计出现3门考试课程(考查课程门数按2:1比例折抵考试课程门数)补考不及格的", "A": "在一学年内出现2门考试课程(考查课程门数按2:1比例折抵考试课程门数)补考不及格的" },
    { "q": "提出申诉申请时必须提交以下材料:( )", "a": "ABC", "F": "", "E": "", "D": "申诉人个人资料及复印件", "C": "申诉人认为需要提交的其他材料", "B": "学院对其作出处理、处分决定的复印件", "A": "由申诉人签名的书面申诉申请书" },
    { "q": "学院对学生作出处分,应当出具处分决定书,处分决定书应该包括下列内容:( )。", "a": "ABCDE", "F": "", "E": "其他必要内容", "D": "申诉的途径和期限", "C": "处分的种类、依据、期限", "B": "作出处分的事实和证据", "A": "学生的基本信息" },
    { "q": "在网络上发表( )言论、照片、视频等的,给予警告或严重警告处分;造成不良影响的,给予记过或留校察看处分。", "a": "ABC", "F": "", "E": "", "D": "旗帜鲜明", "C": "观点错误", "B": "格调不高", "A": "夸大其词" },
    { "q": "有( )泄密行为的,给予警告、严重警告、记过或留校察看处分;造成严重后果的,给予开除学籍处分。", "a": "ABCDE", "F": "", "E": "其它泄密行为。", "D": "有违反政务微信相关管理规定的", "C": "擅自接受媒体采访涉及公安内容的", "B": "在公开场合随意谈论涉密或公安内部事项", "A": "在互联网、手机上擅自上传、发送涉密或公安内部信息" },
    { "q": "上海市公安局新闻宣传保密纪律规定:( )", "a": "ABCD", "F": "", "E": "", "D": "不准利用微博、微信、论坛等网络社交工具发布或转载未经公开的警务信。", "C": "不准泄露未经公开的警务信息", "B": "不准未经授权提供新闻口径", "A": "不准未经许可接受媒体采访" },
    { "q": "根据《学院第二专、本科学生网络社交工具使用行为规范 》学警工作微博、微信公众号必须( )且经过实名认证才能开设。", "a": "AD", "F": "", "E": "", "D": "同意", "C": "待审", "B": "报告", "A": "报批" },
    { "q": "公安民警违反上述“四个不准”的,视( ),依据有关规定追究相关责任人的纪律责任;构成犯罪的,依法追究刑事责任。", "a": "ABD", "F": "", "E": "", "D": "后果", "C": "过程", "B": "情节", "A": "性质" },
    { "q": "禁止在( )等特殊、重大政治节点或敏感日期,发布相应敏感内容或参与敏感话题的讨论。", "a": "ABC", "F": "", "E": "", "D": "“12.25”", "C": "“11.15”", "B": "“10.10”", "A": "“6.4”" },
    { "q": "习近平总书记在中国人民警察警旗授旗仪式上发表重要训词,其主要内容是( )。", "a": "ABCD", "F": "", "E": "", "D": "纪律严明", "C": "执法公正", "B": "服务人民", "A": "对党忠诚" },
    { "q": "设立警旗是深入贯彻落实全国公安工作会议精神的重要举措,也是健全完善人民警察标志体系和荣誉制度的重要标志,对于推进公安队伍( )建设具有重要作用,是公安历史上具有里程碑意义的标志性事件。", "a": "ABCD", "F": "", "E": "", "D": "职业化", "C": "专业化", "B": "正规化", "A": "革命化" },
    { "q": "训词精辟地回答了人民警察事业和队伍建设中带有( )的基本问题。", "a": "ABC", "F": "", "E": "", "D": "长期性", "C": "方向性", "B": "原则性", "A": "根本性" },
    { "q": "警旗是人民警察队伍的重要标志,是人民警察( )的象征。", "a": "ABC", "F": "", "E": "", "D": "精神", "C": "使命", "B": "责任", "A": "荣誉" },
    { "q": "新进代公安工作职责定位是( )。", "a": "ABCD", "F": "", "E": "", "D": "保障人民安居乐业", "C": "促进社会公平正义", "B": "确保社会大局稳定", "A": "维护国家政治安全" },
    { "q": "公安民警在网上不得进行法律法规、党纪、政纪和社会道德规范所禁止的各类活动,严禁进行下列行为:( )", "a": "ABCD", "F": "", "E": "", "D": "将公安业务用计算机“一机两用”", "C": "将秘密级以上信息上网", "B": "擅自让非警务人员登录、使用公安信息网,或者擅自向非相关人员提供公安网站和各类应用系统的信息数据", "A": "未经审查和批准,从国际互联网和其它公共网络上直接下载、转发、粘贴各类信息到公安信息网" },
    { "q": "常见计算机病毒的传播渠道有( )。", "a": "ABCD", "F": "", "E": "", "D": "通过网络", "C": "通过光盘", "B": "通过硬盘", "A": "通过移动存储设备" },
    { "q": "公安机关统一标贴的计算机存储介质有( )。", "a": "BCD", "F": "", "E": "", "D": "互联网专用", "C": "机密级", "B": "绝密级", "A": "秘密级" },
    { "q": "习近平总书记提出的“四句话、十六字”总要求是( )。", "a": "ABCD", "F": "", "E": "", "D": "纪律严明", "C": "执法公正", "B": "服务人民", "A": "对党忠诚" },
    { "q": "牢牢把握教育整顿的重点任务有( )。", "a": "ABCD", "F": "", "E": "", "D": "大力加强制度建设,着力强化监督制约", "C": "大力加强作风建设,着力涵养清风正气", "B": "大力加强纪律建设,着力保持清廉本色", "A": "大力加强政治建设,着力优化政治生态" },
    { "q": "深入推进执法规范化建设,坚持严格规范公正文明执法,为全力维护社会公平正义提供了基础,( )的追求融入细节,推动着每一起案件的办理。", "a": "AB", "F": "", "E": "", "D": "正义", "C": "公平", "B": "规范", "A": "法治" },
    { "q": "在共建共治共享中推进平安中国建设,维护人民利益,全心全意为增强人民群众( )而努力工作。", "a": "BCD", "F": "", "E": "", "D": "安全感", "C": "幸福感", "B": "获得感", "A": "成就感" },
    { "q": "养成教育是指围绕培养目标,在思想教育的基础上,在日常生活、学习过程中,通过严格训练,严格管理等教育手段,全面提高受教育者的( )等方面的素质,最终使受教育者养成自觉遵守社会公德和行为规范等良好道德品质和行为习惯的一种教育。", "a": "ABCD", "F": "", "E": "", "D": "行为", "C": "意志", "B": "情感", "A": "认知" },
    { "q": "为了塑造学生的( ),警务化管理是行为养成的有效手段和根本保障。", "a": "ABC", "F": "", "E": "", "D": "高尚品德", "C": "职业精神", "B": "职业道德", "A": "警察职业意识" },
    { "q": "公安院校学生养成教育的特点( )。", "a": "ABCD", "F": "", "E": "", "D": "反复性", "C": "长期性", "B": "强制性", "A": "日常性" },
    { "q": "新生入校积极适应的途径( )。", "a": "ABCD", "F": "", "E": "", "D": "积极社会交往", "C": "自立自强", "B": "自觉调整自己", "A": "主动改变自己" },
    { "q": "学会合理宣泄不良情绪的方法( )。", "a": "ABC", "F": "", "E": "", "D": "压抑在内心", "C": "心事学会倾诉", "B": "有意识地给自己心理“排毒”", "A": "跟自己聊聊" },
    { "q": "心理暗示一般包括( )", "a": "ABCDE", "F": "", "E": "对比暗示", "D": "榜样的暗示", "C": "行为的暗示", "B": "神情的暗示", "A": "语言的暗示" },
    { "q": "不恰当的情绪宣泄的方法( )", "a": "ABC", "F": "", "E": "", "D": "", "C": "生闷气 C.自我伤害", "B": "扔东西、打架", "A": "喝酒" },
    { "q": "半杯水思维,给我们的启示是( )", "a": "ABCD", "F": "", "E": "", "D": "合理认知,换个视角看问题,这对我们保持一种健康、平和、淡定的心态,拥有健康的身心尤为重要。", "C": "心态好,地狱般的日子也可以过出天堂般的幸福;心态不好,天堂般的日子也有地狱般的痛苦。", "B": "同样的半杯水,有的人看到的是自己拥有的那一半,人生,总想着自己拥有的那一半,就获得快乐,享受快乐。", "A": "同样的半杯水,有的人看到的是缺少的那一半,人生,只看到缺少的那一半,就会将快乐扼杀,自己折磨自己。" },
    { "q": "以下哪些是我院的前身?( )", "a": "ABCE", "F": "", "E": "上海公安高等专科学校", "D": "上海市第一人民警察学校", "C": "上海市公安学校", "B": "上海市警务学校", "A": "华东警官学校" },
    { "q": "申诉处理委员会成员有: ( )", "a": "ABCD", "F": "", "E": "", "D": "学管处", "C": "教务处", "B": "政治处", "A": "院办公室" },
    { "q": "学生所有加分事项、被加分人、加分分值以中队为单位进行张榜公示1个工作日。", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "违反公安部“铁纪硬规”的,给予开除学籍处分。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "在校期间打牌或玩类似牌类游戏的每次扣5分。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "警务化管理的基本原则是:严格管理与科学管理、学院管理与自我管理、思想教育为主与奖惩分明、优胜劣汰的竞争激励机制相结合的原则。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "每周课余训练为1次,每次训练时间不少于45分钟。", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "两名以上公安民警着装徒步巡逻执勤或者外出时,应当两人成行、三人成列,威严有序。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "学生在室内,当老师来到时,应主动起立问好,待老师允许后方可坐下。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "学生在校园内不准袖手、背手、插兜,不准边走边吃东西,行走中不得使用手机,不得戴耳机等。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "就餐时应遵守就餐规定,不准大声喧哗,不准敲打碗筷、嬉笑打闹,餐具用毕应轻放", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "违反射击训练有关规定,私藏弹药的,给予开除学籍处分。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "擅自查询、使用或向社会提供公安网站和各类应用系统信息数据的,给予严重警告、记过或留校察看处分,造成严重后果的,给予开除学籍处分。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "考试作弊的,视情给予记过或留校察看处分,情节严重的,给予开除学籍处分。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "学生根据教学计划参加基层单位实训实习,需请病、事、公假的,应先征得基层单位同意,再根据以上相关条款办理请假手续。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "学生在读期间因私出国(境)的,应填写《上海公安学院学生因私出市、出国(境)申请登记表》及《上海公安学院学生因私出国(境)承诺书》,由中队签署意见,经所在部门审核,学管处复核,报院分管领导审批。", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "迟到或早退达到45分钟及以上的,按旷课论处,每旷课一节扣3分。", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "未经批准的特殊情况将饭菜带回寝室的,每次扣2分。", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "着警服时,佩戴挂件的,每次扣2分。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "违反保密规定的,造成后果的,每次扣4分。", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "污染或破坏环境、乱刻乱画的,每次扣2分。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "教学训练中不听从指挥、不尊重师长,不虚心接受批评的,每次扣3分。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "区队设区队长、警务委员、内务委员、督查委员、学习委员等,各区队下设若干班,设班长。", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "不遵守食堂就餐规定的,插队或替人代买饭菜等扰乱就餐秩序的,每次扣3分。造成物损的,同时责令其赔偿。", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "院英才奖分设为一等、二等两个级别。", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "午休时间学生不得进行文体娱乐活动。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "晚点名每周至少1次,以大队、中队或区队为单位进行。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "学生非工作任务外出可着作训服或便装。", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "受过处分的学生可以参与院综合奖学金的评定。", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "在教育训练计划阶段内,各门考试、考查课成绩、实训实习成绩均合格的学生方可参与综合奖学金的评定。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "有不当得利行为的,给予警告以上处分。", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "违反法律、法规,虽未受到公安、司法机关处理但证据确凿、影响恶劣的,给予开除学籍处分。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "在校期间,从事以营利为目的的经营活动的,给予开除学籍处分。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "凡有考核违纪行为的,考核成绩一律做零分处理。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "考查课程成绩不及格的学生,补考一次,对有三门以上(含)考查课程不合格的学生,依据本办法第五章有关规定予以退学。", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "学生申诉申请被受理后,申诉人可以以其他方式渠道请求解决相同申诉事由。", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "在校饮酒或返校当日饮酒的(紧急召回除外),给予警告、严重警告、记过或者留校察看处分,造成严重后果的,给予开除学籍处分。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "考核以“严格教育、严格训练、严格管理、严格纪律、严格考核”为方针,坚持“公开、公平、公正”的原则。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "利用社交媒体等方式随意结交异性,并发生两性关系的,给予记过或留校察看处分;造成恶劣影响的,给予开除学籍处分。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "人民警察互联网使用互联网过程中,严禁在互联网通讯工具上谈论、发布色情、暴力、反动言论,严禁从事与人民警察身份不相符的其它各类活动。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "人民警察互联网使用过程中,可以在互联网通讯工具上谈论、发布单位警力、武装兵力、值班、值勤情况和处置突发事件的预案。", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "个人QQ、博客、微博、微信可以使用公安标志与符号并且标注所在单位和职务信息。", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "个人QQ、博客、微博、微信不得未经许可发布警务信息与在校学习行为相关的信息,不得透露学警身份。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "不在私人通信中涉及秘密。不在公共场所和家属、亲友面前谈论秘密。不在普通电话及其他通讯工具中传递秘密事项。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "“一机两用”就是指把公安业务用计算机(单机和连接网络的计算机)直接与互联网等其他非公安网络连接的现象。", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "联接互联网的计算机必须与处理涉密信息的计算机严格区分,不能够既用于上互联网又用于处理涉密信息。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "机密级可以存储机密级(含)以下的信息,对它的保密管理要求最高。", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "不该说的秘密,绝对不说。不该知道的秘密,绝对不问。不该看的秘密,绝对不看。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "“对党忠诚、服务人民、执法公正、纪律严明。”是2017年5月19日,习近平总书记在人民大会堂亲切会见全国公安系统英雄模范立功集体表彰大会代表,并对全国公安机关和公安队伍提出“四句话、十六字”总要求。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "习近平总书记对人民公安事业的提出“四句话、十六字”的总要求,成为建警治警的总方略、立警从警的座右铭。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "中国人民警察警旗旗面由红蓝两色组成,红色为主色调,警徽居旗帜左上角。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "我国人民警察是国家重要的治安行政和刑事司法力量。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "对于新生来说,要在短时间内适应既新鲜又陌生的警校生活,无疑是对每位学生心理素质和适应能力的考验。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "适应是个体与环境和谐统一的良好状态。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "每个人都有自己的“情绪周期”,有时难免会陷入莫名的情绪低谷阶段。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "情绪管理包括觉察情绪、识别情绪、压抑情绪。", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "凡事都具有两面性,要学会换个视角看问题。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "心理暗示是人们日常生活中,最常见的心理现象。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "心理暗示对人的发展起着非常重要的作用,想要自己向良好的方向发展,必须在内心树立起积极的心理暗示", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "在语言的暗示中,要使用恰当的语气,避免同学产生抵触心理。如,用信任、尊重、商量、赞赏、鼓励的语气。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "尊重、鼓励和赞美是激发我们潜能的最佳方式。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "每个人的潜能都是巨大的。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "截至目前警学界公认的世界警务革命有五次。", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "秦汉时期在县乡两级设立了我国历史上最早的专门基层治安机构“尉”。", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "1978年,上海公安学校恢复重建,掀开了改革开放后上海公安教育事业全面发展的帷幕,为公安队伍培养了大批优秀领导干部和业务骨干。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "上海公安学院是2017年6月正式挂牌成立的。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "上海公安学院是上海唯一一所全日制公安高等院校。", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "学生在读期间因私出市的,应提前( )个工作日填写《上海公安学院学生因私出市、出国(境)申请登记表》。", "a": "C", "F": "", "E": "", "D": "六", "C": "五", "B": "四", "A": "三" },
    { "q": "学生在读期间因私出市的,填写《上海公安学院学生因私出市、出国(境)申请登记表》后,由( )签署意见,经所在部门审核,报学管处审批。", "a": "A", "F": "", "E": "", "D": "辅导员", "C": "大队", "B": "值班大队长", "A": "中队" },
    { "q": "申诉委员会的办事机构挂靠在校( ),负责受理学生申诉及申诉申诉委员会安排的其他工作。", "a": "C", "F": "", "E": "", "D": "学生管理大队", "C": "学管处", "B": "考试中心", "A": "教务处" },
    { "q": "学生提出申诉申请,应在接到学校处理、处分决定书之日起( )内,向申诉委员会提出书面申请。逾期不再受理。", "a": "A", "F": "", "E": "", "D": "30日", "C": "半个月", "B": "15", "A": "10" },
    { "q": "处理、处分或者复查决定书未告知学生申诉期限的,申诉期限自学生知道或者应当知道处理或者处分决定之日起计算,但最长不得超过( )。", "a": "B", "F": "", "E": "", "D": "十二个月", "C": "九个月", "B": "六个月", "A": "三个月" },
    { "q": "公共部位学生打扫时间为上、下午各一次,具体时间为( )。", "a": "C", "F": "", "E": "", "D": "无具体时间", "C": "7:55—8:10、13:20—13:35", "B": "7:50—8:15、13:20—13:35", "A": "7:55—8:10、13:10—13:35" },
    { "q": "学生请事假、病假48小时(含)以内的,由辅导员、大队长、专业系领导逐级审核、并报( )审批。", "a": "B", "F": "", "E": "", "D": "专业系领导", "C": "分管院领导", "B": "学管处领导", "A": "大队" },
    { "q": "学生因病需外出就诊的,一律凭校医务室转院就诊凭证到( )办理请假手续。外出就诊时间以病假计", "a": "C", "F": "", "E": "", "D": "学管处", "C": "大队", "B": "中队", "A": "辅导员处" },
    { "q": "学生因公请假影响正常教学二日以上的,由( )提出申请,经学院管理处审核,报院领导审批,并向教学质量评估中心备案", "a": "A", "F": "", "E": "", "D": "值班大队干部", "C": "辅导员", "B": "学生本人", "A": "借调部门" },
    { "q": "因公请假每学年累计不得超过( )周。(100课时)", "a": "C", "F": "", "E": "", "D": "五", "C": "四", "B": "三", "A": "二" },
    { "q": "上海公安学院学生申诉处理办法,依据( )和上海公安学院的有关规定制定。", "a": "A", "F": "", "E": "", "D": "《上海公安机关内务管理规范》", "C": "《上海公安学院学生警务化管理规定》", "B": "《上海公安学院学生学籍管理办法》", "A": "《普通高等学校学生管理规定》" },
    { "q": "申诉委员会采取表决方式形成复查结论。申诉委员会作出复查结论时应有( )以上委员参加表决,有超过半数委员同意才有效。", "a": "B", "F": "", "E": "", "D": "", "C": "三分之一B.四分之一", "B": "三分之二", "A": "二分之一" },
    { "q": "申诉申请必须由学生本人当面提交给申诉委员会办事机构或采用( )方式提交。", "a": "A", "F": "", "E": "", "D": "转交", "C": "短信", "B": "传讯", "A": "邮寄" },
    { "q": "学生因公请假影响正常教学( )日(含)以内的,或不影响正常教学的,由借调部门提出提出申请,报学院管理处审批,并向教学质量评估中心备案。", "a": "B", "F": "", "E": "", "D": "四", "C": "三", "B": "二", "A": "一" },
    { "q": "因公请假每学年累计不得超过4周( )", "a": "B", "F": "", "E": "", "D": "140课时", "C": "120课时", "B": "100课时", "A": "80课时" },
    { "q": "申诉人当面提交申请的,申请日为( )日。", "a": "A", "F": "", "E": "", "D": "第四", "C": "第三", "B": "次", "A": "当" },
    { "q": "就诊、治疗( )日以上的,根据学生书面申请、医院病假证明(区级以上),大队应按《上海公安学院学生学籍管理办法》《上海公安学院学生警务化管理规定》有关条款,在核实了解情况后,提出休学意见,经所在专业系审核,学管处复核,报分管院领导和院主要领导逐级审批,同时通报教务处。专业系每周向学管处报学生近况。", "a": "D", "F": "", "E": "", "D": "30", "C": "10", "B": "40", "A": "20" },
    { "q": "申诉处理委员会成员有:( )。", "a": "ABCD", "F": "", "E": "", "D": "学员管理处", "C": "教务处", "B": "政治处", "A": "院办公室" },
    { "q": "以下宿舍内务卫生方面,正确的是( )", "a": "BCD", "F": "", "E": "", "D": "椅子统一推到书桌底,整齐摆放。", "C": "抹布实行三折四叠,最多允许放2条抹布", "B": "书籍统一摆放,自下而上按照由大到小、外沿平齐、书籍开口向内整齐平放,书架上除教材、书本和规定摆放物品外,禁止存放其他物品。", "A": "装备包统一摆放于床底靠两侧,把手向内,纵向推到最里靠墙,统一有序摆放。" },
    { "q": "以下内容正确的是( )", "a": "ABCD", "F": "", "E": "", "D": "寝室卫生间无长明灯、无污垢外溢,马桶洁净明亮、无锈迹、无污垢、无异味,地面无积水,台盆无污垢、无杂物、无长流水,浴室玻璃无污垢。", "C": "室内不得随意涂写或钉、贴东西,不得使用电源接线板,不得乱拉绳子、铁丝等物。", "B": "桌面、床架、门窗框、物品架、装备箱、铁皮柜、吊扇开关等物品上均无灰尘,墙角无蛛网,地面保持整洁、无垃圾、无积水。", "A": "纸屑、杂物一律放在寝室簸箕或盥洗室垃圾桶内,不得在寝室内随意乱扔,寝室无人时簸箕必须干净,门、窗应保持清洁明亮。" },
    { "q": "关于寝室被子、铺面,以下选项正确的是( )", "a": "BCDE", "F": "", "E": "床单边沿平整无皱纹,铺面整洁。", "D": "大檐帽摆放于被子上面中央,帽檐与被子上端前边缘平齐。", "C": "摆放顺序自下而上,依次为垫背、床单、被子。", "B": "被子四折四叠,被面无皱褶、棱角分明,开口两端对齐,前后高度、长短一致。", "A": "被子后墙距床头40厘米,开口对门,摆放距铺面中央、两边距离相等。" },
    { "q": "以下选项正确的是( )", "a": "ABC", "F": "", "E": "", "D": "离开寝室必须开启所有电源。", "C": "午休和晚上就寝时,外套挂在椅背上,其余衣物按照由外到里的顺序,自下而上叠放整齐摆放于椅子上,鞋子置于铁架旁鞋根朝外。", "B": "离开寝室必须将书柜抽屉、房门上锁,以确保安全。底楼寝室须同时锁好窗户。", "A": "簸箕和扫帚统一置于寝室门后靠墙角,扫帚置于簸箕内,其它卫生工具统一置于盥洗室清洁工具处,分类有序摆放。" },
    { "q": "关于公共部位卫生,下列说法正确的是( )", "a": "ABCDEF", "F": "公共部位的打扫工具统一摆放在卫生间、盥洗室内。", "E": "垃圾分类:严格按照《上海市生活垃圾管理条例》对垃圾进行分类,学生相互监督,将垃圾投放妥当,垃圾桶内外保持清洁,无外放垃圾。", "D": "晒台:物品晾晒有序,无垃圾、无杂物、无烟蒂。", "C": "活动室:地面、桌面清洁、椅子放置整齐有序、无烟蒂、无积水。", "B": "储物间:地面、储物架、窗台清洁,无长明灯,物品摆放有序,无水果等易变质、腐败食品以及存在安全隐患的物品。", "A": "楼梯、楼道:无积水、无痰迹、无纸屑和杂物、无长明灯,窗台、楼梯、扶手、楼道展板等无灰尘、无蜘蛛网。" },
    { "q": "就诊、治疗三十日以上的,根据学生书面申请、医院病假证明(区级以上),大队应按《上海公安学院学生学籍管理办法》《上海公安学院学生警务化管理规定》有关条款,在核实了解情况后,提出休学意见,经所在()审核,()复核,报()和()逐级审批。同时通报教务处。专业系每周向学管处报学生近况。( )", "a": "ABCD", "F": "", "E": "", "D": "院主要领导", "C": "分管院领导", "B": "学管处", "A": "专业系" },
    { "q": "学生根据教学计划参加基层单位实训实习期间需请假的,请假4小时以内(含)的,学生向所在实习点请假,获得同意后,报辅导员备案;请假4小时以上的,应先征得( )同意,再根据以上相关条款办理请假手续。", "a": "CD", "F": "", "E": "", "D": "实习基地(点)带队干部", "C": "基层单位、", "B": "辅导员", "A": "区队长" },
    { "q": "申诉处理委员会由院领导任主任和副主任,成员由( )等相关职能部门负责人及教官教师、学生代表、负责法律事务的相关机构负责人等共同组成。", "a": "ABCD", "F": "", "E": "", "D": "学管处", "C": "教务处", "B": "政治处(监察室)", "A": "院办公室" },
    { "q": "申诉申请必须由()()给()或采用()方式提交。( )", "a": "ABCD", "F": "", "E": "", "D": "邮寄", "C": "申诉委员会办事机构", "B": "当面提交", "A": "学生本人" },
    { "q": "休息日( )不能按时到校,到岗的,学生需事前向大队请假,事后按第三条规定程序及时补办有关网上手续。", "a": "AB", "F": "", "E": "", "D": "因公", "C": "因假", "B": "因事", "A": "因病" },
    { "q": "学生如有特殊情况确需外出,必须做到( )。未办理请、销假手续的,一律按旷课处理。", "a": "ABCE", "F": "处分", "E": "旷课", "D": "扣分", "C": "及时销假", "B": "按时归队", "A": "事前请假" },
    { "q": "提出申述申请时必须提交以下材料( ):", "a": "ABC", "F": "", "E": "", "D": "申诉人个人材料及复印件", "C": "申诉人认为需要提交的其他材料", "B": "学校对其作出处理、处分决定的复印件", "A": "由申诉人签名的书面申诉申请书" },
    { "q": "申诉申请必须由学生本人当面提交给申诉委员会办事机构或采用邮寄方式提交。提出申诉申请时必须提交以下材料:( )", "a": "ABC", "F": "", "E": "", "D": "申诉人的主观个人看法意见。", "C": "申诉人认为需要提交的其他材料;", "B": "学校对其作出处理、处分决定的复印件;", "A": "由申诉人签名的书面申诉申请书;" },
    { "q": "申诉委员会认为做出处理或者处分的( )等存在不当,可以作出建议撤销或变更的复查意见。", "a": "ABC", "F": "", "E": "", "D": "结果", "C": "程序", "B": "依据", "A": "事实" },
    { "q": "申诉委员会认为原处理、处分存在下列情况之一的,应建议改变原处理、处分决定:( )", "a": "ABC", "F": "", "E": "", "D": "目的不清晰;", "C": "定性不准确、处分不适当;", "B": "适用依据有错误的;", "A": "程序不当、证据不足的;" },
    { "q": "楼梯、楼道的公共部位卫生标准为( )。", "a": "ABCD", "F": "", "E": "", "D": "无长明灯", "C": "无纸屑和杂物", "B": "无痰迹", "A": "无积水" },
    { "q": "公共部位每周二进行一次集中清扫。( )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "学生在室内,当老师来到时,应主动起立问好,待老师允许后方可坐下。( )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "学生因病需外出就诊的,一律凭校医务室转院就诊凭证到大队办理请假手续。外出就诊时间以病假计。( )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "学生根据教学计划参加基层单位实训实习期间需请假的,请假4小时以内(含)的,学生向所在实习点请假,获得同意后,报辅导员备案;请假4小时以上的,应先征得基层单位、实习基地(点)带队干部同意,再根据以上相关条款办理请假手续。( )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "学生因公请假影响正常教学三日(含)以内的,获不影响正常教学的,由借调部门提出申请,报教务处、学管处审批。( )", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "严格按照《上海市生活垃圾管理条例》对垃圾进行分类、学生相互监督,将垃圾投放妥当,垃圾桶内外保持清洁,无外放垃圾。( )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "簸箕和扫帚统一置于寝室门后靠墙角,扫帚置于簸箕内,其它卫生工具统一置于盥洗室清洁工具处,不用分类有序摆放。( )", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "就诊、治疗60日以上的,根据学生书面申请、医院病假证明(区级以上),大队应按《上海公安学院学生学籍管理办法》《上海公安学院学生警务化管理规定》有关条款,在核实了解情况后,提出休学意见,经所在专业系审核,学管处复核,报分管院领导和院主要领导逐级审批,同时通报教务处。专业系每周向学管处报学生近况。( )", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "学生在读期间因私出市的,填写《上海公安学院学生因私出市、出国(境)申请登记表》后,由中队签署意见,经所在部门审核,报学管处审批。( )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "申诉人当面提交申请的,申请日为次日。( )", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "申诉申请必须由学生本人当面提交给申诉委员会办事机构或采用传讯方式提交。( )", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "午休和晚上就寝时,外套挂在椅背上,其余衣物按照由外到里的顺序,自下而上叠放整齐摆放于椅子上,鞋子置于铁架旁鞋根朝外。( )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "纸屑、杂物一律放在寝室簸箕或盥洗室垃圾桶内,不得在寝室内随意乱扔,寝室无人时簸箕必须干净,门、窗应保持清洁明亮。( )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "因公请假每学年累计不得超过4周(80课时)( )", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "垃圾分类:严格按照《上海市生活垃圾管理条例》对垃圾进行分类,学生相互监督,将垃圾投放妥当,垃圾桶内外保持清洁,无外放垃圾。( )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "书籍统一摆放,自下而上按照由大到小、外沿平齐、书籍开口向内整齐平放,书架上除教材、书本和规定摆放物品外,禁止存放其他物品。( )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "处理、处分或者复查决定书未告知学生申诉期限的,申诉期限自学生知道、应当知道处理或者处分决定之日起计算,但最长不得超过9个月。( )", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "申诉申请必须由学生本人当面提交给申诉委员会办事机构或采用邮寄方式提交。( )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "学生提出申诉申请,应在接到学校处理、处分决定书之日起30日内,向申诉委员会提出书面申请。逾期不再受理。( )", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "学生如有特殊情况确需外出,必须做到事前请假、按时归队、及时销假。未办理请、销假手续的,一律作旷课处理。( )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "储物间:地面、储物架、窗台清洁,无长明灯,物品摆放有序,无水果等易变质、腐败食品以及存在安全隐患的物品。( )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "被子后墙距床头30厘米,开口对门,摆放距铺面中央、两边距离相等。被子四折四叠,被面无皱褶、棱角分明,开口两端对齐,前后高度、长短一致。( )", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "室内不得随意涂写或钉、贴东西,可以使用电源接线板,但不得乱拉绳子、铁丝等物。( )", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "就诊、治疗24小时(含)以内,按请假程序由中队办理准假手续。( )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "就诊、治疗24小时以上、48小时(含)以内的,中队签署意见,报所在部门审批,并报学管处审批。( )", "a": "正确", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },
    { "q": "就诊、治疗48小时以上、七日(含)以内的,中队签署意见,经所在部门审核,报大队审核。( )", "a": "错误", "F": "", "E": "", "D": "", "C": "", "B": "错误", "A": "正确" },


];


logWithTime("题库数量：" + tiku.length)



//此次未收入题库数Y
var X = 0;//计数器X
var Y = 0;

//此次未匹配答案数Z
var x = 0;//计数器x
var z = 0;//计数器z
var Z = 0;


//几种 正则表达式
pattern = /[`~!@#$^&*()=|{},':;'“”,\\\[\]\.<>\/?~！@#￥…… & *（）——|{},【】'；：""'。，、？\s \d \多选题 \单选题 \判断题 ]/g;    //去标点符号，空格，数字，题型
pattern1 = /[`~!@#$^&*()=|{},':;'“”,\\\[\]\.<>\/?~！@#￥…… & *（）——|{},【】'；：""'。，、？\s \多选题 \单选题 \判断题 a-z A-Z]/g;      //保留选项
pattern2 = /[^A-Z]/g;                                                                                                        //只保留英文字母
pattern3 = /[^\u4e00-\u9fa5]/g;                                                                                            //只保留汉字



//获取题目 打印出来
for (var n = 0; n >= 0; n++) {
    var timu = className("android.view.View").depth(depth).indexInParent(n).findOne(1000);
    //log(timu);

    if (timu != null) {
        var arr = timu.children();
        var a = arr.length;
        //log(a);

        var q = timu.child(0);
        var Q_txt = q.text().replace(pattern, "");
        logWithTime(n + 1 + "、" + Q_txt);




        for (var k = 0; k < tiku.length; k++) {                          // 题库循环   -->   找题目
            var que = tiku[k].q;
            let que = que.replace(pattern, "");
            var daan = tiku[k].a;
            var daan_txt = String;
            var daan_txt1 = String;

            if (que == Q_txt) {
                X = 0;
                log("答案：" + daan);
                //log(daan.length)
                //log(daan[0])
                for (r = 0; r < daan.length; r++) {
                    //获取ABCD
                    for (var i = 1; i < a; i++) {

                        var selection = timu.child(i)
                        var selectioni = selection.child(1);
                        //log(selectioni.text());
                        var xuan = selectioni.text().replace(pattern1, "")
                        var pan = selectioni.text().replace(pattern1, "")
                        //log(xuan)

                        if (daan[r] == "A") {
                            daan_txt = tiku[k].A.replace(pattern1, "")
                            log("A:" + daan_txt)
                        } else if (daan[r] == "B") {
                            daan_txt = tiku[k].B.replace(pattern1, "")
                            log("B:" + daan_txt)
                        } else if (daan[r] == "C") {
                            daan_txt = tiku[k].C.replace(pattern1, "")
                            log("C:" + daan_txt)
                        } else if (daan[r] == "D") {
                            daan_txt = tiku[k].D.replace(pattern1, "")
                            log("D:" + daan_txt)
                        } else if (daan[r] == "E") {
                            daan_txt = tiku[k].E.replace(pattern1, "")
                            log("E:" + daan_txt)
                        } else if (daan[r] == "F") {
                            daan_txt = tiku[k].F.replace(pattern1, "")
                            log("F:" + daan_txt)
                        } else if (daan == "正确" || daan == "对") {
                            daan_txt = "正确";
                            daan_txt1 = "对";
                            if (xuan == daan_txt) {
                                log("判断:" + daan_txt)
                            } else if (xuan == daan_txt1) {
                                log("判断:" + daan_txt1)
                            }

                        } else if (daan == "错误" || daan == "错") {
                            daan_txt = "错误";
                            daan_txt1 = "错";
                            if (xuan == daan_txt) {
                                log("判断:" + daan_txt)
                            } else if (xuan == daan_txt1) {
                                log("判断:" + daan_txt1)
                            }

                        } else {
                            log("不知道")
                        };


                        if (xuan == daan_txt || pan == daan_txt1) {
                            //log(xuan)
                            selection.click()
                            x = x + 1;
                        } else {
                            continue
                        }

                    }
                    if (x == 0) {
                        z = z + 1;
                    } else {
                        z = 0
                    }

                }
                x = 0;

                if (z !== 0 && k < tiku.length - 1) {
                    continue
                } else if (z !== 0 && k == tiku.length - 1) {
                    Z = Z + 1;
                    z = 0;
                } else if (z == 0) {
                    break;
                }
                //另一种思路：
                //z = z / (daan.length) 
                //Z = Z + z


            } else {
                X = X + 1;
                if (X == tiku.length) {
                    Y = Y + 1;
                    X = 0;
                }
                continue
            }

        }








    } else {

        log("已获取全部题目");
        break;

    }




}
alert("完事！\n" +
    "此次未收入题库数：" + Y +
    "\n此次未匹配答案数：" + Z);
